# numpy

In [11]:
from numpy import *  
import numpy as np

In [2]:
# arrays(vector) and matrix(2d array)

In [3]:
arr = [1,2,3]
matrix = [[1,2,3],[4,5,6],[7,8,9]]
print(array(arr,dtype=int32),len(array(arr,dtype=int32)),array(arr,dtype=int32).dtype)
print('')
print(array(matrix),len(array(matrix)),array(matrix).dtype)

[1 2 3] 3 int32

[[1 2 3]
 [4 5 6]
 [7 8 9]] 3 int64

In [4]:
# range in numpy 
arange(0,11,2)

array([ 0,  2,  4,  6,  8, 10])

In [93]:
# append
arr1 = arange(5)
arr2 = arange(5,13)
arr3 = np.append(arr1,arr2)
arr3

array([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12])

In [2]:
# concatenate
arr1 = arange(5)
arr2 = arange(5,13)
arr3 = np.concatenate([arr1,arr2])
print(arr3)
# concatenate along second axes
np.c_[np.array([1,2,3]), np.array([4,5,6])]

[ 0  1  2  3  4  5  6  7  8  9 10 11 12]

array([[1, 4],
       [2, 5],
       [3, 6]])

In [89]:
# enumerate in numpy
my_3_3_array = np.arange(9).reshape(3,3)
for index, value in np.ndenumerate(my_3_3_array):
    print(index, value)

(0, 0) 0
(0, 1) 1
(0, 2) 2
(1, 0) 3
(1, 1) 4
(1, 2) 5
(2, 0) 6
(2, 1) 7
(2, 2) 8

In [4]:
# adding new dimensions 
x1 = np.arange(4)
print(x1.shape,'\n')
print("row vector:", x1[np.newaxis, :] )
print(x1[np.newaxis, :].shape)
### create a column vector by adding second dimension
print("\n")
print("column vector:\n", x1[:, np.newaxis])
print(x1[:, np.newaxis].shape)

(4,)

row vector: [[0 1 2 3]]
(1, 4)


column vector:
 [[0]
 [1]
 [2]
 [3]]
(4, 1)

In [227]:
# search in numpy array 
np.searchsorted(arange(0,11,2),5)

3

In [19]:
#invert numbers in binary    
out_num = np.invert([10,11,12]) 
print ("inversion of 10,11,12 : ", out_num)

inversion of 10,11,12 :  [-11 -12 -13]

In [35]:
# find the values which are non zero
arr_non_zero = np.array([[0, 8, 0], [7, 0, 0], [-5, 0, 1]])
out_tpl = arr_non_zero[np.nonzero(arr_non_zero)]
print ("Indices of non zero elements : ", out_tpl)

Indices of non zero elements :  [ 8  7 -5  1]

In [22]:
# replace nan with 0 and +ve inf with a large and -ve inf with a small no
out_arr = np.nan_to_num(np.array([[2, np.inf, 2], [2, 2, np.nan]])) 
print ("output array: ", out_arr)

output array:  [[2.00000000e+000 1.79769313e+308 2.00000000e+000]
 [2.00000000e+000 2.00000000e+000 0.00000000e+000]]

In [11]:
# numpy is faster than math module when working on numbers as its vectorized(works on vectors)
import math
print("Time taken by vectorized operation : ", end = "")
%timeit exp(arange(150))
print(exp(arange(150)))
  
# non-vectorized operation
print("Time taken by non-vectorized operation : ", end = "")
%timeit [math.exp(item) for item in range(150)]

Time taken by vectorized operation : 5.39 µs ± 154 ns per loop (mean ± std. dev. of 7 runs, 100000 loops each)
[1.00000000e+00 2.71828183e+00 7.38905610e+00 2.00855369e+01
 5.45981500e+01 1.48413159e+02 4.03428793e+02 1.09663316e+03
 2.98095799e+03 8.10308393e+03 2.20264658e+04 5.98741417e+04
 1.62754791e+05 4.42413392e+05 1.20260428e+06 3.26901737e+06
 8.88611052e+06 2.41549528e+07 6.56599691e+07 1.78482301e+08
 4.85165195e+08 1.31881573e+09 3.58491285e+09 9.74480345e+09
 2.64891221e+10 7.20048993e+10 1.95729609e+11 5.32048241e+11
 1.44625706e+12 3.93133430e+12 1.06864746e+13 2.90488497e+13
 7.89629602e+13 2.14643580e+14 5.83461743e+14 1.58601345e+15
 4.31123155e+15 1.17191424e+16 3.18559318e+16 8.65934004e+16
 2.35385267e+17 6.39843494e+17 1.73927494e+18 4.72783947e+18
 1.28516001e+19 3.49342711e+19 9.49611942e+19 2.58131289e+20
 7.01673591e+20 1.90734657e+21 5.18470553e+21 1.40934908e+22
 3.83100800e+22 1.04137594e+23 2.83075330e+23 7.69478527e+23
 2.09165950e+24 5.68572000e+24 1.54553894e+25 4.20121040e+25
 1.14200739e+26 3.10429794e+26 8.43835667e+26 2.29378316e+27
 6.23514908e+27 1.69488924e+28 4.60718663e+28 1.25236317e+29
 3.40427605e+29 9.25378173e+29 2.51543867e+30 6.83767123e+30
 1.85867175e+31 5.05239363e+31 1.37338298e+32 3.73324200e+32
 1.01480039e+33 2.75851345e+33 7.49841700e+33 2.03828107e+34
 5.54062238e+34 1.50609731e+35 4.09399696e+35 1.11286375e+36
 3.02507732e+36 8.22301271e+36 2.23524660e+37 6.07603023e+37
 1.65163625e+38 4.48961282e+38 1.22040329e+39 3.31740010e+39
 9.01762841e+39 2.45124554e+40 6.66317622e+40 1.81123908e+41
 4.92345829e+41 1.33833472e+42 3.63797095e+42 9.88903032e+42
 2.68811714e+43 7.30705998e+43 1.98626484e+44 5.39922761e+44
 1.46766223e+45 3.98951957e+45 1.08446386e+46 2.94787839e+46
 8.01316426e+46 2.17820388e+47 5.92097203e+47 1.60948707e+48
 4.37503945e+48 1.18925902e+49 3.23274119e+49 8.78750164e+49
 2.38869060e+50 6.49313426e+50 1.76501689e+51 4.79781333e+51
 1.30418088e+52 3.54513118e+52 9.63666567e+52 2.61951732e+53
 7.12058633e+53 1.93557604e+54 5.26144118e+54 1.43020800e+55
 3.88770841e+55 1.05678871e+56 2.87264955e+56 7.80867107e+56
 2.12261687e+57 5.76987086e+57 1.56841351e+58 4.26338995e+58
 1.15890954e+59 3.15024275e+59 8.56324762e+59 2.32773204e+60
 6.32743171e+60 1.71997426e+61 4.67537478e+61 1.27089863e+62
 3.45466066e+62 9.39074129e+62 2.55266814e+63 6.93887142e+63
 1.88618081e+64 5.12717102e+64]
Time taken by non-vectorized operation : 25.9 µs ± 658 ns per loop (mean ± std. dev. of 7 runs, 10000 loops each)

In [6]:
# 0's and 1's 
print(zeros(3),'\n','\n',zeros((3,3)),'\n')
print(ones(3),'\n','\n',ones((3,3)))

[0. 0. 0.]

 [[0. 0. 0.]
 [0. 0. 0.]
 [0. 0. 0.]]

[1. 1. 1.]

 [[1. 1. 1.]
 [1. 1. 1.]
 [1. 1. 1.]]

In [7]:
# Return evenly spaced numbers over a specified interval.
linspace(0,10,50)

array([ 0.        ,  0.20408163,  0.40816327,  0.6122449 ,  0.81632653,
        1.02040816,  1.2244898 ,  1.42857143,  1.63265306,  1.83673469,
        2.04081633,  2.24489796,  2.44897959,  2.65306122,  2.85714286,
        3.06122449,  3.26530612,  3.46938776,  3.67346939,  3.87755102,
        4.08163265,  4.28571429,  4.48979592,  4.69387755,  4.89795918,
        5.10204082,  5.30612245,  5.51020408,  5.71428571,  5.91836735,
        6.12244898,  6.32653061,  6.53061224,  6.73469388,  6.93877551,
        7.14285714,  7.34693878,  7.55102041,  7.75510204,  7.95918367,
        8.16326531,  8.36734694,  8.57142857,  8.7755102 ,  8.97959184,
        9.18367347,  9.3877551 ,  9.59183673,  9.79591837, 10.        ])

In [79]:
# iterating through arrays
for i in array([1,2,3,4,5]):
    print(i)
for i, val in enumerate(array([1,2,3,4,5])):
    print(i, val)

1
2
3
4
5
0 1
1 2
2 3
3 4
4 5

In [80]:
# iterate through matrix 
arr = np.array([[[1, 2], [3, 4]], [[5, 6], [7, 8]]])
for x in np.nditer(arr):
    print(x)
arr = np.array([[1, 2, 3, 4], [5, 6, 7, 8]])
for idx, x in np.ndenumerate(arr):
    print(idx, x)

1
2
3
4
5
6
7
8
(0, 0) 1
(0, 1) 2
(0, 2) 3
(0, 3) 4
(1, 0) 5
(1, 1) 6
(1, 2) 7
(1, 3) 8

In [8]:
# identity matrix 
eye(3)

array([[1., 0., 0.],
       [0., 1., 0.],
       [0., 0., 1.]])

In [9]:
# random 
# interbal is always [a,b) includes a and excludes b

In [44]:
# random b/w 0 to 1  
print(random.random(3))
print(random.random((3,3)))

[0.55877651 0.71245806 0.96763268]
[[0.11073795 0.11997001 0.01637865]
 [0.85546639 0.88789953 0.23127915]
 [0.68128318 0.37998368 0.81648736]]

In [41]:
# uniform distribution between 0&1
print(random.rand(3))
print(random.rand(3,3))

[0.79103485 0.65171793 0.83793901]
[[0.35933093 0.76408715 0.62685391]
 [0.28101489 0.63894831 0.38187164]
 [0.37810567 0.02418898 0.08727117]]

In [23]:
# normal distribution mean 0 & variance 1 
print(random.randn(3))
print(random.randn(3,3))

[0.82322646 0.01272209 0.67721033]
[[ 0.57621098 -0.51440296  1.10548711]
 [ 1.67451427  1.90460228  0.75908355]
 [ 1.12247638 -0.94633383  1.3058865 ]]

In [2]:
# random int 
# min and max value of random int index 
print(list(random.randint(1,100,10)),random.randint(1,100,10).dtype,
      random.randint(1,100,10).argmin(),random.randint(1,100,10).argmax())
# random int for a 2d matrix 
print(np.random.randint(0,10,(3,4)))
# uniform distribution b/w a to b and gives float values 
print(list(random.uniform(1,100,10)),random.uniform(1,100,10).dtype)
# normal distribution b/w a to b 
print(list(random.normal(1,100,10)),random.normal(1,100,10).dtype)
# normal distribution for a 2d matrix
print(np.random.normal(0,1,(3,3)))

[70, 29, 79, 37, 56, 49, 84, 83, 51, 53] int64 4 0
[[4 5 3 6]
 [4 5 2 3]
 [5 5 8 5]]
[19.13516311127103, 35.43868688342618, 42.74591555011471, 71.40925133945802, 98.84492530012984, 59.44522288150705, 94.19352270679475, 50.11877317025728, 88.10100521674579, 69.33270164522074] float64
[-140.1936874683447, 62.20461997569341, -72.2594087328951, -57.746611176318794, 14.615806020358418, 26.449584741520248, 231.79596464897074, 1.2512465617189419, 29.424720615512005, 84.26016982803422] float64
[[ 0.34445637 -0.67476633  1.334322  ]
 [ 0.75283798  1.52461199  0.65545497]
 [-1.12127774 -0.05239324  0.82684438]]

In [57]:
# random sampling with probability for each sample 
# below we have 5 samples of size 1000 with equal probability of occuring  
gfg = np.random.choice(5, 1000, p =[0.2, 0.2, 0.2, 0.2, 0.2])
print(gfg)

[3 4 0 0 1 2 4 3 4 1 1 3 3 3 4 4 4 0 3 3 3 3 4 0 1 4 3 2 4 3 0 2 3 0 2 1 2
 0 2 3 2 1 1 4 3 0 4 0 0 3 4 0 3 4 1 1 0 4 4 3 1 0 3 1 2 4 2 1 0 4 3 2 3 0
 3 0 0 2 4 3 0 3 4 1 0 1 0 4 3 0 1 4 2 4 0 1 3 1 1 4 0 2 2 1 1 2 4 0 2 4 0
 2 1 0 3 0 4 0 4 2 2 4 2 3 1 4 4 4 4 4 2 2 2 0 4 2 2 3 3 3 3 2 1 2 3 2 2 1
 0 0 3 4 1 0 2 3 0 4 3 4 1 3 0 0 2 0 4 0 4 3 4 1 1 4 3 4 1 4 4 2 1 2 4 4 3
 1 2 0 2 1 3 4 3 4 3 4 0 4 4 1 0 2 2 1 3 1 0 1 1 0 0 3 1 4 1 4 3 4 1 0 3 0
 0 2 4 3 2 0 2 3 4 1 1 3 4 2 2 1 1 2 2 3 4 4 0 0 1 0 3 2 0 3 0 1 2 3 0 0 4
 4 2 1 2 0 3 2 0 2 3 4 0 4 3 0 2 2 2 0 2 3 2 3 0 1 3 0 3 1 1 0 1 0 2 4 2 4
 3 2 2 0 4 1 1 3 0 0 1 4 0 0 1 2 2 1 1 4 3 3 1 2 0 0 4 3 2 4 3 1 0 2 1 1 4
 1 2 3 4 4 0 3 1 1 1 0 4 0 4 2 3 2 4 1 2 1 1 0 0 2 0 1 0 2 3 0 3 2 2 4 4 2
 0 3 2 0 1 2 1 4 0 0 0 2 3 2 0 4 1 0 2 4 3 2 0 2 4 3 0 1 1 1 2 2 3 4 3 4 1
 4 4 1 0 0 4 1 1 2 4 2 1 4 1 1 4 2 1 4 1 3 2 3 2 4 4 1 3 2 1 1 3 2 2 2 3 3
 4 1 1 4 2 0 1 0 0 0 2 1 2 3 3 3 2 4 4 4 1 0 2 3 1 3 4 3 2 4 3 2 1 2 0 3 2
 0 4 4 2 0 4 4 4 1 2 3 4 4 4 3 1 2 2 1 2 4 1 0 1 4 2 4 0 3 2 3 2 1 4 0 2 1
 3 4 1 1 2 2 2 4 1 3 4 4 2 1 2 2 3 4 4 1 4 1 0 2 4 4 4 3 3 3 0 2 1 3 2 1 0
 2 0 3 0 4 4 2 0 2 3 2 1 0 2 0 2 4 2 1 3 4 1 1 2 3 0 0 1 4 1 4 3 4 4 0 1 3
 2 3 3 2 1 2 2 3 0 4 4 2 1 2 3 3 0 1 1 0 4 1 2 0 4 3 0 2 1 1 1 0 2 2 3 1 0
 1 2 3 0 0 0 3 4 4 1 2 1 0 2 4 4 1 4 3 0 4 1 4 4 2 4 1 1 2 4 4 2 3 3 2 3 1
 0 0 1 4 1 4 3 4 2 4 2 0 1 4 4 4 3 4 4 4 4 0 1 0 0 4 1 2 0 1 3 0 4 0 0 3 4
 0 4 4 4 0 1 3 0 2 1 2 2 0 4 3 1 2 1 1 3 1 4 3 4 1 0 3 1 0 3 0 1 0 3 0 2 3
 1 4 1 3 4 3 3 4 1 4 4 2 4 3 3 0 2 2 4 2 0 4 3 4 2 1 2 1 3 2 0 3 0 4 3 2 4
 4 0 3 3 3 0 2 2 4 2 4 2 3 2 1 1 1 0 2 2 2 0 4 1 1 0 0 0 4 3 4 2 0 1 2 4 4
 2 3 2 4 3 3 2 1 3 4 4 0 1 4 2 1 0 0 3 2 4 0 2 4 0 2 2 1 3 2 3 3 3 4 2 0 4
 1 4 1 0 2 2 3 4 1 3 2 2 3 3 2 4 2 2 3 1 1 4 2 2 2 2 3 0 3 3 0 0 2 4 2 4 3
 4 3 3 1 2 2 1 0 0 3 2 2 0 4 2 1 3 4 1 2 4 4 0 3 0 3 4 0 4 4 3 1 2 2 1 3 4
 2 0 4 1 2 3 0 4 1 0 1 3 1 1 3 1 4 3 3 0 3 4 1 3 0 4 0 3 0 2 0 1 2 2 3 0 2
 3 0 0 1 4 4 4 0 4 0 2 3 0 2 3 4 0 0 4 4 1 2 0 1 2 0 2 0 1 3 1 2 0 3 0 4 0
 2]

In [38]:
# permutations 
box = np.array([1,2,3])
shaker = np.random.randint(0, len(box), size=10)
print(shaker)
box.take(shaker) # perm numpy array based on above permutation

[0 0 1 2 0 1 2 0 1 1]

array([1, 1, 2, 3, 1, 2, 3, 1, 2, 2])

In [5]:
# shuffles the array 
arr = array([1,6,4,8,5])
random.shuffle(arr)
arr

array([1, 8, 5, 6, 4])

In [13]:
# reshape(rows,cols)

In [10]:
# 1d to 2d
print(arange(25).reshape(5,5), '\n\n', arange(25).reshape(5,5).reshape(25))
print('\n',arange(25).reshape(5,5).shape,arange(25).reshape(5,5).size,arange(25).reshape(5,5).ndim)
#1d to 3d
print('\n',arange(24).reshape(4,2,3))
# (mrows,ncols) -> (m*n rows, 1 col)
z = np.array([[1, 2, 3, 4],
         [5, 6, 7, 8],
         [9, 10, 11, 12]])
print('\n',z.reshape(-1,1).shape)
# (mrows,ncols) -> (1 row, m*n col)
print('\n',z.reshape(1,-1).shape)

[[ 0  1  2  3  4]
 [ 5  6  7  8  9]
 [10 11 12 13 14]
 [15 16 17 18 19]
 [20 21 22 23 24]]

 [ 0  1  2  3  4  5  6  7  8  9 10 11 12 13 14 15 16 17 18 19 20 21 22 23
 24]

 (5, 5) 25 2

 [[[ 0  1  2]
  [ 3  4  5]]

 [[ 6  7  8]
  [ 9 10 11]]

 [[12 13 14]
  [15 16 17]]

 [[18 19 20]
  [21 22 23]]]

 (12, 1)

 (1, 12)

In [5]:
# reshape vs resize
# resize reshapes inplace 
original = np.arange(9)
print(original.reshape((3,3)),'\n')
print(original,'\n')
original.resize((3,3))
print(original)

[[0 1 2]
 [3 4 5]
 [6 7 8]]

[0 1 2 3 4 5 6 7 8]

[[0 1 2]
 [3 4 5]
 [6 7 8]]

In [8]:
# add a new axes 
x = np.array([1, 2])
y = np.expand_dims(x, axis=0)
z = np.expand_dims(x, axis=1)
print(x.shape, y.shape, z.shape)

(2,) (1, 2) (2, 1)

In [41]:
# deep copy in numpy 
original = np.arange(9).reshape((3,3))
copy = original.copy()
copy[2,1] = 100
print(original,'\n\n',copy)

[[0 1 2]
 [3 4 5]
 [6 7 8]]

 [[  0   1   2]
 [  3   4   5]
 [  6 100   8]]

In [2]:
# shallow copy but creates a new array
original = np.arange(9).reshape((3,3))
copy = original.view()
copy[2,1] = 100
print(original,'\n\n',copy)

[[  0   1   2]
 [  3   4   5]
 [  6 100   8]]

 [[  0   1   2]
 [  3   4   5]
 [  6 100   8]]

In [44]:
# insert in both col and rows 
num1 = np.arange(9)
print(np.insert(num1,1,50))
num2 = np.arange(12).reshape((3,4))
print(num2)
print(np.insert(num2,1,60,axis = 1)) # at columns insert a scalar 
print(np.insert(num2, [1], [[6],[9]], axis = 0)) # at rows insert array 
print(np.insert(num2, (0, 3), 66, axis = 1)) # insert at two different places

[ 0 50  1  2  3  4  5  6  7  8]
[[ 0  1  2  3]
 [ 4  5  6  7]
 [ 8  9 10 11]]
[[ 0 60  1  2  3]
 [ 4 60  5  6  7]
 [ 8 60  9 10 11]]
[[ 0  1  2  3]
 [ 6  6  6  6]
 [ 9  9  9  9]
 [ 4  5  6  7]
 [ 8  9 10 11]]
[[66  0  1  2 66  3]
 [66  4  5  6 66  7]
 [66  8  9 10 66 11]]

In [46]:
# delete from both cols and rows  
print(num2)
print(np.delete(num2,1,axis = 1)) # inserting from cols 
print(np.delete(num2,1,axis = 0)) # inserting from rows

[[ 0  1  2  3]
 [ 4  5  6  7]
 [ 8  9 10 11]]
[[ 0  2  3]
 [ 4  6  7]
 [ 8 10 11]]
[[ 0  1  2  3]
 [ 8  9 10 11]]

In [16]:
# indexing & broadcasting

In [15]:
arr = arange(0,11,2)
arr[:4:2] = 100
arr
print(arr[1:arr.size:2])

[ 2  6 10]

In [6]:
# matrix indexing 
matrix = array(([1,2,3],[4,5,6],[7,8,9]))
# 1st row and 2nd column value [row,column]
print(matrix[1,2])
# upto 2nd row and from 1st column    
print(matrix[:2,1:])
#matrix slicing
arr = np.random.randint(10, size=(3,4))
print(arr)
print(arr[:3, ::2])

6
[[2 3]
 [5 6]]
[[0 4 6 3]
 [9 9 3 4]
 [3 5 8 2]]
[[0 6]
 [9 3]
 [3 8]]

In [36]:
# boolean indexing with broadcasting 
# replace values that are 1.5 more than std  
mat = random.rand(5, 5)
mat[abs(mat-mat.mean()) > 1.5 * mat.std()] = mat.mean()
mat

array([[0.51013818, 0.93093689, 0.5838868 , 0.90087481, 0.4263005 ],
       [0.51834089, 0.42942757, 0.33284419, 0.93082394, 0.20655949],
       [0.20696655, 0.56781012, 0.72779212, 0.09748836, 0.42039944],
       [0.52183836, 0.1401716 , 0.79758425, 0.09110487, 0.80358438],
       [0.61662568, 0.88332148, 0.31212885, 0.81814127, 0.457571  ]])

In [19]:
# conditional selection
# remember we use & for and | for or in numpy as well as pandas 
# using any and all for conditional selection

In [8]:
arr = arange(11)
print(arr[arr>5][3:],arr[arr%2 == 0][:4],arr[(arr>2)&(arr<7)],arr[(arr<2)|(arr>7)], arr[~(arr>7)])
print(arr[arr>5].any(), arr[arr>5].all())

[ 9 10] [0 2 4 6] [3 4 5 6] [ 0  1  8  9 10] [0 1 2 3 4 5 6 7]
True True

In [15]:
# ternary conditions 
a = np.array([[0, 1, 2],
              [0, 2, 4],
              [0, 3, 6]])
np.where(a < 4, a, -1)  # -1 is broadcast

array([[ 0,  1,  2],
       [ 0,  2, -1],
       [ 0,  3, -1]])

In [12]:
# operations
print(arr + arr)
print(arr ** 2)
# logical and, or 
arr1 = np.array([1,True,2,False])
arr2 = np.array([0,True,3,True])
print(np.logical_and(arr1,arr2),np.logical_or(arr1,arr2))

[ 0  2  4  6  8 10 12 14 16 18 20]
[  0   1   4   9  16  25  36  49  64  81 100]
[False  True  True False] [ True  True  True  True]

In [3]:
np.abs(array([-12,10,5,-6])), np.std(array([-12,10,5,-6]))

(array([12, 10,  5,  6]), 8.699856320652657)

In [88]:
# sort a vector
print(np.sort(np.array([1,7,3,9,2])),'\n')
# sort a matrix(will be sorted both row and column wise combindly) 
a = np.array([[1,5,7],[6,2,4],[9,3,8]])
print(a,'\n')
print(np.sort(a,axis = 0),'\n') # sort first axis
print(np.sort(a,axis = 1),'\n') # sort second axis
print(np.sort(a)) # sort last axis

[1 2 3 7 9]

[[1 5 7]
 [6 2 4]
 [9 3 8]]

[[1 2 4]
 [6 3 7]
 [9 5 8]]

[[1 5 7]
 [2 4 6]
 [3 8 9]]

[[1 5 7]
 [2 4 6]
 [3 8 9]]

In [42]:
# addiion of matrix and vector using broadcasting  
mat = arange(9).reshape((3, 3))
vec = arange(3)
print(mat, vec, mat + vec,sep = '\n')

[[0 1 2]
 [3 4 5]
 [6 7 8]]
[0 1 2]
[[ 0  2  4]
 [ 3  5  7]
 [ 6  8 10]]

In [105]:
# check if two arrays are equal 
mat1 = np.arange(9).reshape((3,3))
mat2 = np.arange(9).reshape((3,3))
np.allclose(mat1,mat2)

True

In [78]:
# covariance :- 
"""
Covariance provides the a measure of strength of correlation between two variable or more set of 
variables. The covariance matrix element Cij is the covariance of xi and xj. The element Cii is 
the variance of xi. 
If COV(xi, xj) = 0 then variables are uncorrelated
If COV(xi, xj) > 0 then variables positively correlated
If COV(xi, xj) > < 0 then variables negatively correlated
"""
"""
Covariance indicates the direction of the linear relationship between variables while correlation 
measures both the strength and direction of the linear relationship between two variables. 
Correlation is a function of the covariance
"""
x = np.array([[0, 3, 4], [1, 2, 4], [3, 4, 5]])
print("Shape of array:\n", np.shape(x))
print("Covariance matrix of x:\n", np.cov(x))

Shape of array:
 (3, 3)
Covariance matrix of x:
 [[4.33333333 2.83333333 2.        ]
 [2.83333333 2.33333333 1.5       ]
 [2.         1.5        1.        ]]

In [27]:
# structured array(similar to c struct which has fields) 
person_data_def = [('name','U8'),('height','f8'),('weight','f8'), ('age', 'i8')]
a = np.array([('upendra', 5.6, 65.23, 27), ('harindra', 5.7, 70.08, 34)], 
       dtype=person_data_def)
print(a,a[0],a['name'],'\n',a[['name','age']])
# sort the struct using field 
print(np.sort(a,order = 'name'))

[('upendra', 5.6, 65.23, 27) ('harindra', 5.7, 70.08, 34)] ('upendra', 5.6, 65.23, 27) ['upendra' 'harindra']
 [('upendra', 27) ('harindra', 34)]
[('harindra', 5.7, 70.08, 34) ('upendra', 5.6, 65.23, 27)]

In [2]:
# universal functions(ufunc)
mat = arange(25).reshape(5,5)
print(mat)
# column & row sum; same for min & max & prod
print(f'sum of all elements in matrix {sum(mat)}')
print(f'column sum is {mat.sum(axis = 0)} and row sum is {mat.sum(axis = 1)}')
# cumulative sum 
print(f'column cumsum is \n {mat.cumsum(axis = 0)}  \n row cumsum is \n {mat.cumsum(axis = 1)}')
# variance, mean and std of array and matrix    
normal_arr = random.randn(3)
print(f'variance is {normal_arr.var()} and std is {sqrt(normal_arr.var())}')
print(f'mean is {normal_arr.mean()}')
print(f'column mean is {mat.mean(0)} and row mean is {mat.mean(1)}')

# mean of an array ignoring missing values 
arr = np.array([[20, 15, 37], [47, 13, np.nan]])   
print("Using nanmean function:", np.nanmean(arr)) # other op like nanmax, nanmin can be done 

# difference b/w each element 
# we can even find the diff b/w diff by giving n = 2
diff_array = np.array([1, 7, 19, 37, 61, 91, 127, 169, 217, 271, 331])
print(f'difference b/w each element in {diff_array} is {np.diff(diff_array)} and  difference b/w the prev is {np.diff(diff_array, n = 2)}')

[[ 0  1  2  3  4]
 [ 5  6  7  8  9]
 [10 11 12 13 14]
 [15 16 17 18 19]
 [20 21 22 23 24]]
sum of all elements in matrix 300
column sum is [50 55 60 65 70] and row sum is [ 10  35  60  85 110]
column cumsum is
 [[ 0  1  2  3  4]
 [ 5  7  9 11 13]
 [15 18 21 24 27]
 [30 34 38 42 46]
 [50 55 60 65 70]]
 row cumsum is
 [[  0   1   3   6  10]
 [  5  11  18  26  35]
 [ 10  21  33  46  60]
 [ 15  31  48  66  85]
 [ 20  41  63  86 110]]
variance is 0.7260848708543821 and std is 0.8521061382564863
mean is 0.4357188239795602
column mean is [10. 11. 12. 13. 14.] and row mean is [ 2.  7. 12. 17. 22.]
Using nanmean function: 26.4
difference b/w each element in [  1   7  19  37  61  91 127 169 217 271 331] is [ 6 12 18 24 30 36 42 48 54 60] and  difference b/w the prev is [6 6 6 6 6 6 6 6 6]

In [84]:
# creating a ufunc 
def truncated_binomial(x):
    return (x+1)**3 - (x)**3
test_array = np.arange(10)
# pass array to new u func created  
print(truncated_binomial(test_array))
# assertions on ufunc 
try:
    np.testing.assert_equal(truncated_binomial(4), 65)
except AssertionError:
    print('oops wrong assertion')

[  1   7  19  37  61  91 127 169 217 271]
oops wrong assertion

In [18]:
# creating a custom broadcasting function 
v = arange(-3, 3)
nv = array([-1, nan, 1])
@np.vectorize
def isneg(n):
    return np.isnan(n) or n < 0
nv[isneg(nv)] = 0
v[isneg(v)] = 0
print(nv,v)

[0. 0. 1.] [0 0 0 0 1 2]

In [50]:
# dumping a numpy matrix to a pickle(binary)
import pickle
pickle.loads(mat.dumps())

array([[ 0,  1,  2,  3,  4],
       [ 5,  6,  7,  8,  9],
       [10, 11, 12, 13, 14],
       [15, 16, 17, 18, 19],
       [20, 21, 22, 23, 24]])

In [8]:
# universal functions contd
arr = random.randint(0,100,10)
print(arr)
print('max',arr.max())# same for min 
print('max index',arr.argmax())
# min of an array ignoring missing values; same for max 
arr = np.array([[20, 15, 37], [47, 13, np.nan]])   
print("Using nanmin function:", np.nanmin(arr))
# sin 90
print(sin(pi/2),'\n')
# max b/w two array elements
# Return a sample from the "standard normal" distribution.
A = np.random.randn(10)
B = np.random.randn(10)
np.maximum(A,B)

[ 1  4 26 66 22 42 62 66 48 93]
max 93
max index 9
Using nanmin function: 13.0
1.0

array([-0.51659813,  0.01515307,  0.53616721, -0.26981026,  1.98314362,
        0.95496967, -0.72643885,  0.6349141 ,  0.12169733,  0.78847373])

In [29]:
# concatenating 2 matrices using h and v stack 
arr1 = array(([0,1,2],[3,4,5]))
arr2 = array(([6,7,8],[9,10,11]))
print(vstack((arr1,arr2)),'\n')
print(hstack((arr1,arr2)),'\n')
# concatenating 2 vectors 
print(hstack((array([1,2,3]),array([4,5,6]))),'\n')
print('\n')
print(vstack((array([1,2,3]),array([4,5,6]))))

[[ 0  1  2]
 [ 3  4  5]
 [ 6  7  8]
 [ 9 10 11]]

[[ 0  1  2  6  7  8]
 [ 3  4  5  9 10 11]]

[1 2 3 4 5 6]



[[1 2 3]
 [4 5 6]]

In [30]:
# splitting a matrix using h and v split 
num = np.arange(9).reshape((3,3))
print(num,'\n')
print(hsplit(num,3),'\n')
print(vsplit(num,3),'\n')
num2 = np.arange(27).reshape((3,3,3))
print(num2,'\n')
# depth wise split in a 3d array
print(dsplit(num2,3))

[[0 1 2]
 [3 4 5]
 [6 7 8]]

[array([[0],
       [3],
       [6]]), array([[1],
       [4],
       [7]]), array([[2],
       [5],
       [8]])]

[array([[0, 1, 2]]), array([[3, 4, 5]]), array([[6, 7, 8]])]

[[[ 0  1  2]
  [ 3  4  5]
  [ 6  7  8]]

 [[ 9 10 11]
  [12 13 14]
  [15 16 17]]

 [[18 19 20]
  [21 22 23]
  [24 25 26]]]

[array([[[ 0],
        [ 3],
        [ 6]],

       [[ 9],
        [12],
        [15]],

       [[18],
        [21],
        [24]]]), array([[[ 1],
        [ 4],
        [ 7]],

       [[10],
        [13],
        [16]],

       [[19],
        [22],
        [25]]]), array([[[ 2],
        [ 5],
        [ 8]],

       [[11],
        [14],
        [17]],

       [[20],
        [23],
        [26]]])]

In [33]:
# flatten a matrix into an array 
arr2.flatten(), arr.ravel()

(array([ 6,  7,  8,  9, 10, 11]), array([20., 15., 37., 47., 13., nan]))

In [65]:
# rearrange 
# flip the array both col(left right) and row wise(up down) and roll(shift by places, also in reverse(-1))
num = np.arange(9).reshape((3,3))
print(num,'\n\n',np.flip(num,1),'\n\n',np.flip(num,0),'\n\n',
      np.roll(num,1,0),'\n\n',np.roll(num,1,1),'\n\n',np.roll(num,-1,0),'\n\n',np.roll(num,-1,1))

[[0 1 2]
 [3 4 5]
 [6 7 8]]

 [[2 1 0]
 [5 4 3]
 [8 7 6]]

 [[6 7 8]
 [3 4 5]
 [0 1 2]]

 [[6 7 8]
 [0 1 2]
 [3 4 5]]

 [[2 0 1]
 [5 3 4]
 [8 6 7]]

 [[3 4 5]
 [6 7 8]
 [0 1 2]]

 [[1 2 0]
 [4 5 3]
 [7 8 6]]

In [77]:
# numpy bin count 
inp_arr = np.array([1, 2, 5, 6, 2, 1, 8, 8, 8])
x = np.bincount(inp_arr)
print(f"Output of bincount is for the bin {[0,1,2,3,4,5,6,7,8]} :", x)

Output of bincount is for the bin [0, 1, 2, 3, 4, 5, 6, 7, 8] : [0 2 2 0 0 1 1 0 3]

In [26]:
# sort the array 
sorted(list(array([5,1,2,7,9])))
mat_sort = array(([2,6,1],[7,2,4],[8,9,0]))
mat_sort.sort(axis = 1)
mat_sort

array([[1, 2, 6],
       [2, 4, 7],
       [0, 8, 9]])

In [11]:
# save npy and npz files
arr = np.arange(5)
# npy
np.save('data/my_array',arr)
print(np.load('data/my_array.npy'))
#npz
np.savez('data/two_arrays.npz',x=arr,y=arr, z=arr)
archive_array = np.load('data/two_arrays.npz')
archive_array['z']

[0 1 2 3 4]

array([0, 1, 2, 3, 4])

In [82]:
# read and write numpy arrays to a csv file
data = array(([2,6,1],[7,2,4],[8,9,0]))
np.savetxt('data/npdata.csv', data, delimiter=',')
data_read = np.loadtxt('data/npdata.csv', delimiter=',')
# print the array
print(data_read)

[[2. 6. 1.]
 [7. 2. 4.]
 [8. 9. 0.]]

In [12]:
# matrix transpose 
print(mat)
print('\n')
print(mat.T)

# tranpose a 3d matrices 
arr3d = np.arange(50).reshape((5,5,2))
print('\n',arr3d)
arr3d.transpose((1,0,2))

[[ 0  1  2  3  4]
 [ 5  6  7  8  9]
 [10 11 12 13 14]
 [15 16 17 18 19]
 [20 21 22 23 24]]


[[ 0  5 10 15 20]
 [ 1  6 11 16 21]
 [ 2  7 12 17 22]
 [ 3  8 13 18 23]
 [ 4  9 14 19 24]]

 [[[ 0  1]
  [ 2  3]
  [ 4  5]
  [ 6  7]
  [ 8  9]]

 [[10 11]
  [12 13]
  [14 15]
  [16 17]
  [18 19]]

 [[20 21]
  [22 23]
  [24 25]
  [26 27]
  [28 29]]

 [[30 31]
  [32 33]
  [34 35]
  [36 37]
  [38 39]]

 [[40 41]
  [42 43]
  [44 45]
  [46 47]
  [48 49]]]

array([[[ 0,  1],
        [10, 11],
        [20, 21],
        [30, 31],
        [40, 41]],

       [[ 2,  3],
        [12, 13],
        [22, 23],
        [32, 33],
        [42, 43]],

       [[ 4,  5],
        [14, 15],
        [24, 25],
        [34, 35],
        [44, 45]],

       [[ 6,  7],
        [16, 17],
        [26, 27],
        [36, 37],
        [46, 47]],

       [[ 8,  9],
        [18, 19],
        [28, 29],
        [38, 39],
        [48, 49]]])

In [85]:
# swap axes  and roll axes back
swap = np.arange(60).reshape(2,5,2,3)
print(np.swapaxes(swap,3,0).shape , np.rollaxis(swap,3,1).shape)

(3, 5, 2, 2) (2, 3, 5, 2)

In [77]:
# repeat row and col wise 
num = np.arange(25).reshape((5,5))
print(np.repeat(num,2,axis = 0), '\n\n', np.repeat(num,2,axis = 1))

[[ 0  1  2  3  4]
 [ 0  1  2  3  4]
 [ 5  6  7  8  9]
 [ 5  6  7  8  9]
 [10 11 12 13 14]
 [10 11 12 13 14]
 [15 16 17 18 19]
 [15 16 17 18 19]
 [20 21 22 23 24]
 [20 21 22 23 24]]

 [[ 0  0  1  1  2  2  3  3  4  4]
 [ 5  5  6  6  7  7  8  8  9  9]
 [10 10 11 11 12 12 13 13 14 14]
 [15 15 16 16 17 17 18 18 19 19]
 [20 20 21 21 22 22 23 23 24 24]]

In [19]:
# matrix addition
print(mat,'\n')
print(mat + mat)

[[ 0  1  2  3  4]
 [ 5  6  7  8  9]
 [10 11 12 13 14]
 [15 16 17 18 19]
 [20 21 22 23 24]]

[[ 0  2  4  6  8]
 [10 12 14 16 18]
 [20 22 24 26 28]
 [30 32 34 36 38]
 [40 42 44 46 48]]

In [28]:
# matrix dot product(matrix multiplication) 
print(mat.dot(mat.T),'\n')
print(mat @ mat.T,'\n')
print(np.matmul(mat,mat.T))

[[  30   80  130  180  230]
 [  80  255  430  605  780]
 [ 130  430  730 1030 1330]
 [ 180  605 1030 1455 1880]
 [ 230  780 1330 1880 2430]]

[[  30   80  130  180  230]
 [  80  255  430  605  780]
 [ 130  430  730 1030 1330]
 [ 180  605 1030 1455 1880]
 [ 230  780 1330 1880 2430]]

[[  30   80  130  180  230]
 [  80  255  430  605  780]
 [ 130  430  730 1030 1330]
 [ 180  605 1030 1455 1880]
 [ 230  780 1330 1880 2430]]

In [27]:
# inverse matrix(applied only on square matrices with same no of rows and cols) 
x = array([[1,2],[3,4]]) 
print(linalg.inv(x))

[[-2.   1. ]
 [ 1.5 -0.5]]

In [7]:
# sum the diagonal elements from left to right 
x = array([[1,2],[3,4]]) 
print(np.trace(x))

5

In [36]:
# matrix diagonal values
a = np.matrix([[1, 21, 30],
                 [63 ,434, 3],
                 [54, 54, 56]])
print("Main Diagonal elements : \n", np.diag(a), "\n")
print("Diagonal above main diagonal : \n", np.diag(a, 1), "\n")
print("Diagonal below main diagonal : \n", np.diag(a, -1))

Main Diagonal elements :
 [  1 434  56]

Diagonal above main diagonal :
 [21  3]

Diagonal below main diagonal :
 [63 54]

In [81]:
# eigen vector and value 
A = np.array([[2,1],
              [1,2]])

eVals, eVecs = np.linalg.eig(A)
print(eVals)
print(eVecs)

[3. 1.]
[[ 0.70710678 -0.70710678]
 [ 0.70710678  0.70710678]]

In [28]:
# structured array and sorting 
dtypes = [('name', 'S10'), ('grad_year', int), ('cgpa', float)] 
values = [('Hrithik', 2009, 8.5), ('Ajay', 2008, 8.7),  
           ('Pankaj', 2008, 7.9), ('Aakash', 2009, 9.0)] 
struct_arr = array(values,dtypes)
struct_arr.sort(order='name')
struct_arr

array([(b'Aakash', 2009, 9. ), (b'Ajay', 2008, 8.7),
       (b'Hrithik', 2009, 8.5), (b'Pankaj', 2008, 7.9)],
      dtype=[('name', 'S10'), ('grad_year', '<i8'), ('cgpa', '<f8')])

In [94]:
# unique values
names = array(['Bob', 'Joe', 'Will', 'Bob', 'Will', 'Joe', 'Joe'])
unique(names,return_counts = True)

(array(['Bob', 'Joe', 'Will'], dtype='<U4'), array([2, 3, 2]))

In [28]:
# get the numeric representation of an array by identifying distinct values
labels, uniques = pd.factorize(['b', 'd', 'd', 'c', 'a', 'c', 'a', 'b'], sort = True)
print("Numeric Representation : \n", labels)
print("Unique Values : \n", uniques)

Numeric Representation :
 [1 3 3 2 0 2 0 1]
Unique Values :
 ['a' 'b' 'c' 'd']

In [25]:
# time series
arange('2015-02-03', '2015-03-01', 7, dtype='datetime64[D]')

array(['2015-02-03', '2015-02-10', '2015-02-17', '2015-02-24'],
      dtype='datetime64[D]')

In [26]:
# generating numpy array from a txt file 
import urllib.request
urllib.request.urlretrieve('https://www1.ncdc.noaa.gov/pub/data/ghcn/daily/readme.txt',
                           'readme.txt')
urllib.request.urlretrieve('https://www1.ncdc.noaa.gov/pub/data/ghcn/daily/ghcnd-stations.txt',
                           'stations.txt')

('stations.txt', <http.client.HTTPMessage at 0x7f91f4398128>)

In [35]:
# we can give space b/w cols and even names to the cols along with their types
stations = np.genfromtxt('stations.txt', delimiter=[11,9,10,7,3,31,4,4,6],
                                         names=['id','latitude','longitude','elevation','state','name',
                                                'gsn','hcn','wmo'],
                                         dtype=['U11','d','d','d','U3','U31','U4','U4','U6'],
                                         autostrip=True)
stations

array([('ACW00011604',  17.1167, -61.7833,   10.1, '', 'ST JOHNS COOLIDGE FLD', '', '', ''),
       ('ACW00011647',  17.1333, -61.7833,   19.2, '', 'ST JOHNS', '', '', ''),
       ('AE000041196',  25.333 ,  55.517 ,   34. , '', 'SHARJAH INTER. AIRP', 'GSN', '', '41196'),
       ...,
       ('ZI000067977', -21.017 ,  31.583 ,  430. , '', 'BUFFALO RANGE', '', '', '67977'),
       ('ZI000067983', -20.2   ,  32.616 , 1132. , '', 'CHIPINGE', 'GSN', '', '67983'),
       ('ZI000067991', -22.217 ,  30.    ,  457. , '', 'BEITBRIDGE', '', '', '67991')],
      dtype=[('id', '<U11'), ('latitude', '<f8'), ('longitude', '<f8'), ('elevation', '<f8'), ('state', '<U3'), ('name', '<U31'), ('gsn', '<U4'), ('hcn', '<U4'), ('wmo', '<U6')])

In [37]:
# we can do selection based on col name given above 
stations[stations['name'] == 'PASADENA']

array([('USC00046719', 34.1483, -118.1447, 263.3, 'CA', 'PASADENA', '', 'HCN', '')],
      dtype=[('id', '<U11'), ('latitude', '<f8'), ('longitude', '<f8'), ('elevation', '<f8'), ('state', '<U3'), ('name', '<U31'), ('gsn', '<U4'), ('hcn', '<U4'), ('wmo', '<U6')])

In [69]:
# return the indices of sorted values in the unsorted array
unsorted_array = array([1,5,3,6,4,2,7]) 
sorted_array = unsorted_array.argsort()[:5]
sorted_array

array([0, 5, 2, 4, 1])

In [13]:
# group by operations using numpy 
countries = np.array(['india', 'uk', 'india', 'uk', 'china', 'usa', 'china', 'china'])
deaths = np.array([10,20, 30, 40, 1, 23, 56, 1])
unique_countries = np.unique(countries)
dict([(country, deaths[countries==country].sum()) for country in unique_countries])

{'china': 58, 'india': 40, 'uk': 60, 'usa': 23}

In [7]:
# percentile
# 1D array
arr = [20, 2, 7, 1, 34]
print("arr : ", arr)
print("50th percentile of arr : ",
       np.percentile(arr, 50))
print("25th percentile of arr : ",
       np.percentile(arr, 25))
print("75th percentile of arr : ",
       np.percentile(arr, 75))

arr :  [20, 2, 7, 1, 34]
50th percentile of arr :  7.0
25th percentile of arr :  2.0
75th percentile of arr :  20.0

In [5]:
# linear regression in numpy 
x = np.array([0.0, 1.0, 2.0, 3.0,  4.0,  5.0])
y = np.array([0.0, 0.8, 0.9, 0.1, -0.8, -1.0])
f = np.polyfit(x, y, 3) # polynomial 
print(np.poly1d(f)) #print the fitted function

         3          2
0.08704 x - 0.8135 x + 1.693 x - 0.03968

# Pandas

In [1]:
import pandas as pd 
pd.options.display.float_format = '{:,.2f}'.format # global pandas settings

In [32]:
# series 
# has data with labels

In [71]:
arr = array(['upendra','robert bosch','dsu','bangalore',26])
# labels or indexes 
labels = ['name','company','university','location','age']
ser1 = pd.Series(arr,labels)
ser1

name               upendra
company       robert bosch
university             dsu
location         bangalore
age                     26
dtype: object

In [72]:
# indexing 
ser1[['name','location','age']]

name          upendra
location    bangalore
age                26
dtype: object

In [27]:
# slicing
ser1['name':'age':2]

name          upendra
university        dsu
age                26
dtype: object

In [74]:
# indexing and slicing using iloc
ser1.iloc[0:5:2]

name          upendra
university        dsu
age                26
dtype: object

In [28]:
# conditional selection 
ser1[ser1.str.startswith('u')]

name    upendra
dtype: object

In [5]:
# selecting based on data type 
nba = pd.read_csv("data/nba.csv")
print(nba.dtypes,'\n')
print(nba.select_dtypes(include ='object'))

Name         object
Team         object
Number      float64
Position     object
Age         float64
Height       object
Weight      float64
College      object
Salary      float64
dtype: object

              Name            Team Position Height            College
0    Avery Bradley  Boston Celtics       PG    6-2              Texas
1      Jae Crowder  Boston Celtics       SF    6-6          Marquette
2     John Holland  Boston Celtics       SG    6-5  Boston University
3      R.J. Hunter  Boston Celtics       SG    6-5      Georgia State
4    Jonas Jerebko  Boston Celtics       PF   6-10                NaN
..             ...             ...      ...    ...                ...
453   Shelvin Mack       Utah Jazz       PG    6-3             Butler
454      Raul Neto       Utah Jazz       PG    6-1                NaN
455   Tibor Pleiss       Utah Jazz        C    7-3                NaN
456    Jeff Withey       Utah Jazz        C    7-0             Kansas
457            NaN             NaN      NaN    NaN                NaN

[458 rows x 5 columns]

In [29]:
# operations, broadcasting
my_dictionary = {'a' : 45., 'b' : -19.5, 'c' : 4444}
my_series = pd.Series(my_dictionary)
print(my_series + my_series,'\n')
print(my_series + 5)

a      90.00
b     -39.00
c   8,888.00
dtype: float64

a      50.00
b     -14.50
c   4,449.00
dtype: float64

In [20]:
# operation on series
pd.Series([1,5,6,8,9]) + pd.Series([2,6,7,9,10])

0     3
1    11
2    13
3    17
4    19
dtype: int64

In [35]:
# sort a series 
arr = array(['upendra','robert bosch','dsu','bangalore'])
# labels or indexes 
labels = ['name','company','university','location']
ser1 = pd.Series(arr,labels)
ser1.argsort().reset_index(drop = True)

0    3
1    2
2    1
3    0
dtype: int64

In [36]:
# dataframe 
# has indexes and columns

In [4]:
# data frame from 2d array 
array = array([[1, 1, 1], [2, 4, 8], [3, 9, 27], 
                  [4, 16, 64], [5, 25, 125], [6, 36, 216], 
                  [7, 49, 343]])  
# creating a list of index names
# for numerical indexes we can use arange 
index_values = ['1st', '2nd', '3rd',
                '4th', '5th', '6th', '7th'] 
# creating a list of column names
column_values = ['number', 'squares', 'cubes']
# creating the dataframe
df = pd.DataFrame(data = array, 
                  index = index_values, 
                  columns = column_values)
df

     number  squares  cubes
1st       1        1      1
2nd       2        4      8
3rd       3        9     27
4th       4       16     64
5th       5       25    125
6th       6       36    216
7th       7       49    343

In [5]:
# how many no of rows and columns 
print(len(df.index),len(df.columns), df.ndim, df.size, df.shape, df.axes)
df.dtypes

7 3 2 21 (7, 3) [Index(['1st', '2nd', '3rd', '4th', '5th', '6th', '7th'], dtype='object'), Index(['number', 'squares', 'cubes'], dtype='object')]

number     int64
squares    int64
cubes      int64
dtype: object

In [6]:
# reindex 
index_values = ['first', 'second', 'third',
                'fourth', 'fifth', 'sixth', 'seventh'] 
df.index = index_values
df

         number  squares  cubes
first         1        1      1
second        2        4      8
third         3        9     27
fourth        4       16     64
fifth         5       25    125
sixth         6       36    216
seventh       7       49    343

In [3]:
# creating dataframe from series
points = {'player1': pd.Series([15, 10, 20, 25], 
                               index=['game1', 'game2', 'game3', 'game4']),
         'player2': pd.Series([10, 15, 23, 27],
                             index=['game1', 'game2', 'game3', 'game4'])}
data = pd.DataFrame(points)

In [7]:
# indexing without loc and iloc 
data[0:3]["player2"]

game1    10
game2    15
game3    23
Name: player2, dtype: int64

In [28]:
# creating df with index and col names
dframe1 = pd.DataFrame(np.arange(8).reshape((2, 4)),
                 index=pd.Index(['LA', 'SF'], name='city'),
                 columns=pd.Index(['A', 'B', 'C','D'], name='letter'))
#Show
dframe1

letter  A  B  C  D
city
LA      0  1  2  3
SF      4  5  6  7

In [21]:
# to_dict and numpy
print(df.to_dict(),'\n')
print(df.to_numpy(),'\n')

{'number': {'first': 1, 'second': 2, 'third': 3, 'fourth': 4, 'fifth': 5, 'sixth': 6, 'seventh': 7}, 'squares': {'first': 1, 'second': 4, 'third': 9, 'fourth': 16, 'fifth': 25, 'sixth': 36, 'seventh': 49}, 'cubes': {'first': 1, 'second': 8, 'third': 27, 'fourth': 64, 'fifth': 125, 'sixth': 216, 'seventh': 343}}

[[  1   1   1]
 [  2   4   8]
 [  3   9  27]
 [  4  16  64]
 [  5  25 125]
 [  6  36 216]
 [  7  49 343]]

In [87]:
# setting index based on csv column 
nobels = pd.read_csv('data/nobels.csv', names=['year','discipline','nobelist'])
nobels_by_year = nobels.set_index('year')
print(nobels.head(),'\n')
print(nobels_by_year.head())

   year  discipline                      nobelist
0  1901   Chemistry  Jacobus Henricus van 't Hoff
1  1901  Literature               Sully Prudhomme
2  1901    Medicine        Emil Adolf von Behring
3  1901       Peace                Frédéric Passy
4  1901       Peace                  Henry Dunant

      discipline                      nobelist
year
1901   Chemistry  Jacobus Henricus van 't Hoff
1901  Literature               Sully Prudhomme
1901    Medicine        Emil Adolf von Behring
1901       Peace                Frédéric Passy
1901       Peace                  Henry Dunant

In [85]:
# sort the data frame based on the index
print(nobels.set_index('discipline').sort_index().head(),'\n')
# sort the data frame based on the col names
print(nobels.sort_index(axis = 1).head())

            year                      nobelist
discipline
Chemistry   1901  Jacobus Henricus van 't Hoff
Chemistry   1988                  Robert Huber
Chemistry   1932               Irving Langmuir
Chemistry   1988            Johann Deisenhofer
Chemistry   1988                Hartmut Michel

   discipline                      nobelist  year
0   Chemistry  Jacobus Henricus van 't Hoff  1901
1  Literature               Sully Prudhomme  1901
2    Medicine        Emil Adolf von Behring  1901
3       Peace                Frédéric Passy  1901
4       Peace                  Henry Dunant  1901

In [53]:
# creating dataframe from dict of lists 
data = {
    'name': ['upendra','harindra','lalitha','arjun','pops'],
    'age' : [26,33,30,3,62],
    'job' : ['it','teaching','house wife','play','bank retd']
    }
df = pd.DataFrame(data,index=['i','ii','iii','iv','v'])
df

         name  age         job
i     upendra   26          it
ii   harindra   33    teaching
iii   lalitha   30  house wife
iv      arjun    3        play
v        pops   62   bank retd

In [54]:
# index, values and columns  
print(df.index, '\n', df.values, '\n', df.columns)
# iterating through index and columns using range  
print(df.index[range(0,5,2)], df.columns[range(2)])

Index(['i', 'ii', 'iii', 'iv', 'v'], dtype='object')
 [['upendra' 26 'it']
 ['harindra' 33 'teaching']
 ['lalitha' 30 'house wife']
 ['arjun' 3 'play']
 ['pops' 62 'bank retd']]
 Index(['name', 'age', 'job'], dtype='object')
Index(['i', 'iii', 'v'], dtype='object') Index(['name', 'age'], dtype='object')

In [55]:
# broadcasting 
df['family'] = 'badarvada'

In [56]:
# pandas styling 
df.style.highlight_max()

In [57]:
# pandas custom styling 
def morethan20(val):
    if val > 20:
        return 'background-color:orange'
    return ''
df.style.applymap(morethan20,subset = ['age'])

In [58]:
# indexing(first column then row) 
print(df['name']['i'],'\n',df[['name','age']]['i':'iv'])

upendra
          name  age
i     upendra   26
ii   harindra   33
iii   lalitha   30
iv      arjun    3

In [59]:
# copy using indexing and selecting specified columns 
df_copy = df[['name','age','job','family']]
df_copy

         name  age         job     family
i     upendra   26          it  badarvada
ii   harindra   33    teaching  badarvada
iii   lalitha   30  house wife  badarvada
iv      arjun    3        play  badarvada
v        pops   62   bank retd  badarvada

In [60]:
# selection using rows and col names(first row then column)
print(df.loc['i'],'\n')
print(df.loc['i':'iv','name':'job'],'\n')
print(df.loc['i','name'],'\n')
print(df.loc[['i','iv'],['name','job']],'\n')
print(df.loc[:,['name','job']],'\n')
print(df.loc[['i','iv']])

name        upendra
age              26
job              it
family    badarvada
Name: i, dtype: object

         name  age         job
i     upendra   26          it
ii   harindra   33    teaching
iii   lalitha   30  house wife
iv      arjun    3        play

upendra

       name   job
i   upendra    it
iv    arjun  play

         name         job
i     upendra          it
ii   harindra    teaching
iii   lalitha  house wife
iv      arjun        play
v        pops   bank retd

       name  age   job     family
i   upendra   26    it  badarvada
iv    arjun    3  play  badarvada

In [63]:
# .at used to return only one value at specific row, col and is more faster than .loc to do this
print(df.at['i','name'])

upendra

In [219]:
# slicing on both rows and columns 
df.loc[::2,::2]

        name         job
i    upendra          it
iii  lalitha  house wife
v       pops   bank retd

In [220]:
# indexing on columns and selection on rows 
df[['name','job']][::2]

        name         job
i    upendra          it
iii  lalitha  house wife
v       pops   bank retd

In [221]:
# indexing using index/col index  
print(df.iloc[0,0],'\n') # you can use iat[0,0] for single row selection
print(df.iloc[1],'\n') # as series 
print(df.iloc[[1],:],'\n') # as df
print(df.iloc[[2,3],[1,3]])  
print(df.iloc[1:3,1:3])

upendra

name       harindra
age              33
job        teaching
family    badarvada
Name: ii, dtype: object

        name  age       job     family
ii  harindra   33  teaching  badarvada

     age     family
iii   30  badarvada
iv     3  badarvada
     age         job
ii    33    teaching
iii   30  house wife

In [222]:
# adding a column 
df['fav cricketer'] = ['dhoni','dhoni','virat','dhoni','virat']
df

         name  age         job     family fav cricketer
i     upendra   26          it  badarvada         dhoni
ii   harindra   33    teaching  badarvada         dhoni
iii   lalitha   30  house wife  badarvada         virat
iv      arjun    3        play  badarvada         dhoni
v        pops   62   bank retd  badarvada         virat

In [223]:
# adding a new column at a position
fav_ipl_team = ['csk','csk','rcb','csk','rcb']
df.insert(4,'fav_ipl_team',fav_ipl_team)
df

         name  age         job     family fav_ipl_team fav cricketer
i     upendra   26          it  badarvada          csk         dhoni
ii   harindra   33    teaching  badarvada          csk         dhoni
iii   lalitha   30  house wife  badarvada          rcb         virat
iv      arjun    3        play  badarvada          csk         dhoni
v        pops   62   bank retd  badarvada          rcb         virat

In [6]:
# adding multiple no of new column at a time 
df_multiple = pd.read_csv("data/nba.csv")
# First column ='New_Team', this column
# will append '_GO' at the end of each team name.
# Second column ='Revised_Salary' will increase 
# the salary of all employees by 10 % 
df_multiple = df_multiple.assign(New_team = lambda x: df_multiple['Team']+'_GO', 
          Revised_Salary = lambda x: df_multiple['Salary'] 
                             + df_multiple['Salary'] / 10)
df_multiple

,Name,Team,Number,Position,Age,Height,Weight,College,Salary,New_team,Revised_Salary
0,Avery Bradley,Boston Celtics,0.00,PG,25.00,6-2,180.00,Texas,"7,730,337.00",Boston Celtics_GO,"8,503,370.70"
1,Jae Crowder,Boston Celtics,99.00,SF,25.00,6-6,235.00,Marquette,"6,796,117.00",Boston Celtics_GO,"7,475,728.70"
2,John Holland,Boston Celtics,30.00,SG,27.00,6-5,205.00,Boston University,NaN,Boston Celtics_GO,NaN
3,R.J. Hunter,Boston Celtics,28.00,SG,22.00,6-5,185.00,Georgia State,"1,148,640.00",Boston Celtics_GO,"1,263,504.00"
4,Jonas Jerebko,Boston Celtics,8.00,PF,29.00,6-10,231.00,NaN,"5,000,000.00",Boston Celtics_GO,"5,500,000.00"
...,...,...,...,...,...,...,...,...,...,...,...
453,Shelvin Mack,Utah Jazz,8.00,PG,26.00,6-3,203.00,Butler,"2,433,333.00",Utah Jazz_GO,"2,676,666.30"
454,Raul Neto,Utah Jazz,25.00,PG,24.00,6-1,179.00,NaN,"900,000.00",Utah Jazz_GO,"990,000.00"
455,Tibor Pleiss,Utah Jazz,21.00,C,26.00,7-3,256.00,NaN,"2,900,000.00",Utah Jazz_GO,"3,190,000.00"
456,Jeff Withey,Utah Jazz,24.00,C,26.00,7-0,231.00,Kansas,"947,276.00",Utah Jazz_GO,"1,042,003.60"
457,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [226]:
# add a new row 
new_row = pd.Series(['vijju',27,'it','boddu','csk','dhoni'],index=df.columns)
df = df.append(new_row,ignore_index=True)
df

       name  age         job     family fav_ipl_team fav cricketer
0   upendra   26          it  badarvada          csk         dhoni
1  harindra   33    teaching  badarvada          csk         dhoni
2   lalitha   30  house wife  badarvada          rcb         virat
3     arjun    3        play  badarvada          csk         dhoni
4      pops   62   bank retd  badarvada          rcb         virat
5     vijju   27          it      boddu          csk         dhoni

In [64]:
# update dataframe if index or col matches
# Modify in place using non-NA values from another DataFrame aligning on indices.
df = pd.DataFrame({'A': [1, 2, 3],
                   'B': [400, 500, 600]})
new_df = pd.DataFrame({'B': [4, 5, 6],
                       'C': [7, 8, 9]})
df.update(new_df)
df

   A  B
0  1  4
1  2  5
2  3  6

In [140]:
# dropping rows and columns 
df.drop('fav cricketer',axis=1,inplace = True)
df.drop(['ii','iii','v'],axis=0,inplace=True)
df.rename(index={'i':'i','iv':'ii'},columns={'name':'NAME','age':'AGE','job':'JOB'})

       NAME  AGE   JOB     family fav_ipl_team
i   upendra   26    it  badarvada          csk
ii    arjun    3  play  badarvada          csk

In [141]:
# conditional selection 
# both integral and string & 
# resetting the index 
df[(df['age'] < 30) & (df['name'].str.startswith('a'))][['name','job']].reset_index(drop = True)

    name   job
0  arjun  play

In [83]:
# conditional selection with or operator using regex
df = pd.read_csv('data/rides.csv')
mask = df['plate'].str.match(r'[0-9A-Z]{3}', na=False)
df[mask]

      name  plate  distance
0    Gomez   1XZ2      3.70
3    Lurch  Q38X3     -3.20
4      NaN    03A     14.30
6  Pugsley  ZF003    153.14

In [142]:
# selection using string value  
df[df.name.str.contains('upen')]

      name  age job     family fav_ipl_team
i  upendra   26  it  badarvada          csk

In [144]:
df['name'] = df['name'].str.capitalize()
df

       name  age   job     family fav_ipl_team
i   Upendra   26    it  badarvada          csk
iv    Arjun    3  play  badarvada          csk

In [70]:
# selection using query
df = pd.read_csv('data/metrics.csv', parse_dates=['time'])
print(df.head(),'\n')
print(df.query('name == "cpu" & (value < 0 | value > 100)'),'\n')
df1 = pd.read_csv('data/advertising.csv')
avg_radio_rev = df1['Radio'].mean()
avg_tv_rev = df1['TV'].mean()
# using local variables
print(df1.query('TV > @avg_tv_rev & Radio < @avg_radio_rev').head())

                     time name          value
0 2021-07-13 14:36:52.380  mem 227,517,194.00
1 2021-07-13 14:36:52.380  cpu          31.57
2 2021-07-13 14:36:53.337  mem 227,519,176.00
3 2021-07-13 14:36:53.337  cpu         300.90
4 2021-07-13 14:36:54.294  mem 227,515,712.00

                     time name  value
3 2021-07-13 14:36:53.337  cpu 300.90
9 2021-07-13 14:36:56.208  cpu -32.14

       TV  Radio  Newspaper  Sales
9  199.80   2.60      21.20  15.60
21 237.40   5.10      23.50  17.50
23 228.30  16.90      26.20  20.50
25 262.90   3.50      19.50  17.00
27 240.10  16.70      22.90  20.90

In [44]:
# multi indexed columns & hierarchical indexing

In [89]:
dictionary = {'A' : {'a': [1,2,3,4,5,6],
                     'b': [6,7,8,9,1,9]},

              'B' : {'a': [2,3,4,5,6,8],
                     'b': [7,8,9,1,2,4]}}
# now reform the above nested dictionary using dict comprehension
sorted_dict = {(outerkey,innerkey):values for outerkey,innerdict in dictionary.items() 
               for innerkey,values in innerdict.items()}
dfs = pd.DataFrame(sorted_dict)
print(dfs)

   A     B
   a  b  a  b
0  1  6  2  7
1  2  7  3  8
2  3  8  4  9
3  4  9  5  1
4  5  1  6  2
5  6  9  8  4

In [93]:
# indexing from multi indexed data frame 
print(dfs.loc[('G1',1)])
print(dfs['A','a']['G1',1])

A  a    1
   b    6
B  a    2
   b    7
Name: (G1, 1), dtype: int64
1

In [211]:
# set multi index from csv col names 
nobels = pd.read_csv('data/nobels.csv', names=['year','discipline','nobelist'])
print(nobels.head(),'\n')
# stacks all the columns 
print(nobels.stack().head(),'\n') # use unstack to reverse it   
# converts normal df to multi indexed df
nobels_multi = nobels.set_index(['year','discipline'])
print(nobels_multi.head(),'\n')
# stack with multi index
stacked = pd.DataFrame(nobels_multi.stack())
print(stacked[0].head(),'\n') 
# using slicing and selection to access a value
print(nobels_multi.loc[(slice(1901,1910), 'Chemistry'), :]['nobelist'].values,'\n')
print(nobels_multi.loc[(slice(1901,1910), ['Chemistry','Physics']), :]['nobelist'].values)

   year  discipline                      nobelist
0  1901   Chemistry  Jacobus Henricus van 't Hoff
1  1901  Literature               Sully Prudhomme
2  1901    Medicine        Emil Adolf von Behring
3  1901       Peace                Frédéric Passy
4  1901       Peace                  Henry Dunant

0  year                                  1901
   discipline                       Chemistry
   nobelist      Jacobus Henricus van 't Hoff
1  year                                  1901
   discipline                      Literature
dtype: object

                                     nobelist
year discipline
1901 Chemistry   Jacobus Henricus van 't Hoff
     Literature               Sully Prudhomme
     Medicine          Emil Adolf von Behring
     Peace                     Frédéric Passy
     Peace                       Henry Dunant

year  discipline
1901  Chemistry   nobelist    Jacobus Henricus van 't Hoff
      Literature  nobelist                 Sully Prudhomme
      Medicine    nobelist          Emil Adolf von Behring
      Peace       nobelist                  Frédéric Passy
                  nobelist                    Henry Dunant
Name: 0, dtype: object

["Jacobus Henricus van 't Hoff" 'Hermann Emil Fischer' 'Svante Arrhenius'
 'William Ramsay' 'Adolf von Baeyer' 'Henri Moissan' 'Eduard Buchner'
 'Ernest Rutherford' 'Wilhelm Ostwald' 'Otto Wallach']

["Jacobus Henricus van 't Hoff" 'Wilhelm Röntgen' 'Hermann Emil Fischer'
 'Hendrik Lorentz' 'Pieter Zeeman' 'Svante Arrhenius' 'Henri Becquerel'
 'Marie Curie' 'Pierre Curie' 'William Ramsay' 'Lord Rayleigh'
 'Adolf von Baeyer' 'Philipp Lenard' 'Henri Moissan' 'J. J. Thomson'
 'Eduard Buchner' 'Albert Abraham Michelson' 'Ernest Rutherford'
 'Gabriel Lippmann' 'Wilhelm Ostwald' 'Guglielmo Marconi'
 'Karl Ferdinand Braun' 'Otto Wallach' 'Johannes Diderik van der Waals']

In [24]:
# creating hierarchical indexed df directly using matrices 
dframe2 = pd.DataFrame(np.arange(16).reshape(4,4),
                    index=[['a','a','b','b'],[1,2,1,2]],
                    columns=[['NY','NY','LA','SF'],
                             ['cold','hot','hot','cold']])                                                   
dframe2.index.names = ['INDEX_1','INDEX_2']
dframe2.columns.names = ['Cities','Temp']
dframe2.swaplevel('Cities','Temp',axis=1)
print(dframe2)
# operations on different levels
dframe2.sum(level='Temp',axis=1)

Cities            NY      LA   SF
Temp            cold hot hot cold
INDEX_1 INDEX_2
a       1          0   1   2    3
        2          4   5   6    7
b       1          8   9  10   11
        2         12  13  14   15

Temp             cold  hot
INDEX_1 INDEX_2
a       1           3    3
        2          11   11
b       1          19   19
        2          27   27

In [47]:
# missing values(nan:- not a number)

In [4]:
data = pd.read_csv("data/employees.csv")
# get data frame with columns having nan
bool_series = pd.isnull(data["Team"])
print('does the dataframe has missing values',bool_series.any())
print(data[bool_series].head().reset_index(drop = True),'\n')
# get data frame with columns not having nan
bool_series1 = pd.notnull(data["Team"])
print(data[bool_series1].head())

does the dataframe has missing values True
  First Name  Gender Start Date Last Login Time  Salary  Bonus %  \
0     Thomas    Male  3/31/1996         6:53 AM   61933    4.170
1     Louise  Female  8/12/1980         9:01 AM   63241   15.132
2        NaN    Male  6/14/2012         4:19 PM  125792    5.042
3        NaN    Male  8/21/1998         2:27 PM  122340    6.417
4      James     NaN  1/26/2005        11:00 PM  128771    8.309

  Senior Management Team
0              True  NaN
1              True  NaN
2               NaN  NaN
3               NaN  NaN
4             False  NaN

  First Name  Gender Start Date Last Login Time  Salary  Bonus %  \
0    Douglas    Male   8/6/1993        12:42 PM   97308    6.945
2      Maria  Female  4/23/1993        11:17 AM  130590   11.858
3      Jerry    Male   3/4/2005         1:00 PM  138705    9.340
4      Larry    Male  1/24/1998         4:47 PM  101004    1.389
5     Dennis    Male  4/18/1987         1:35 AM  115163   10.125

  Senior Management             Team
0              True        Marketing
2             False          Finance
3              True          Finance
4              True  Client Services
5             False            Legal

In [12]:
dfn = pd.DataFrame({'A':[1,2,nan],
                  'B':[5,nan,nan],
                  'C':[1,2,3]})
dfn

     A    B  C
0 1.00 5.00  1
1 2.00  NaN  2
2  NaN  NaN  3

In [13]:
# count no of missing values
print(dfn.isna().sum(),'\n')
print(dfn.isna().values.any(),'\n') # check if there any missing values in df 
print(dfn['A'].isnull().sum())
# check for missing values 
print(dfn.isna(),'\n')
#get rows with no missing values
print(dfn[~dfn.isnull().any(axis = 1)])

A    1
B    2
C    0
dtype: int64

True

1
       A      B      C
0  False  False  False
1  False   True  False
2   True   True  False

     A    B  C
0 1.00 5.00  1

In [21]:
# drop rows 
print(dfn.dropna())
# drop columns
print('\n')
print(dfn.dropna(axis=1))
# drop rows based on certain columns
students = pd.read_excel("data/students.xlsx")
print('\n',students)
students = students.dropna(subset = ['State', 'Zip'], how = 'any')
print('\n',students)
# drop na with threshold 
dframe2 = pd.DataFrame([[1,2,3,np.nan],[2,np.nan,5,6],[np.nan,7,np.nan,9],[1,np.nan,np.nan,np.nan]])
print('\n',dframe2,'\n')
dframe2.dropna(thresh=3) # Require that many non-NA values.

     A    B  C
0 1.00 5.00  1


   C
0  1
1  2
2  3

       ID  FirstName    LastName                Major              Minor   Age  \
0   1869       Hana      Barton              Finance                NaN 22.00
1   2010     Alicia      Kanuri           Management                NaN 21.00
2   2075      Becca     Swanson            Marketing                NaN 22.00
3   2228     Halima       Aminu   Business Analytics                NaN 20.00
4   2442      Holly    Robinson              Finance                NaN 20.00
5   2858      Carla     Harding          Accountancy                NaN   nan
6   3459       Alex     Swanson          Accountancy                NaN   nan
7   3585     Aminah       Zalim            Marketing                NaN 20.00
8   5170        Gus  Cunningham              Finance         Innovation 21.00
9   5317     Rafael       Solis   Business Analytics               ACMS   nan
10  5336      Homer       White              Finance                NaN   nan
11  5495       Lara       Woods          Accountancy                NaN   nan
12  6453       Otis     Johnson           Management  Political Science 19.00
13  6504  Chantelle       Woods  Business Technology                NaN 18.00
14  6768   Caroline       Marsh   Business Analytics               ACMS 22.00
15  7511      Laila     Carroll            Marketing         Innovation 20.00
16  7965      Rocco      Decola              Finance         Innovation 21.00
17  9232      Julie      Holmes  Business Technology         Innovation 18.00
18  9268     Albert      Palmer           Management        Real Estate 21.00
19  9941       Zoya       Doyle   Business Analytics                NaN   nan

    Gender             City State       Zip
0   Female              NaN   NaN       nan
1   Female  Berrien Springs   NaN       nan
2   Female          Chicago    IL 60,608.00
3   Female          Atlanta    GA 30,303.00
4   Female        Charlotte    NC 28,202.00
5   Female       Youngstown    OH 44,502.00
6      NaN          Granger    IN       nan
7   Female          Ashburn    VA 20,147.00
8     Male        Massillon    OH 44,646.00
9      NaN       South Bend    IN 46,601.00
10    Male         St. Paul    MN 55,101.00
11     NaN           Dallas    TX 75,201.00
12    Male        Anchorage    AK 99,501.00
13  Female          Chicago   NaN 60,608.00
14  Female            Niles    MI       nan
15  Female         New York    NY 10,001.00
16    Male          Oakland    CA 94,603.00
17  Female          Webster    NY 14,580.00
18    Male          Detroit    MI 48,201.00
19  Female          Chicago    IL 60,608.00

       ID FirstName    LastName                Major              Minor   Age  \
2   2075     Becca     Swanson            Marketing                NaN 22.00
3   2228    Halima       Aminu   Business Analytics                NaN 20.00
4   2442     Holly    Robinson              Finance                NaN 20.00
5   2858     Carla     Harding          Accountancy                NaN   nan
7   3585    Aminah       Zalim            Marketing                NaN 20.00
8   5170       Gus  Cunningham              Finance         Innovation 21.00
9   5317    Rafael       Solis   Business Analytics               ACMS   nan
10  5336     Homer       White              Finance                NaN   nan
11  5495      Lara       Woods          Accountancy                NaN   nan
12  6453      Otis     Johnson           Management  Political Science 19.00
15  7511     Laila     Carroll            Marketing         Innovation 20.00
16  7965     Rocco      Decola              Finance         Innovation 21.00
17  9232     Julie      Holmes  Business Technology         Innovation 18.00
18  9268    Albert      Palmer           Management        Real Estate 21.00
19  9941      Zoya       Doyle   Business Analytics                NaN   nan

    Gender        City State       Zip
2   Female     Chicago    IL 60,608.00
3   Female     Atlanta    GA 30,303.00
4   Female   Charlotte    NC 28,202.00
5   Female  Youngstown    OH 44,502.00
7   Female     Ashburn    VA 20,147.00
8     Male   Massillon    OH 44,646.00
9      NaN  South Bend    IN 46,601.00
10    Male    St. Paul    MN 55,101.00
11     NaN      Dallas    TX 75,201.00
12    Male   Anchorage    AK 99,501.00
15  Female    New York    NY 10,001.00
16    Male     Oakland    CA 94,603.00
17  Female     Webster    NY 14,580.00
18    Male     Detroit    MI 48,201.00
19  Female     Chicago    IL 60,608.00

      0    1    2    3
0 1.00 2.00 3.00  nan
1 2.00  nan 5.00 6.00
2  nan 7.00  nan 9.00
3 1.00  nan  nan  nan

     0    1    2    3
0 1.00 2.00 3.00  nan
1 2.00  nan 5.00 6.00

In [ ]:
# linear interpolation
"""
Interpolation is a technique in Python used to estimate unknown data points between two known data points. 
Interpolation is mostly used to impute missing values in the dataframe or series while preprocessing data.
Linear interpolation is an imputation technique that assumes a linear relationship between data points and utilises 
non-missing values from adjacent data points to compute a value for a missing data point.
"""

In [86]:
dfn_copy = dfn.copy()
dfn_copy

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [87]:
# missing values to be filled by either of the two methods 
print(dfn.fillna(dfn.iloc[:,2].mean()),'\n')
# fill missing values in a column with a specific value
print(dfn.fillna({'B':100}),'\n')
students = students.fillna({'Gender':'Female'})
students = students.fillna({'Age':students['Age'].median()})
print(students,'\n')
# impute missing values in linear forward direction
print(dfn_copy.fillna(method='ffill'),'\n')
dfn_copy.interpolate(inplace=True)
print(dfn_copy,'\n')

     A    B  C
0  1.0  5.0  1
1  2.0  2.0  2
2  2.0  2.0  3

     A      B  C
0  1.0    5.0  1
1  2.0  100.0  2
2  NaN  100.0  3

      ID FirstName    LastName                Major              Minor   Age  \
2   2075     Becca     Swanson            Marketing                NaN  22.0
3   2228    Halima       Aminu   Business Analytics                NaN  20.0
4   2442     Holly    Robinson              Finance                NaN  20.0
5   2858     Carla     Harding          Accountancy                NaN  20.0
7   3585    Aminah       Zalim            Marketing                NaN  20.0
8   5170       Gus  Cunningham              Finance         Innovation  21.0
9   5317    Rafael       Solis   Business Analytics               ACMS  20.0
10  5336     Homer       White              Finance                NaN  20.0
11  5495      Lara       Woods          Accountancy                NaN  20.0
12  6453      Otis     Johnson           Management  Political Science  19.0
15  7511     Laila     Carroll            Marketing         Innovation  20.0
16  7965     Rocco      Decola              Finance         Innovation  21.0
17  9232     Julie      Holmes  Business Technology         Innovation  18.0
18  9268    Albert      Palmer           Management        Real Estate  21.0
19  9941      Zoya       Doyle   Business Analytics                NaN  20.0

    Gender        City State      Zip
2   Female     Chicago    IL  60608.0
3   Female     Atlanta    GA  30303.0
4   Female   Charlotte    NC  28202.0
5   Female  Youngstown    OH  44502.0
7   Female     Ashburn    VA  20147.0
8     Male   Massillon    OH  44646.0
9   Female  South Bend    IN  46601.0
10    Male    St. Paul    MN  55101.0
11  Female      Dallas    TX  75201.0
12    Male   Anchorage    AK  99501.0
15  Female    New York    NY  10001.0
16    Male     Oakland    CA  94603.0
17  Female     Webster    NY  14580.0
18    Male     Detroit    MI  48201.0
19  Female     Chicago    IL  60608.0

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  2.0  5.0  3

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  2.0  5.0  3

In [35]:
# finding outliers here in this scenario outlier is < -3 and > 3 
dframe = pd.DataFrame(np.random.randn(1000,4))
dframe[(np.abs(dframe)>3).any(1)]

        0     1     2     3
86  -3.27 -0.72 -0.73 -0.77
159  0.25  0.06  3.00  1.17
205  0.67 -1.63  0.81 -3.23
277 -0.04 -3.03 -0.17  0.08
351 -1.09  0.59 -3.06  1.88
445  2.23  1.39  0.13 -4.05
463  0.29 -0.02  3.07 -1.65
632  3.16 -1.10 -1.61 -0.80
719 -3.29 -0.06  0.60  0.20
723 -0.62  3.69 -0.06  1.01
764  0.13  1.49  0.22  3.11

In [43]:
# quantile
df = pd.DataFrame({"A":[1, 5, 3, 4, 2],
                   "B":[3, 2, 4, 3, 4],
                   "C":[2, 2, 7, 3, 4],
                   "D":[4, 3, 6, 12, 7]})
  
# using quantile() function to
# find the quantiles over the index axis
df.quantile([.95,.99], axis = 0)

        A    B    C     D
0.95 4.80 4.00 6.40 11.00
0.99 4.96 4.00 6.88 11.80

In [4]:
# sum of df row wise/ col wise
# similarly min, max, cumsum
df = pd.read_csv("data/nba.csv")
print(df.sum(axis = 0, skipna = True),'\n') # col
df.sum(axis = 1, skipna = True).head(5) # row

Number           8,079.00
Age             12,311.00
Weight         101,236.00
Salary   2,159,837,111.00
dtype: float64

0   7,730,542.00
1   6,796,476.00
2         262.00
3   1,148,875.00
4   5,000,268.00
dtype: float64

In [51]:
# group by

In [5]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [6]:
dfg = pd.DataFrame(data)
dfg

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [7]:
group = dfg.groupby('Company') # if you want index to be reset you can use as_index = False

In [8]:
# get respective group
group.get_group('GOOG').head()

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120

In [10]:
# aggregate operations 
print('min','\n\n',group.min(),'\n')
print('max','\n\n',group.max(),'\n')
print('count','\n\n',group.count(),'\n') # returns a df
print('size','\n\n',group.size(),'\n')# returns a series 
print('mean','\n\n',group.mean(),'\n')
print('std','\n\n',group.std(),'\n')
print('25% - 75% quantile','\n\n',group['Sales'].quantile([0.25,0.75]),'\n')
print('describe','\n\n',group.describe().T,'\n') # you can get stats based on dt also with include attr
# convert multi indexed df to normal df(pivot table)
print('describe','\n\n',group.describe().unstack(),'\n') 
print('sum','\n\n',group['Sales'].sum()) # sum is applicable in series only

min

           Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

max

           Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

count

          Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

size

 Company
FB      2
GOOG    2
MSFT    2
dtype: int64

mean

          Sales
Company
FB      296.50
GOOG    160.00
MSFT    232.00

std

          Sales
Company
FB       75.66
GOOG     56.57
MSFT    152.74

25% - 75% quantile

 Company
FB       0.25   269.75
         0.75   323.25
GOOG     0.25   140.00
         0.75   180.00
MSFT     0.25   178.00
         0.75   286.00
Name: Sales, dtype: float64

describe

 Company         FB   GOOG   MSFT
Sales count   2.00   2.00   2.00
      mean  296.50 160.00 232.00
      std    75.66  56.57 152.74
      min   243.00 120.00 124.00
      25%   269.75 140.00 178.00
      50%   296.50 160.00 232.00
      75%   323.25 180.00 286.00
      max   350.00 200.00 340.00

describe

               Company
Sales  count  FB          2.00
              GOOG        2.00
              MSFT        2.00
       mean   FB        296.50
              GOOG      160.00
              MSFT      232.00
       std    FB         75.66
              GOOG       56.57
              MSFT      152.74
       min    FB        243.00
              GOOG      120.00
              MSFT      124.00
       25%    FB        269.75
              GOOG      140.00
              MSFT      178.00
       50%    FB        296.50
              GOOG      160.00
              MSFT      232.00
       75%    FB        323.25
              GOOG      180.00
              MSFT      286.00
       max    FB        350.00
              GOOG      200.00
              MSFT      340.00
dtype: float64

sum

 Company
FB      593
GOOG    320
MSFT    464
Name: Sales, dtype: int64

In [39]:
# multi key groupby
dframe = pd.DataFrame({'k1':['X','X','Y','Y','Z'],
                    'k2':['alpha','beta','alpha','beta','alpha'],
                    'dataset1':np.random.randn(5),
                    'dataset2':np.random.randn(5)})
dataset2_group = dframe.groupby(['k1','k2'])[['dataset2']]
dataset2_group.mean()

          dataset2
k1 k2
X  alpha     -0.02
   beta      -1.67
Y  alpha      1.38
   beta      -1.29
Z  alpha     -0.20

In [48]:
# groupby on dict and series 
animals = pd.DataFrame(np.arange(16).reshape(4, 4),
                   columns=['W', 'X', 'Y', 'Z'],
                   index=['Dog', 'Cat', 'Bird', 'Mouse'])
#Now lets add some NAN values
animals.loc[['Cat','Bird'],['W','Y']] = np.nan 
print(animals,'\n')

# Now let's say I had a dictionary with ebhavior values in it
behavior_map = {'W': 'good', 'X': 'bad', 'Y': 'good','Z': 'bad'}
behav_series = pd.Series(behavior_map)
print(animals.groupby(behav_series, axis=1).count(),'\n')
print(animals.groupby(behav_series, axis=1).sum(),'\n')
print(animals.groupby(len).sum()) # groupby length of names/indices

          W   X     Y   Z
Dog    0.00   1  2.00   3
Cat     nan   5   nan   7
Bird    nan   9   nan  11
Mouse 12.00  13 14.00  15

       bad  good
Dog      2     2
Cat      2     0
Bird     2     0
Mouse    2     2

        bad  good
Dog    4.00  2.00
Cat   12.00  0.00
Bird  20.00  0.00
Mouse 28.00 26.00

      W   X     Y   Z
3  0.00   6  2.00  10
4  0.00   9  0.00  11
5 12.00  13 14.00  15

In [36]:
# groupby with is null filter(true/false)
data = pd.read_csv("data/employees.csv")
data.groupby(data['Team'].isnull()).mean()

             Salary    Bonus %
Team
False  90657.644723  10.199609
True   90763.139535  10.384395

In [56]:
# operations over grouped data :- aggregation, transform, filter

In [46]:
# agg:- multiple functions at a time 
ipl_data = {'Team': ['Riders', 'Riders', 'Devils', 'Devils', 'Kings',
   'kings', 'Kings', 'Kings', 'Riders', 'Royals', 'Royals', 'Riders'],
   'Rank': [1, 2, 2, 3, 3,4 ,1 ,1,2 , 4,1,2],
   'Year': [2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
   'Points':[876,789,863,673,741,812,756,788,694,701,804,690]}
df = pd.DataFrame(ipl_data)
grouped = df.groupby('Team')
print(grouped['Points'].agg([sum, mean, std]))
# transform:- custom fn
print('\n',grouped.transform(lambda x: (x - x.mean()) / x.std()*10))
# filter:- condition 
# repeats more than equal to 3 times here team 
print('\n',grouped.filter(lambda x: len(x) >= 3))
# teams with average points > 500
print('\n',grouped.filter(lambda x: x['Points'].mean() > 500))
# agg:- each function for each column 
print('\n',grouped.agg({'Rank' : ['sum'], 'Points' : ['min', 'max']}))

         sum   mean    std
Team
Devils  1536 768.00 134.35
Kings   2285 761.67  24.01
Riders  3049 762.25  88.57
Royals  1505 752.50  72.83
kings    812 812.00    nan

      Rank   Year  Points
0  -15.00 -11.62   12.84
1    5.00  -3.87    3.02
2   -7.07  -7.07    7.07
3    7.07   7.07   -7.07
4   11.55 -10.91   -8.61
5     nan    nan     nan
6   -5.77   2.18   -2.36
7   -5.77   8.73   10.97
8    5.00   3.87   -7.71
9    7.07  -7.07   -7.07
10  -7.07   7.07    7.07
11   5.00  11.62   -8.16

       Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
4    Kings     3  2014     741
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
11  Riders     2  2017     690

       Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
2   Devils     2  2014     863
3   Devils     3  2015     673
4    Kings     3  2014     741
5    kings     4  2015     812
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
9   Royals     4  2014     701
10  Royals     1  2015     804
11  Riders     2  2017     690

        Rank Points
        sum    min  max
Team
Devils    5    673  863
Kings     5    741  788
Riders    7    690  876
Royals    5    701  804
kings     4    812  812

In [40]:
# sum on data frame columns 
df = pd.DataFrame({'team': ['A', 'A', 'A', 'B', 'B', 'C'],
                   'conference': ['East', 'East', 'East', 'West', 'West', 'East'],
                   'points_A': [11, 8, 10, 6, 6, 5],
                   'points_B': [12, 8, 10, 7, 5, 6],
                   'rebounds': [7, 7, 6, 9, 12, 8]})
print(df.loc[(df['team'] == 'A') & (df['conference'] == 'East'), 'points_A'].sum()) # sum of values in a column
print((df['points_A'] == df['points_B']).sum()) # no of true values in the given condition

29
2

In [58]:
# concatenate same as union in sql and it takes iterable as an input  
# merge(same as sql join)

In [67]:
# concatenating columns 
DF_obj = pd.DataFrame(arange(36).reshape(6,6))
DF_obj_2 = pd.DataFrame(arange(15).reshape(5,3))
# you can even sort while concatenating & ignore indexes 
pd.concat([DF_obj, DF_obj_2], axis=1)

    0   1   2   3   4   5     0     1     2
0   0   1   2   3   4   5   0.0   1.0   2.0
1   6   7   8   9  10  11   3.0   4.0   5.0
2  12  13  14  15  16  17   6.0   7.0   8.0
3  18  19  20  21  22  23   9.0  10.0  11.0
4  24  25  26  27  28  29  12.0  13.0  14.0
5  30  31  32  33  34  35   NaN   NaN   NaN

In [59]:
# concatenating rows 
# we can ignore_index if index not directly specified 
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7]) 
pd.concat([df1,df2])

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [68]:
# join columns of different indexes 
data1 = {'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'], 
        'Age':[27, 24, 22, 32]} 
    
# Define a dictionary containing employee data 
data2 = {'Address':['Allahabad', 'Kannuaj', 'Allahabad', 'Kannuaj'], 
        'Qualification':['MCA', 'Phd', 'Bcom', 'B.hons']} 
  
# Convert the dictionary into DataFrame  
df = pd.DataFrame(data1,index=['K0', 'K1', 'K2', 'K3'])
  
# Convert the dictionary into DataFrame  
df1 = pd.DataFrame(data2, index=['K0', 'K2', 'K3', 'K4'])
df.join(df1)

      Name  Age    Address Qualification
K0     Jai   27  Allahabad           MCA
K1  Princi   24        NaN           NaN
K2  Gaurav   22    Kannuaj           Phd
K3    Anuj   32  Allahabad          Bcom

In [69]:
# join columns of a simple and multi index df
data1 = {'Name':['Jai', 'Princi', 'Gaurav'], 
        'Age':[27, 24, 22]} 
# Define a dictionary containing employee data 
data2 = {'Address':['Allahabad', 'Kannuaj', 'Allahabad', 'Kanpur'], 
        'Qualification':['MCA', 'Phd', 'Bcom', 'B.hons']} 
# Convert the dictionary into DataFrame  
df = pd.DataFrame(data1, index=pd.Index(['K0', 'K1', 'K2'], name='key'))
 
index = pd.MultiIndex.from_tuples([('K0', 'Y0'), ('K1', 'Y1'),
                                   ('K2', 'Y2'), ('K2', 'Y3')],
                                   names=['key', 'Y'])
# Convert the dictionary into DataFrame  
df1 = pd.DataFrame(data2, index= index)
result = df.join(df1, how='inner')
result

          Name  Age    Address Qualification
key Y
K0  Y0     Jai   27  Allahabad           MCA
K1  Y1  Princi   24    Kannuaj           Phd
K2  Y2  Gaurav   22  Allahabad          Bcom
    Y3  Gaurav   22     Kanpur        B.hons

In [64]:
# concat rows into a multi index
data1 = {'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'], 
        'Age':[27, 24, 22, 32], 
        'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj'], 
        'Qualification':['Msc', 'MA', 'MCA', 'Phd']} 
# Define a dictionary containing employee data 
data2 = {'Name':['Abhi', 'Ayushi', 'Dhiraj', 'Hitesh'], 
        'Age':[17, 14, 12, 52], 
        'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj'], 
        'Qualification':['Btech', 'B.A', 'Bcom', 'B.hons']} 
# Convert the dictionary into DataFrame  
df = pd.DataFrame(data1,index=[0, 1, 2, 3])
# Convert the dictionary into DataFrame  
df1 = pd.DataFrame(data2, index=[4, 5, 6, 7])
res = pd.concat([df, df1], keys=['x', 'y'])
res

       Name  Age    Address Qualification
x 0     Jai   27     Nagpur           Msc
  1  Princi   24     Kanpur            MA
  2  Gaurav   22  Allahabad           MCA
  3    Anuj   32    Kannuaj           Phd
y 4    Abhi   17     Nagpur         Btech
  5  Ayushi   14     Kanpur           B.A
  6  Dhiraj   12  Allahabad          Bcom
  7  Hitesh   52    Kannuaj        B.hons

In [65]:
# concat df and a series 
data1 = {'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'], 
        'Age':[27, 24, 22, 32], 
        'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj'], 
        'Qualification':['Msc', 'MA', 'MCA', 'Phd']} 
# Convert the dictionary into DataFrame  
df = pd.DataFrame(data1,index=[0, 1, 2, 3])
# creating a series
s1 = pd.Series([1000, 2000, 3000, 4000], name='Salary')
res = pd.concat([df, s1], axis=1)
res

     Name  Age    Address Qualification  Salary
0     Jai   27     Nagpur           Msc    1000
1  Princi   24     Kanpur            MA    2000
2  Gaurav   22  Allahabad           MCA    3000
3    Anuj   32    Kannuaj           Phd    4000

In [62]:
# merge: inner, fully outer, left outer, right outer 
df_customer = pd.DataFrame({
    'id': [1, 2, 3, 4],
    'name': ['Tom', 'Jenny', 'James', 'Dan'],
})
df_info = pd.DataFrame({
    'id': [2, 3, 4, 5],
    'age': [31, 20, 40, 70],
    'sex': ['F', 'M', 'M', 'F']
})
print(pd.merge(df_customer, df_info, on='id'),'\n')
print(pd.merge(df_customer, df_info, how='left', on='id'),'\n')
print(pd.merge(df_customer, df_info, how='right', on='id'),'\n')
print(pd.merge(df_customer, df_info, how='outer', on='id'))

   id   name  age sex
0   2  Jenny   31   F
1   3  James   20   M
2   4    Dan   40   M

   id   name   age  sex
0   1    Tom   nan  NaN
1   2  Jenny 31.00    F
2   3  James 20.00    M
3   4    Dan 40.00    M

   id   name  age sex
0   2  Jenny   31   F
1   3  James   20   M
2   4    Dan   40   M
3   5    NaN   70   F

   id   name   age  sex
0   1    Tom   nan  NaN
1   2  Jenny 31.00    F
2   3  James 20.00    M
3   4    Dan 40.00    M
4   5    NaN 70.00    F

In [ ]:
# merge on multiple keys
data1 = {'key': ['K0', 'K1', 'K2', 'K3'],
         'key1': ['K0', 'K1', 'K0', 'K1'],
         'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'], 
        'Age':[27, 24, 22, 32],} 
# Define a dictionary containing employee data 
data2 = {'key': ['K0', 'K1', 'K2', 'K3'],
         'key1': ['K0', 'K0', 'K0', 'K0'],
         'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj'], 
        'Qualification':['Btech', 'B.A', 'Bcom', 'B.hons']} 
# Convert the dictionary into DataFrame  
df = pd.DataFrame(data1)
# Convert the dictionary into DataFrame  
df1 = pd.DataFrame(data2) 
print(df, "\n\n", df1) 
print(pd.merge(df, df1, on=['key', 'key1']),'\n')
print(pd.merge(df, df1, how='left', on=['key', 'key1']),'\n')
print(pd.merge(df, df1, how='right', on=['key', 'key1']),'\n')
print(pd.merge(df, df1, how='outer', on=['key', 'key1']),'\n')

In [57]:
#left join with comparison conditional selection
df = pd.read_csv('data/heights.csv')
max_heights = pd.DataFrame([[1, 32],], columns=['grade', 'max_height'])
df = pd.merge(df, max_heights, how='left', on = 'grade')
print(df[df['height'] > df['max_height']])

   name  grade  height  max_height
1  Beth      1   74.90       32.00

In [26]:
# combine first 
# combine using first df values, unless theres a NAN, then put the second df values

dframe_odds = pd.DataFrame({'X': [1., np.nan, 3., np.nan],
                     'Y': [np.nan, 5., np.nan, 7.],
                     'Z': [np.nan, 9., np.nan, 11.]})
dframe_evens = pd.DataFrame({'X': [2., 4., np.nan, 6., 8.],
                     'Y': [np.nan, 10., 12., 14., 16.]})
dframe_odds.combine_first(dframe_evens)

     X     Y     Z
0 1.00   nan   nan
1 4.00  5.00  9.00
2 3.00 12.00   nan
3 6.00  7.00 11.00
4 8.00 16.00   nan

In [15]:
# operations 
dfo = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})

In [16]:
# unique and count
print('unique values')
print(dfo['col2'].unique())
print('no of unique values')
print(dfo['col2'].nunique())
print('value counts')
print(dfo['col2'].value_counts()) 
print('normalized value counts')
print(dfo['col2'].value_counts(normalize = True)) # we can even normalize it to val b/w 0 to 1
print('sorting')
print(dfo.sort_values(by='col2'))

unique values
[444 555 666]
no of unique values
3
value counts
444    2
555    1
666    1
Name: col2, dtype: int64
normalized value counts
444   0.50
555   0.25
666   0.25
Name: col2, dtype: float64
sorting
   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

In [17]:
# arith operations on data frame(div, multiply, add, subtract)
df = pd.DataFrame({"A":[5, 3, None, 4],
                   "B":[None, 2, 4, 3],
                   "C":[4, 3, 8, 5],
                   "D":[5, 4, 2, None]})
print(df.div(2, fill_value = 50),'\n') # fill na by a value 
print((df.C / 5.7).round(2)) # broadcasting(both div and round)
# div of a df by series(by one of df's col)
df = pd.DataFrame({"A":[5, 3, 6, 4],
                   "B":[11, 2, 4, 3],
                   "C":[4, 3, 8, 5],
                   "D":[5, 4, 2, 8]}) 
print('\n',df.div(df['A'], axis = 0),'\n')
print(df['A'].multiply(df['B']),'\n') # mul of two col's
print(df['A'] - df['B'],'\n') # subtract two col's
print(df['A'].astype(str) + '_' + df['B'].astype(str),'\n') # add two col's
print(df.diff(),'\n') # subtract row wise
print(df.diff().max()) # get max of above subtraction
print('\n',df.diff(axis = 1, periods = 1)) # subtract col wise

      A     B    C     D
0  2.50 25.00 2.00  2.50
1  1.50  1.00 1.50  2.00
2 25.00  2.00 4.00  1.00
3  2.00  1.50 2.50 25.00

0   0.70
1   0.53
2   1.40
3   0.88
Name: C, dtype: float64

      A    B    C    D
0 1.00 2.20 0.80 1.00
1 1.00 0.67 1.00 1.33
2 1.00 0.67 1.33 0.33
3 1.00 0.75 1.25 2.00

0    55
1     6
2    24
3    12
dtype: int64

0   -6
1    1
2    2
3    1
dtype: int64

0    5_11
1     3_2
2     6_4
3     4_3
dtype: object

      A     B     C     D
0   nan   nan   nan   nan
1 -2.00 -9.00 -1.00 -1.00
2  3.00  2.00  5.00 -2.00
3 -2.00 -1.00 -3.00  6.00

A   3.00
B   2.00
C   5.00
D   6.00
dtype: float64

     A     B     C     D
0 nan  6.00 -7.00  1.00
1 nan -1.00  1.00  1.00
2 nan -2.00  4.00 -6.00
3 nan -1.00  2.00  3.00

In [13]:
# add two df's and fill na values
dframe1 = pd.DataFrame(np.arange(4).reshape(2,2),columns=list('AB'),index=['NYC','LA'])
dframe2 = pd.DataFrame(np.arange(9).reshape(3,3),columns=list('ADC'),index=['NYC','SF','LA'])
dframe1.add(dframe2,fill_value=0)

       A    B    C    D
LA  8.00 3.00 8.00 7.00
NYC 0.00 1.00 2.00 1.00
SF  3.00  nan 5.00 4.00

In [4]:
# drop duplicates
data = pd.DataFrame({'k1': ['one', 'two', 'one', 'two'],
                     'k2': [1, 1, 2, 3]})

DF_obj= pd.DataFrame({'column 1':[1,1,2,2,3,3,3],
                   'column 2':['a', 'a','b', 'b', 'c', 'c', 'c'],
                   'column 3':['A', 'A', 'B', 'B', 'C', 'C', 'C']})

# find duplicate rows
print(DF_obj,'\n')
print(DF_obj.duplicated(),'\n')
# find if df has duplicates at all 
print(DF_obj.duplicated().values.any(),'\n')
# no of duplicate rows 
print(len(DF_obj[DF_obj.duplicated()]))
# drop duplictaes in entire df 
print(DF_obj.drop_duplicates(),'\n')
# drop duplicates in a particular column, you can give list of columns also as a subset for del dup
dfs = data.drop_duplicates('k1',keep='last').reset_index(drop = True)
dfs

   column 1 column 2 column 3
0         1        a        A
1         1        a        A
2         2        b        B
3         2        b        B
4         3        c        C
5         3        c        C
6         3        c        C

0    False
1     True
2    False
3     True
4    False
5     True
6     True
dtype: bool

True

4
   column 1 column 2 column 3
0         1        a        A
2         2        b        B
4         3        c        C

    k1  k2
0  one   2
1  two   3

In [18]:
# applying custom fns to columns 
print(dfo,'\n')
print(dfo['col1'].apply(lambda x:x**2),'\n')
print(dfo[['col1','col2']].apply(sum),'\n')
print(dfo['col3'].apply(len))
# apply custom fns to group
def second(values):
    """Return second highest value

    >>> second([1, 7, 9, 3, 5])
    7
    """
    top, second = -1, -1
    for value in values:
        if value > top:
            top, second = value, top
        elif value > second:
            second = value
    return second
group['Sales'].apply(second)

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

0     1
1     4
2     9
3    16
Name: col1, dtype: int64

col1      10
col2    2109
dtype: int64

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

Company
FB      243
GOOG    120
MSFT    124
Name: Sales, dtype: int64

In [104]:
# conditional selection using custom fn
df = pd.read_csv('data/orders.csv', parse_dates=['time'])
def is_valid_row(row):
    if row['time'] < pd.Timestamp('1900'):
        return False
    if pd.isnull(row['symbol']) or row['symbol'].strip() == '':
        return False
    if row['price'] <= 0:
        return False
    return True
ok_df = df[df.apply(is_valid_row, axis=1)] # axis 1 :- col 
num_bad = len(df) - len(ok_df)
percent_bad = num_bad/len(df) * 100
print(f'{percent_bad:.2f}% bad rows')
if num_bad > 0:
    bad_rows = df[~df.index.isin(ok_df.index)]
    print('bad rows:')
    print(bad_rows.reset_index(drop = True))

5.00% bad rows
bad rows:
                 time symbol  price side
0 2027-06-01 08:06:32    NaN 265.44  ask

In [151]:
# custom functions with arguments 
ser = pd.Series([11, 22, 33, 15, 18])
def between(x, low, high):
    return x >= low and x <= high
ser[ser.apply(between, args=(10,20))]

0    11
3    15
4    18
dtype: int64

In [181]:
# applying fns with ternary condition on df columns 
df = pd.DataFrame({"Region":['North','West','East','South','North','West','East','South'],
          "Team":['One','One','One','One','Two','Two','Two','Two'],
          "Squad":['A','B','C','D','E','F','G','H'],
          "Revenue":[7500,5500,2750,6400,2300,3750,1900,575],
            "Cost":[5200,5100,4400,5300,1250,1300,2100,50]})
df['Profit'] = df.apply(lambda x: 'Profit' if x['Revenue']>x['Cost'] else 'Loss',axis=1)
print(df,'\n')
# applying custom fn to whole data frame 
df = df.applymap(lambda x: len(str(x)))
df

  Region Team Squad  Revenue  Cost  Profit
0  North  One     A     7500  5200  Profit
1   West  One     B     5500  5100  Profit
2   East  One     C     2750  4400    Loss
3  South  One     D     6400  5300  Profit
4  North  Two     E     2300  1250  Profit
5   West  Two     F     3750  1300  Profit
6   East  Two     G     1900  2100    Loss
7  South  Two     H      575    50  Profit

   Region  Team  Squad  Revenue  Cost  Profit
0       5     3      1        4     4       6
1       4     3      1        4     4       6
2       4     3      1        4     4       4
3       5     3      1        4     4       6
4       5     3      1        4     4       6
5       4     3      1        4     4       6
6       4     3      1        4     4       4
7       5     3      1        3     2       6

In [65]:
# aggregation (applying many functions at a time)
dfo[['col1','col2']].aggregate([sum,mean])

      col1     col2
sum   10.0  2109.00
mean   2.5   527.25

In [107]:
# evaluate expressions 
df=pd.DataFrame({"A":[1,5,7,8],
                 "B":[5,8,4,3],
                 "C":[10,4,9,3]})
df.eval('D = A + B + C', inplace = True)
avg_cols = df.mean(1) # average of cols, 0->average of rows 
# using local variables
result2 = df.eval('A + @avg_cols')
df['E'] = result2
print(df)

   A  B   C   D     E
0  1  5  10  16   9.0
1  5  8   4  17  13.5
2  7  4   9  20  17.0
3  8  3   3  14  15.0

In [127]:
# conditional selection with eval
df = pd.read_csv('data/ride.csv')
mask = df.eval('name.isnull() | distance <= 0')
df = df[~mask]
df

        name  plate  distance
0      Gomez   1XZ2      3.70
1   Morticia    NaN      2.10
2     Fester             3.40
5  Wednesday      A      0.30
6    Pugsley  ZF003    153.14

In [30]:
# wide to long format 
df_wide = pd.DataFrame(
  {"student": ["Andy", "Bernie", "Cindy", "Deb"],
   "school":  ["Z", "Y", "Z", "Y"],
   "english": [10, 100, 1000, 10000],  # eng grades
   "math":    [20, 200, 2000, 20000],  # math grades
   "physics": [30, 300, 3000, 30000]   # physics grades
  }
)
print(df_wide,'\n')
df_wide.melt(id_vars=["student", "school"],
             var_name="cLaSs",  
             value_name="gRaDe")

  student school  english   math  physics
0    Andy      Z       10     20       30
1  Bernie      Y      100    200      300
2   Cindy      Z     1000   2000     3000
3     Deb      Y    10000  20000    30000

   student school    cLaSs  gRaDe
0     Andy      Z  english     10
1   Bernie      Y  english    100
2    Cindy      Z  english   1000
3      Deb      Y  english  10000
4     Andy      Z     math     20
5   Bernie      Y     math    200
6    Cindy      Z     math   2000
7      Deb      Y     math  20000
8     Andy      Z  physics     30
9   Bernie      Y  physics    300
10   Cindy      Z  physics   3000
11     Deb      Y  physics  30000

In [66]:
# correlation b/w two columns 
dfn[['A','B']].corr()

          A         B
A  1.000000 -0.970725
B -0.970725  1.000000

In [5]:
# corr b/w two data frames 
corr_df1 = pd.DataFrame({"A":[1, 5, 7, 8],
                    "B":[5, 8, 4, 3],
                    "C":[10, 4, 9, 3]})
  
# Creating the second dataframe 
corr_df2 = pd.DataFrame({"A":[5, 3, 6, 4],
                    "B":[11, 2, 4, 3], 
                    "C":[4, 3, 8, 5]})
  
# To find the correlation among the columns of df1 and df2 
print(corr_df1.corrwith(corr_df2),'\n')
# To find the correlation among the rows of df1 and df2 
print(corr_df1.corrwith(corr_df2,axis = 1))

A   -0.041703
B   -0.151186
C    0.395437
dtype: float64

0   -0.195254
1   -0.970725
2    0.993399
3    0.000000
dtype: float64

In [73]:
# randomly Return a random sample of items from an object.
pop = pd.read_csv('data/grades.csv')
print(pop,'\n')
pop1 = pop.sample(100,replace = True) #replace allows sampling of the same row more than once.
print(pop1,'\n')
print(pop1.grade.value_counts())

       grade
0   3.648651
1   5.959915
2   7.387370
3   4.047515
4   2.846912
..       ...
95  3.940691
96  9.120705
97  7.842357
98  3.920676
99  5.485459

[100 rows x 1 columns]

       grade
33  5.663904
1   5.959915
75  4.204147
87  7.712100
44  3.791128
..       ...
16  3.267280
29  6.229383
57  3.784574
72  4.413451
78  5.085034

[100 rows x 1 columns]

5.066896    3
8.419049    3
4.081780    3
6.053939    3
4.912927    3
           ..
5.959915    1
8.019990    1
7.993867    1
2.130382    1
8.467353    1
Name: grade, Length: 68, dtype: int64

In [68]:
# practice example's

In [70]:
# count no of values in each column w.r.t coditional selection 
ecom = pd.read_csv('data/Ecommerce Purchases')
ecom[(ecom['CC Provider']=='American Express') & (ecom['Purchase Price']>95)].count()[0]

39

In [71]:
# get 5 top most emails 
ecom['Email'].apply(lambda x: x.split('@')[1]).value_counts().head(5)

hotmail.com     1638
yahoo.com       1616
gmail.com       1605
smith.com         42
williams.com      37
Name: Email, dtype: int64

In [72]:
# excel writer

In [6]:
ipl_data = {'Team': ['Riders', 'Riders', 'Devils', 'Devils', 'Kings',
   'kings', 'Kings', 'Kings', 'Riders', 'Royals', 'Royals', 'Riders'],
   'Rank': [1, 2, 2, 3, 3,4 ,1 ,1,2 , 4,1,2],
   'Year': [2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
   'Points':[876,789,863,673,741,812,756,788,694,701,804,690]}
df = pd.DataFrame(ipl_data)
writer = pd.ExcelWriter('biodata.xlsx')
df.to_excel(writer, 'Sheet1',header=True,index=None)
writer.save()
df = pd.read_excel('biodata.xlsx', sheet_name='Sheet1')
df.head()

     Team  Rank  Year  Points
0  Riders     1  2014     876
1  Riders     2  2015     789
2  Devils     2  2014     863
3  Devils     3  2015     673
4   Kings     3  2014     741

In [75]:
# transforming data using mapping 
# works as a replace function 
# replace column name 
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                              'Pastrami', 'corned beef', 'Bacon',
                              'pastrami', 'honey ham', 'nova lox'],
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data
meat_to_animal = {
  'bacon': 'pig',
  'pulled pork': 'pig',
  'pastrami': 'cow',
  'corned beef': 'cow',
  'honey ham': 'pig',
  'nova lox': 'salmon'
}
data['food'] = data['food'].map(lambda x: meat_to_animal[x.lower()])
data.rename(columns={'food':'animal'},inplace=True)
data

   animal  ounces
0     pig     4.0
1     pig     3.0
2     pig    12.0
3     cow     6.0
4     cow     7.5
5     pig     8.0
6     cow     3.0
7     pig     5.0
8  salmon     6.0

In [112]:
# renaming with custom fn 
import re
df = pd.read_csv('data/donations.csv')
print(df,'\n')
def fix_col(col):
    """Fix column name
    >>> fix_col('1. First Name')
    'first_name'
    """
    return re.sub(r'\d+\.\s+', '', col).lower().replace(' ', '_')
df.rename(columns=fix_col, inplace=True)
df

  1. First Name 2. Last Name  3. Donation Amount
0           Amy         Wang                 200
1        Bender    Rodriguez                  12
2        Philip          Fry                  70

  first_name  last_name  donation_amount
0        Amy       Wang              200
1     Bender  Rodriguez               12
2     Philip        Fry               70

In [19]:
# replace data 
# it can replace a list also
df = pd.read_csv("data/nba.csv")
df['Team'].replace(to_replace ="Boston Celtics", 
                            value = "Omega Warrior", inplace = True)
print(df[df['Team'] == 'Omega Warrior'])

               Name           Team  Number Position   Age Height  Weight  \
0     Avery Bradley  Omega Warrior    0.00       PG 25.00    6-2  180.00
1       Jae Crowder  Omega Warrior   99.00       SF 25.00    6-6  235.00
2      John Holland  Omega Warrior   30.00       SG 27.00    6-5  205.00
3       R.J. Hunter  Omega Warrior   28.00       SG 22.00    6-5  185.00
4     Jonas Jerebko  Omega Warrior    8.00       PF 29.00   6-10  231.00
5      Amir Johnson  Omega Warrior   90.00       PF 29.00    6-9  240.00
6     Jordan Mickey  Omega Warrior   55.00       PF 21.00    6-8  235.00
7      Kelly Olynyk  Omega Warrior   41.00        C 25.00    7-0  238.00
8      Terry Rozier  Omega Warrior   12.00       PG 22.00    6-2  190.00
9      Marcus Smart  Omega Warrior   36.00       PG 22.00    6-4  220.00
10  Jared Sullinger  Omega Warrior    7.00        C 24.00    6-9  260.00
11    Isaiah Thomas  Omega Warrior    4.00       PG 27.00    5-9  185.00
12      Evan Turner  Omega Warrior   11.00       SG 27.00    6-7  220.00
13      James Young  Omega Warrior   13.00       SG 20.00    6-6  215.00
14     Tyler Zeller  Omega Warrior   44.00        C 26.00    7-0  253.00

              College        Salary
0               Texas  7,730,337.00
1           Marquette  6,796,117.00
2   Boston University           nan
3       Georgia State  1,148,640.00
4                 NaN  5,000,000.00
5                 NaN 12,000,000.00
6                 LSU  1,170,960.00
7             Gonzaga  2,165,160.00
8          Louisville  1,824,360.00
9      Oklahoma State  3,431,040.00
10         Ohio State  2,569,260.00
11         Washington  6,912,869.00
12         Ohio State  3,425,510.00
13           Kentucky  1,749,840.00
14     North Carolina  2,616,975.00

In [9]:
# converts each column specified into a row
data = {
  "Brand": ["Ford", "Ford", "Ford"],
  "Model": ["Sierra", "F-150", "Mustang"],
  "Typ" : ["2.0 GL", "Raptor", ["Mach-E", "Mach-1"]]
}
df = pd.DataFrame(data)
newdf = df.Typ.explode().to_frame('Typ')
newdf

      Typ
0  2.0 GL
1  Raptor
2  Mach-E
2  Mach-1

In [51]:
# split column and append them by shifting their pos after replacing the words
# esp used for url's
ga_page_data = pd.read_csv('data/ga_pages.csv', skiprows=6, nrows=376)
split_dom = ga_page_data.Page.str.rpartition("/")
split_dom[2].replace("", "miratrix.co.uk", inplace=True)
split_dom[2].replace("www.miratrix.co.uk", "miratrix.co.uk", inplace=True)
ga_page_data.Page = "https://" + split_dom[2] + split_dom[0] + "/"
ga_page_data.head()

,Page,Pageviews,Unique Pageviews,Avg. Time on Page,Entrances,Bounce Rate,% Exit,Page Value
0,https://miratrix.co.uk/,813,665,00:02:05,641,14.35%,55.97%,£0.00
1,https://miratrix.co.uk/,515,388,00:02:17,373,59.25%,56.89%,£0.00
2,https://miratrix.co.uk/get-in-touch/,336,163,00:01:06,23,10.53%,33.04%,£0.00
3,https://miratrix.co.uk/app-marketing-agency/,140,120,00:02:04,73,18.31%,57.86%,£0.00
4,https://miratrix.co.uk/app-store-optimization-...,136,105,00:01:30,22,14.29%,47.79%,£0.00

In [76]:
# time series

In [77]:
from datetime import datetime
dates = [datetime(2011, 1, 2), datetime(2011, 1, 5),
         datetime(2011, 1, 7), datetime(2011, 1, 8),
         datetime(2011, 1, 10), datetime(2011, 1, 12)]
ts = pd.Series(random.randn(6), index=dates)
ts

2011-01-02    0.282415
2011-01-05   -0.300013
2011-01-07    0.306791
2011-01-08   -0.342515
2011-01-10   -1.003663
2011-01-12   -0.193869
dtype: float64

In [145]:
longer_ts = pd.Series(random.randn(1000),
                      index=pd.date_range('1/1/2000', periods=1000))
longer_ts[:20:2]

2000-01-01   -1.36
2000-01-03   -0.75
2000-01-05   -0.63
2000-01-07    2.05
2000-01-09    0.88
2000-01-11    2.06
2000-01-13    0.29
2000-01-15    0.33
2000-01-17   -0.15
2000-01-19   -0.05
Freq: 2D, dtype: float64

In [79]:
# periods gives no of values and freq tells the difference between any two values
# w-wed means week wednesday 
dates = pd.date_range('1/1/2000', periods=100, freq='W-WED')
long_df = pd.DataFrame(random.randn(100, 4),
                       index=dates,
                       columns=['Colorado', 'Texas',
                                'New York', 'Ohio'])
long_df.head()

            Colorado     Texas  New York      Ohio
2000-01-05  0.343955  0.706824 -0.224731  0.007099
2000-01-12  0.568859 -0.814084  0.576943 -0.572930
2000-01-19 -0.110129 -0.355832 -0.480219  0.541110
2000-01-26 -0.953903 -1.419825 -1.886654  2.134744
2000-02-02 -0.011643  0.836294 -0.139921  0.076219

In [108]:
# convert to time stamp(pandas equivalent of python’s Datetime)
print(pd.Timestamp(1993,10,5,7,30,00))
print(pd.Timestamp.now()) # current date and time 
daterange = pd.period_range('1/1/2020', freq='30d', periods=4)
date_df = pd.DataFrame(data=daterange,columns=['sample date'])
date_df['sample date'] = date_df['sample date'].dt.to_timestamp()
date_df['sample date'].dt.day_name()

1993-10-05 07:30:00
2021-11-19 01:39:10.090366

0    Wednesday
1       Friday
2       Sunday
3      Tuesday
Name: sample date, dtype: object

In [154]:
#convert normal string column to date time column 
data = pd.read_csv("data/todatetime.csv")  
print(data.head())
# overwriting data after changing format
data["Date"]= pd.to_datetime(data["Date"])
data.head()

        Date      Time
0   8/6/1993  12:42 PM
1  3/31/1996   6:53 AM
2  4/23/1993  11:17 AM
3   3/4/2005   1:00 PM
4  1/24/1998   4:47 PM

        Date      Time
0 1993-08-06  12:42 PM
1 1996-03-31   6:53 AM
2 1993-04-23  11:17 AM
3 2005-03-04   1:00 PM
4 1998-01-24   4:47 PM

In [80]:
# time series index

In [155]:
import pytz
some_dates = array(['2016-03-15', '2017-05-24', '2018-08-09'], dtype='datetime64[D]')
idx = pd.DatetimeIndex(some_dates)
data = random.randn(3,2)
cols = ['A','B']
df = pd.DataFrame(data,idx,cols)
# set a specific time zone 
df.index = df.index.tz_localize(pytz.UTC).tz_convert(pytz.timezone('Europe/Berlin'))
print(df,'\n')
print(df.index)

                              A     B
2016-03-15 01:00:00+01:00 -0.43 -0.62
2017-05-24 02:00:00+02:00  0.70 -0.61
2018-08-09 02:00:00+02:00 -0.30 -1.12

DatetimeIndex(['2016-03-15 01:00:00+01:00', '2017-05-24 02:00:00+02:00',
               '2018-08-09 02:00:00+02:00'],
              dtype='datetime64[ns, Europe/Berlin]', freq=None)

In [160]:
# shifting time series index(like timedelta) 
df = pd.DataFrame({"Col1": [10, 20, 15, 30, 45],
                   "Col2": [13, 23, 18, 33, 48],
                   "Col3": [17, 27, 22, 37, 52]},
                  index=pd.date_range("2020-01-01", "2020-01-05"))
print(df.index + pd.Timedelta('3 d'))
print(df.shift(periods=3, freq="D"))
print(df.index, '\n', df.index.min())

DatetimeIndex(['2020-01-04', '2020-01-05', '2020-01-06', '2020-01-07',
               '2020-01-08'],
              dtype='datetime64[ns]', freq='D')
            Col1  Col2  Col3
2020-01-04    10    13    17
2020-01-05    20    23    27
2020-01-06    15    18    22
2020-01-07    30    33    37
2020-01-08    45    48    52
DatetimeIndex(['2020-01-01', '2020-01-02', '2020-01-03', '2020-01-04',
               '2020-01-05'],
              dtype='datetime64[ns]', freq='D')
 2020-01-01 00:00:00

In [43]:
# time delta index(which is 3 here clearly)
df.index = df.shift(periods=3, freq="D").index - df.index 
print(df)
print(df.index)

        Col1  Col2  Col3
3 days    10    13    17
3 days    20    23    27
3 days    15    18    22
3 days    30    33    37
3 days    45    48    52
TimedeltaIndex(['3 days', '3 days', '3 days', '3 days', '3 days'], dtype='timedelta64[ns]', freq=None)

In [102]:
# resampling (method of drawing repeated samples from the original data) based on time series data and creating bins 
d = {'price': [10, 11, 9, 13, 14, 18, 17, 19],
     'volume': [50, 60, 40, 100, 50, 100, 40, 50]}
df = pd.DataFrame(d)
df['week_starting'] = pd.date_range('01/01/2018',
                                    periods=8,
                                    freq='W')
print(df)
print(df.resample('M', on='week_starting').mean())#monthly

   price  volume week_starting
0     10      50    2018-01-07
1     11      60    2018-01-14
2      9      40    2018-01-21
3     13     100    2018-01-28
4     14      50    2018-02-04
5     18     100    2018-02-11
6     17      40    2018-02-18
7     19      50    2018-02-25
               price  volume
week_starting
2018-01-31     10.75    62.5
2018-02-28     17.00    60.0

In [ ]:
# rolling window 
# we take a window size of k at a time and perform some desired mathematical operation on it. A window of size k means
# k consecutive values at a time. In a very simple case all the ‘k’ values are equally weighted.

In [52]:
df = pd.read_csv("data/apple.csv", parse_dates =["date"], index_col ="date")
print(df.head())
print('\n',df.close.rolling(2).sum().head())
print('\n',df.close.rolling(2, center=True).mean().head()) # moving average
print('\n',df.close.rolling(2).std().head())
print('\n',df.close.rolling(2).mean().idxmax(),':',df.close.rolling(2).mean().max()) # moving avg max and its index

                     close         volume   open   high    low
date
2021-11-29 16:00:00 192.23     46,541,444 191.72 197.18 191.45
2018-11-13 00:00:00 192.23  46725710.0000 191.63 197.18 191.45
2018-11-12 00:00:00 194.17  50991030.0000 199.00 199.85 193.79
2018-11-09 00:00:00 204.47  34317760.0000 205.55 206.01 202.25
2018-11-08 00:00:00 208.49  25289270.0000 209.98 210.12 206.75

 date
2021-11-29 16:00:00      nan
2018-11-13 00:00:00   384.46
2018-11-12 00:00:00   386.40
2018-11-09 00:00:00   398.64
2018-11-08 00:00:00   412.96
Name: close, dtype: float64

 date
2021-11-29 16:00:00      nan
2018-11-13 00:00:00   192.23
2018-11-12 00:00:00   193.20
2018-11-09 00:00:00   199.32
2018-11-08 00:00:00   206.48
Name: close, dtype: float64

 date
2021-11-29 16:00:00    nan
2018-11-13 00:00:00   0.00
2018-11-12 00:00:00   1.37
2018-11-09 00:00:00   7.28
2018-11-08 00:00:00   2.84
Name: close, dtype: float64

 2018-10-02 00:00:00 : 230.67500000000007

In [45]:
# conditional selection using time series data 
from calendar import SATURDAY, SUNDAY
holidays_2016 = pd.to_datetime([
    '2016-01-01',  # new year
    '2016-01-18',  # MLK
    '2016-05-30',  # memorial
    '2016-07-04',  # independence
    '2016-09-05',  # labor
    '2016-11-11',  # veterans
    '2016-11-24',  # thanksgiving
    '2016-12-26',  # christmas
])

aust_df = pd.read_csv(
        'data/austin-bikes.csv',
        parse_dates=[['Checkout Date', 'Checkout Time']]
    )
aust_df.rename(columns = {'Checkout Date_Checkout Time':'DateTime'},inplace = True)
mask_2016 = aust_df['DateTime'].dt.year == 2016
holiday_mask = (
        (aust_df['DateTime'].dt.floor('D').isin(holidays_2016)) |
        (aust_df['DateTime'].dt.weekday.isin([SATURDAY, SUNDAY]))
    )
afternoon_mask = (aust_df['DateTime'].dt.hour >= 12) & (aust_df['DateTime'].dt.hour < 18)
aust_df[mask_2016 & holiday_mask & afternoon_mask].tail(10)

,DateTime,Trip ID,Membership Type,Bicycle ID,Checkout Kiosk ID,Checkout Kiosk,Return Kiosk ID,Return Kiosk,Trip Duration Minutes,Month,Year
4410,2016-11-13 16:09:46,12814168,Walk Up,872.0,"2,499.00",City Hall / Lavaca & 2nd,2498.0,Convention Center / 4th St. @ MetroRail,24,11.00,"2,016.00"
4411,2016-11-13 14:27:07,12812573,Walk Up,72.0,"2,503.00",South Congress & James,2497.0,Capitol Station / Congress & 11th,19,11.00,"2,016.00"
4429,2016-11-20 14:32:21,12904946,Walk Up,37.0,"2,549.00",Long Center @ South 1st & Riverside,2711.0,Barton Springs @ Kinney Ave,29,11.00,"2,016.00"
4438,2016-11-24 15:11:33,12958195,Walk Up,832.0,"3,377.00",MoPac Pedestrian Bridge @ Veterans Drive,3377.0,MoPac Pedestrian Bridge @ Veterans Drive,532,11.00,"2,016.00"
4439,2016-11-24 14:01:08,12956844,Walk Up,116.0,"2,707.00",Rainey St @ Cummings,2549.0,Long Center @ South 1st & Riverside,32,11.00,"2,016.00"
4443,2016-11-26 13:26:27,12980542,Walk Up,855.0,"2,502.00",Barton Springs & Riverside,2537.0,West & 6th St.,11,11.00,"2,016.00"
4444,2016-11-26 13:07:43,12980363,Walk Up,410.0,"2,494.00",2nd & Congress,2494.0,2nd & Congress,2,11.00,"2,016.00"
4446,2016-11-27 14:31:26,12989946,Walk Up,520.0,"2,575.00",Riverside @ S. Lamar,2549.0,Long Center @ South 1st & Riverside,16,11.00,"2,016.00"
4447,2016-11-27 15:36:53,12990581,Local365,15.0,"2,496.00",8th & Congress,2494.0,2nd & Congress,6,11.00,"2,016.00"
4448,2016-11-27 14:20:11,12989842,Walk Up,226.0,"2,563.00",Davis at Rainey Street,2570.0,South Congress & Academy,20,11.00,"2,016.00"

In [4]:
# conditional selection using time series index values 
df = pd.read_csv('data/AirPassengers.csv', parse_dates=['Month'], index_col=['Month'])
trn = df.loc[df.index < '1958-01-01']
trn.head()

            #Passengers
Month
1949-01-01          112
1949-02-01          118
1949-03-01          132
1949-04-01          129
1949-05-01          121

In [5]:
# percentage change b/w rows
# Creating the time-series index
ind = pd.date_range('01/01/2000', periods = 6, freq ='W')
# Creating the dataframe 
df = pd.DataFrame({"A":[14, 4, 5, 4, 1, 55],
                   "B":[5, 2, 54, 3, 2, 32], 
                   "C":[20, 20, 7, 21, 8, 5],
                   "D":[14, 3, 6, 2, 6, 4]}, index = ind)
df.pct_change()

               A     B     C     D
2000-01-02   nan   nan   nan   nan
2000-01-09 -0.71 -0.60  0.00 -0.79
2000-01-16  0.25 26.00 -0.65  1.00
2000-01-23 -0.20 -0.94  2.00 -0.67
2000-01-30 -0.75 -0.33 -0.62  2.00
2000-02-06 54.00 15.00 -0.38 -0.33

In [83]:
# categorical data

In [118]:
fruits = ['apple', 'orange', 'apple', 'orange'] * 2
N = len(fruits)
df = pd.DataFrame({'fruit': fruits,
                   'basket_id': arange(N),
                   'count': random.randint(3, 15, size=N),
                   'weight': random.uniform(0, 4, size=N)},
                  columns=['basket_id', 'fruit', 'count', 'weight'])
df['fruit'] = pd.Categorical(df['fruit'],ordered=True,categories=['apple','orange'])
# cat -> accessor for categorical values of a series 
df['fruit'].cat.categories = ["apples", "oranges"] # rename categries 
df['Fruit'] = df['fruit'].apply(str.capitalize).astype('category')
print(df)
print(df['fruit'].values.categories,df['fruit'].values.codes)
print(df['Fruit'].values.categories,df['Fruit'].values.codes)

   basket_id    fruit  count  weight    Fruit
0          0   apples      8    0.59   Apples
1          1  oranges     11    1.14  Oranges
2          2   apples      6    2.64   Apples
3          3  oranges      8    0.03  Oranges
4          4   apples     10    1.38   Apples
5          5  oranges      6    3.75  Oranges
6          6   apples     10    3.37   Apples
7          7  oranges     13    0.05  Oranges
Index(['apples', 'oranges'], dtype='object') [0 1 0 1 0 1 0 1]
Index(['Apples', 'Oranges'], dtype='object') [0 1 0 1 0 1 0 1]

In [33]:
# cutting df into categories(bins) 
df = pd.DataFrame({'number': np.random.randint(1, 100, 10)})
df['bins'] = pd.cut(x=df['number'], bins=[1, 20, 40, 60, 80, 100],
                    labels=['1 to 20', '21 to 40', '41 to 60',
                            '61 to 80', '81 to 100'])
df

   number       bins
0      42   41 to 60
1      93  81 to 100
2      89  81 to 100
3       2    1 to 20
4      80   61 to 80
5      67   61 to 80
6      71   61 to 80
7      33   21 to 40
8      56   41 to 60
9      65   61 to 80

In [27]:
# converts categorical data into dummy variables 
diff = pd.DataFrame({'R': ['a', 'c', 'd'],
                     'T': ['d', 'a', 'c']})
print(pd.get_dummies(diff))

   R_a  R_c  R_d  T_a  T_c  T_d
0    1    0    0    0    0    1
1    0    1    0    1    0    0
2    0    0    1    0    1    0

In [137]:
# convert dataframe to numbers(int or floats) and place str as nan
ser = pd.Series(['Geeks', 11, 22.7, 33])
print(pd.to_numeric(ser,errors = 'coerce'))

0     nan
1   11.00
2   22.70
3   33.00
dtype: float64

In [3]:
# clip data frame based on range(used to remove outliers) 
# Trim values at input threshold, Assigns values outside boundary to boundary values
# Minimum threshold value. All values below this threshold will be set to it.
# Maximum threshold value. All values above this threshold will be set to it.
df = pd.DataFrame({"A":[-5, 8, 12, -9, 5, 3],
                   "B":[-1, -4, 6, 4, 11, 3],
                   "C":[11, 4, -8, 7, 3, -2]})
lower_limit = pd.Series([1, -3, 2, 3, -2, -1])
# upper limit for each individual column element.
upper_limit = lower_limit + 5
df.clip(lower_limit, upper_limit, axis = 0)

   A  B  C
0  1  1  6
1  2 -3  2
2  7  6  2
3  3  4  7
4  3  3  3
5  3  3 -1

In [91]:
# iterating dataframes
# iteritems:- columns
# iterrows:- rows 
print(dfs,'\n')
for rowNo,row in dfs.iterrows():
    for colName, col in row.iteritems():
        print(colName,':',col)

    k1  k2
0  one   2
1  two   3

k1 : one
k2 : 2
k1 : two
k2 : 3

In [86]:
# importance of copy
# df2 = df1 is not making a copy of df1 and assign it to df2, 
# but setting up a pointer pointing to df1. So any changes in df2 would result in changes in df1
df1 = pd.DataFrame({ 'a':[0,0,0], 'b': [1,1,1]})
df2 = df1
df2['a'] = df2['a'] + 1
df1.head()

   a  b
0  1  1
1  1  1
2  1  1

In [87]:
# so use copy()
df1 = pd.DataFrame({ 'a':[0,0,0], 'b': [1,1,1]})
df2 = df1.copy()
df2['a'] = df2['a'] + 1
df1.head()

   a  b
0  0  1
1  0  1
2  0  1

In [122]:
# concat 2 columns into a column in a data frame with a seperator
data = pd.read_csv("https://media.geeksforgeeks.org/wp-content/uploads/nba.csv")
print(data.head())
# making copy of team column
new = data["Team"].copy()
# string to replace null values with
na_string ="No College"
# concatenating team with name column
# overwriting name column
data["College"]= data["College"].str.cat(new, sep =", ", na_rep = na_string)
# display
data.head()

            Name            Team  Number Position   Age Height  Weight  \
0  Avery Bradley  Boston Celtics    0.00       PG 25.00    6-2  180.00
1    Jae Crowder  Boston Celtics   99.00       SF 25.00    6-6  235.00
2   John Holland  Boston Celtics   30.00       SG 27.00    6-5  205.00
3    R.J. Hunter  Boston Celtics   28.00       SG 22.00    6-5  185.00
4  Jonas Jerebko  Boston Celtics    8.00       PF 29.00   6-10  231.00

             College       Salary
0              Texas 7,730,337.00
1          Marquette 6,796,117.00
2  Boston University          nan
3      Georgia State 1,148,640.00
4                NaN 5,000,000.00

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.00,PG,25.00,6-2,180.00,"Texas, Boston Celtics","7,730,337.00"
1,Jae Crowder,Boston Celtics,99.00,SF,25.00,6-6,235.00,"Marquette, Boston Celtics","6,796,117.00"
2,John Holland,Boston Celtics,30.00,SG,27.00,6-5,205.00,"Boston University, Boston Celtics",nan
3,R.J. Hunter,Boston Celtics,28.00,SG,22.00,6-5,185.00,"Georgia State, Boston Celtics","1,148,640.00"
4,Jonas Jerebko,Boston Celtics,8.00,PF,29.00,6-10,231.00,"No College, Boston Celtics","5,000,000.00"

In [ ]:
# data standardization:-
# normalizing the data to remove outliers so the data mean is 0 and variance is 1

In [9]:
details = {
    'col1': [1, 3, 5, 7, 9],
    'col2': [7, 4, 35, 14, 56]
}
  
# creating a Dataframe object
df = pd.DataFrame(details)

dfs = df.apply(lambda test: (test- test.mean())/test.std())
dfs

   col1  col2
0 -1.26 -0.74
1 -0.63 -0.87
2  0.00  0.54
3  0.63 -0.42
4  1.26  1.49

In [11]:
# cross section
d = {'num_legs': [4, 4, 4, 2, 2],
     'num_wings': [0, 0, 0, 2, 2],
     'class': ['mammal', 'mammal', 'mammal', 'bird', 'bird'],
     'animal': ['tiger', 'lion', 'fox', 'eagle', 'penguin'],
     'locomotion': ['walks', 'walks', 'walks', 'flies', 'walks']}
df = pd.DataFrame(data=d)
df = df.set_index(['class', 'animal', 'locomotion'])
print(df,'\n')
print(df.xs('lion',level=1),'\n')
print(df.xs('num_wings', axis=1))

                           num_legs  num_wings
class  animal  locomotion
mammal tiger   walks              4          0
       lion    walks              4          0
       fox     walks              4          0
bird   eagle   flies              2          2
       penguin walks              2          2

                   num_legs  num_wings
class  locomotion
mammal walks              4          0

class   animal   locomotion
mammal  tiger    walks         0
        lion     walks         0
        fox      walks         0
bird    eagle    flies         2
        penguin  walks         2
Name: num_wings, dtype: int64

In [ ]:
#data ingestion(ETL(extract transform load))
"""
ETL is a process that extracts the data from different source systems, then transforms the data 
(like applying calculations, concatenations, etc.) and finally loads the data into the Data Warehouse system
"""

In [18]:
# to csv(use encoding='utf-8' in case of any error)
ipl_data = {'Team': ['Riders', 'Riders', 'Devils', 'Devils', 'Kings',
   'kings', 'Kings', 'Kings', 'Riders', 'Royals', 'Royals', 'Riders'],
   'Rank': [1, 2, 2, 3, 3,4 ,1 ,1,2 , 4,1,2],
   'Year': [2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
   'Points':[876,789,863,673,741,812,756,788,694,701,804,690]}
df = pd.DataFrame(ipl_data)
df.to_csv('data/ipl.csv',header=True,index=None)
print(pd.read_csv('data/ipl.csv').head())

     Team  Rank  Year  Points
0  Riders     1  2014     876
1  Riders     2  2015     789
2  Devils     2  2014     863
3  Devils     3  2015     673
4   Kings     3  2014     741

In [29]:
# reading tsv files
data = pd.read_csv("data/spam.tsv", sep='\t', header=None)
data.columns = ['label', 'body_text']
data.head()

  label                                          body_text
0   ham  I've been searching for the right words to tha...
1  spam  Free entry in 2 a wkly comp to win FA Cup fina...
2   ham  Nah I don't think he goes to usf, he lives aro...
3   ham  Even my brother is not like to speak with me. ...
4   ham                I HAVE A DATE ON SUNDAY WITH WILL!!

In [11]:
# reading csv's by parsing dates
time_cols = ['tpep_dropoff_datetime', 'tpep_pickup_datetime']
df = pd.read_csv('data/taxi.csv.bz2', parse_dates=time_cols)
print(len(df))
print(df.head())

10000
   VendorID tpep_pickup_datetime tpep_dropoff_datetime  passenger_count  \
0         2  2018-10-31 07:10:55   2018-11-01 06:43:24                1
1         2  2018-10-31 16:38:25   2018-10-31 16:50:10                5
2         2  2018-10-31 20:23:41   2018-10-31 20:31:47                1
3         2  2018-10-31 22:44:24   2018-10-31 22:48:28                1
4         2  2018-10-31 23:22:18   2018-10-31 23:35:30                1

   trip_distance  RatecodeID store_and_fwd_flag  PULocationID  DOLocationID  \
0           2.57           1                  N           211            48
1           3.58           1                  N           237           144
2           2.39           1                  N           163           107
3           0.50           1                  N           246           246
4           1.81           1                  N            79            90

   payment_type  fare_amount  extra  mta_tax  tip_amount  tolls_amount  \
0             1         14.5    0.5      0.5        4.74           0.0
1             2         12.5    0.5      0.5        0.00           0.0
2             1          9.0    0.5      0.5        1.00           0.0
3             2          4.5    0.5      0.5        0.00           0.0
4             1         10.0    0.5      0.5        2.26           0.0

   improvement_surcharge  total_amount
0                    0.3         20.54
1                    0.3         13.80
2                    0.3         11.30
3                    0.3          5.80
4                    0.3         13.56

In [12]:
# xml to data frame 
import pandas as pd 
import xml.etree.ElementTree as et 

xtree = et.parse("data/data.xml")
xroot = xtree.getroot() 

df_cols = ["name", "email", "grade", "age"]
rows = []

for node in xroot: 
    s_name = node.attrib.get("name")
    s_mail = node.find("email").text if node is not None else None
    s_grade = node.find("grade").text if node is not None else None
    s_age = node.find("age").text if node is not None else None
    
    rows.append({"name": s_name, "email": s_mail, 
                 "grade": s_grade, "age": s_age})

pd.DataFrame(rows, columns = df_cols).head()

     name            email grade age
0    John    john@mail.com     A  16
1   Alice   alice@mail.com     B  17
2     Bob     bob@mail.com     C  16
3  Hannah  hannah@mail.com     A  17

In [3]:
# to/from json 
df = pd.read_csv('data/titanic.csv')
df.to_json('data/titanic.json')
df = pd.read_json('data/titanic.json')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,None,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,None,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,None,S

In [4]:
# read csv with filters 
df = pd.read_csv('data/titanic.csv',nrows=5)
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35,0,0,373450,8.0500,NaN,S

In [8]:
# reading from sql to data frame using sqlite3
import sqlite3
import pandas as pd

conn = sqlite3.connect('data/rides.db', detect_types=sqlite3.PARSE_DECLTYPES)
params = {
    'vendor': 'VeriFone',
}
sql = 'SELECT distance FROM rides WHERE vendor = :vendor'
rides_df = pd.read_sql(sql, conn, params=params)
print(rides_df.head())
avg_distance = rides_df['distance'].mean()
print(f'average distance: {avg_distance:.1f}miles')

   distance
0      7.91
1      3.23
2      1.46
3      2.74
4      0.84
average distance: 3.0miles

In [10]:
# to sqlite by creating table first with schema and then converting later from data frame 
from contextlib import closing

df = pd.read_csv('data/ship.csv')
df.interpolate(inplace=True)
schema = '''
CREATE TABLE Ship (
    name TEXT,
    lat FLOAT NOT NULL,
    lng FLOAT NOT NULL
);
'''
db_file = 'data/ship.db'
with closing(sqlite3.connect(db_file)) as conn:
    conn.executescript(schema)
    try:
        with conn as cur:
            cur.execute('BEGIN')
            df.to_sql('Ship', conn, if_exists='append', index=False)
    except:
        print('sql error')
    finally:
        conn.close()

In [12]:
# to sqlite using sqlalchemy and insert a row using pandas inbuilt sql io module   
from sqlalchemy import create_engine 
from pandas.io import sql
engine = create_engine('sqlite:///data/titanic.db', echo=False)
df.to_sql('titanic', con=engine, index_label='ID')
sql.execute('INSERT INTO titanic VALUES(?,?,?,?)', engine, params=[(4,'Upendra',30.55,-80.67)])
titanic_data = pd.read_sql('select * from titanic', engine)
titanic_data

   ID             name   lat    lng
0   0      Black Pearl 20.66 -80.71
1   1            Cobra 20.66 -80.71
2   2  Flying Dutchman 20.66 -80.71
3   3          Empress 20.66 -80.71
4   4          Upendra 30.55 -80.67

In [14]:
# csv to html
import pandas
import webbrowser
import os
# Read the dataset into a data table using Pandas
data_table = pandas.read_csv("data/movies.csv", index_col="movie_id")
# Create a web page view of the data for easy viewing
html = data_table.to_html()
# Save the html to a temporary file
with open("data/movies_list.html", "w") as f:
    f.write(html)
# Open the web page in our web browser
full_filename = os.path.abspath("data/movies_list.html")
webbrowser.open("file://{}".format(full_filename))

True

In [ ]:
# data frame validation
# by setting data type, null check, and conditional checks

In [18]:
import pandera as pa
import numpy as np
df = pd.read_csv('data/ships.csv')
schema = pa.DataFrameSchema({
    'name': pa.Column(pa.String),
    'lat': pa.Column(
        pa.Float,
        nullable=True,
        checks=pa.Check(
            lambda v: v >= -90 and v <= 90,
            element_wise=True,
        ),
    ),
    'lng': pa.Column(
        pa.Float,
        nullable=True,
        checks=pa.Check(
            lambda v: v >= -180 and v <= 180,
            element_wise=True,
        ),
    ),
})
df.interpolate(inplace=True)
schema.validate(df)

              name        lat        lng
0      Black Pearl  20.664865 -80.709747
1            Cobra  20.664868 -80.709740
2  Flying Dutchman  20.664878 -80.709941
3          Empress  20.664878 -80.709941

In [4]:
# hdf5 file handling 
import h5py
arr1 = np.random.randn(10000)
arr2 = np.random.randn(10000)
 
with h5py.File('test_read.hdf5', 'w') as f:
    f.create_dataset('array_1', data = arr1)
    f.create_dataset('array_2', data = arr2)

with h5py.File('test_read.hdf5', 'r') as f:
    d1 = f['array_1']
    d2 = f['array_2'] 
    data = d2[d1[:]>1]

print(f'{min(data)},{max(data)}, {data[:15]}')

-2.806575266061271,2.816776727785882, [-0.67008425 -0.9159855  -0.62015811 -0.05423158  0.23833257  0.38841283
 -0.88047513  0.43795014 -0.63382917 -0.14389094  2.17735466 -0.3431815
 -0.01487825  0.23111682 -0.4426593 ]

In [ ]:
# parquet format(columnar data storage)
"""
It means that data is encoded and stored by columns instead of by rows. This pattern allows for 
analytical queries to select a subset of columns for all rows. Parquet stores columns as chunks 
and can further split files within each chunk too. This allows restricting the disk i/o operations 
to a minimum.
The second feature to mention is data schema and types. Parquet is a binary format and allows 
encoded data types. Unlike some formats, it is possible to store data with a specific type of 
numeric( int32, int64, int96, float, double) and byte array. This allows clients to easily 
and efficiently serialise and deserialise the data when reading and writing to parquet format.
"""

In [86]:
# pandas optimization using apache paraquet with the help of apache arrow used in storing data in
# columnar format where you can even give a schema 
#rand:- Create an array of the given shape and populate it with random samples from a uniform 
#distribution over [0, 1). 
import pyarrow as pa
size = 5
df = pd.DataFrame({
    'time': pd.date_range('2021', freq='17s', periods=size),
    'name': ['cpu'] * size,
    'value': np.random.rand(size) * 40,
})
schema = pa.schema([
    ('time', pa.timestamp('ms')),
    ('name', pa.string()),
    ('value', pa.float64()),
])
out_file = 'data/metrics.parquet'
df.to_parquet(out_file, schema=schema)
pd.read_parquet(out_file)

                 time name  value
0 2021-01-01 00:00:00  cpu  24.23
1 2021-01-01 00:00:17  cpu  28.33
2 2021-01-01 00:00:34  cpu  35.22
3 2021-01-01 00:00:51  cpu  30.46
4 2021-01-01 00:01:08  cpu  12.91

# sql comparison

In [56]:
airports = pd.read_csv('data/airports.csv')
airport_freq = pd.read_csv('data/airport-frequencies.csv')
runways = pd.read_csv('data/runways.csv')

In [4]:
# select * from airports limit 3  
airports.head(3)

,id,ident,type,name,latitude_deg,longitude_deg,elevation_ft,continent,iso_country,iso_region,municipality,scheduled_service,gps_code,iata_code,local_code,home_link,wikipedia_link,keywords
0,6523,00A,heliport,Total Rf Heliport,40.070801,-74.933601,11.0,NaN,US,US-PA,Bensalem,no,00A,NaN,00A,NaN,NaN,NaN
1,323361,00AA,small_airport,Aero B Ranch Airport,38.704022,-101.473911,3435.0,NaN,US,US-KS,Leoti,no,00AA,NaN,00AA,NaN,NaN,NaN
2,6524,00AK,small_airport,Lowell Field,59.949200,-151.695999,450.0,NaN,US,US-AK,Anchor Point,no,00AK,NaN,00AK,NaN,NaN,NaN

In [80]:
# desc airports 
print(airports.info())
print(airports.columns)
print(airports.empty)

<class 'pandas.core.frame.DataFrame'>
Int64Index: 56059 entries, 0 to 56059
Data columns (total 18 columns):
id                   56059 non-null int64
ident                56059 non-null object
type                 56059 non-null object
name                 56059 non-null object
latitude_deg         56059 non-null float64
longitude_deg        56059 non-null float64
elevation_ft         48826 non-null float64
continent            27997 non-null object
iso_country          55813 non-null object
iso_region           56059 non-null object
municipality         50270 non-null object
scheduled_service    56059 non-null object
gps_code             41070 non-null object
iata_code            9234 non-null object
local_code           29075 non-null object
home_link            3039 non-null object
wikipedia_link       10006 non-null object
keywords             10014 non-null object
dtypes: float64(3), int64(1), object(14)
memory usage: 8.1+ MB
None
Index(['id', 'ident', 'type', 'name', 'latitude_deg', 'longitude_deg',
       'elevation_ft', 'continent', 'iso_country', 'iso_region',
       'municipality', 'scheduled_service', 'gps_code', 'iata_code',
       'local_code', 'home_link', 'wikipedia_link', 'keywords'],
      dtype='object')
False

In [5]:
# select id from airports where ident = 'KLAX'
airports[airports['ident'] == 'KLAX']['id']

28336    3632
Name: id, dtype: int64

In [6]:
# select distinct type from airport
airports['type'].unique()

array(['heliport', 'small_airport', 'closed', 'seaplane_base',
       'balloonport', 'medium_airport', 'large_airport'], dtype=object)

In [8]:
# select ident, name, municipality from airports where iso_region = 'US-CA' and type = 'seaplane_base'
airports[(airports['iso_region'] == 'US-CA') & (airports['type'] == 'seaplane_base')][['ident','name','municipality']]

      ident                                      name municipality
980     0O0          San Luis Reservoir Seaplane Base    Los Banos
2499   22CA            Commodore Center Seaplane Base    Sausalito
6265   5CA9       Konocti  - Clear Lake Seaplane Base  Kelseyville
13156   C39                 Folsom Lake Seaplane Base       Folsom
15493  CN20             Ferndale Resort Seaplane Base  Kelseyville
17878   E20              Lake Berryessa Seaplane Base         Napa
23298   H77           Bridge Bay Resort Seaplane Base      Redding
31072   L11                Pebbly Beach Seaplane Base       Avalon
37810   O06  Lake Oroville Landing Area Seaplane Base     Oroville
41501   S74                   Lost Isle Seaplane Base     Stockton
48967   TWH           Two Harbors Amphibious Terminal  Two Harbors

In [9]:
# select * from airport_freq where airport_ident = 'KLAX' order by type desc
airport_freq[airport_freq['airport_ident'] == 'KLAX'].sort_values(by = 'type',ascending = False)

          id  airport_ref airport_ident  type description  frequency_mhz
11951  60776         3632          KLAX  UNIC      UNICOM         122.95
11950  60775         3632          KLAX   TWR         TWR         119.80
11949  60774         3632          KLAX   OPS          AF          37.22
11947  60772         3632          KLAX  MISC          CG          34.50
11948  60773         3632          KLAX  MISC          CG         898.40
11946  60771         3632          KLAX   GND         GND         121.65
11945  60770         3632          KLAX   DEP   SOCAL DEP         124.30
11944  60769         3632          KLAX   CLD    CLNC DEL         121.40
11943  60768         3632          KLAX  ATIS        ATIS         133.80
11941  60767         3632          KLAX   APP   SOCAL APP          36.07
11942  60766         3632          KLAX   APP   SOCAL APP         124.30

In [13]:
# select * from airports where type not in ('heliport', 'balloonport')
# isin()
airports[~airports['type'].isin(['heliport', 'balloonport'])]

,id,ident,type,name,latitude_deg,longitude_deg,elevation_ft,continent,iso_country,iso_region,municipality,scheduled_service,gps_code,iata_code,local_code,home_link,wikipedia_link,keywords
1,323361,00AA,small_airport,Aero B Ranch Airport,38.704022,-101.473911,3435.0,NaN,US,US-KS,Leoti,no,00AA,NaN,00AA,NaN,NaN,NaN
2,6524,00AK,small_airport,Lowell Field,59.949200,-151.695999,450.0,NaN,US,US-AK,Anchor Point,no,00AK,NaN,00AK,NaN,NaN,NaN
3,6525,00AL,small_airport,Epps Airpark,34.864799,-86.770302,820.0,NaN,US,US-AL,Harvest,no,00AL,NaN,00AL,NaN,NaN,NaN
4,6526,00AR,closed,Newport Hospital & Clinic Heliport,35.608700,-91.254898,237.0,NaN,US,US-AR,Newport,no,NaN,NaN,NaN,NaN,NaN,00AR
5,322127,00AS,small_airport,Fulton Airport,34.942803,-97.818019,1100.0,NaN,US,US-OK,Alex,no,00AS,NaN,00AS,NaN,NaN,NaN
6,6527,00AZ,small_airport,Cordes Airport,34.305599,-112.165001,3810.0,NaN,US,US-AZ,Cordes,no,00AZ,NaN,00AZ,NaN,NaN,NaN
7,6528,00CA,small_airport,Goldstone /Gts/ Airport,35.350498,-116.888000,3038.0,NaN,US,US-CA,Barstow,no,00CA,NaN,00CA,NaN,NaN,NaN
8,324424,00CL,small_airport,Williams Ag Airport,39.427188,-121.763427,87.0,NaN,US,US-CA,Biggs,no,00CL,NaN,00CL,NaN,NaN,NaN
10,6529,00CO,closed,Cass Field,40.622202,-104.344002,4830.0,NaN,US,US-CO,Briggsdale,no,NaN,NaN,NaN,NaN,NaN,00CO
11,6531,00FA,small_airport,Grass Patch Airport,28.645500,-82.219002,53.0,NaN,US,US-FL,Bushnell,no,00FA,NaN,00FA,NaN,NaN,NaN
13,6533,00FL,small_airport,River Oak Airport,27.230900,-80.969200,35.0,NaN,US,US-FL,Okeechobee,no,00FL,NaN,00FL,NaN,NaN,NaN
14,6534,00GA,small_airport,Lt World Airport,33.767502,-84.068298,700.0,NaN,US,US-GA,Lithonia,no,00GA,NaN,00GA,NaN,NaN,NaN
17,6537,00ID,small_airport,Delta Shores Airport,48.145302,-116.213997,2064.0,NaN,US,US-ID,Clark Fork,no,00ID,NaN,00ID,NaN,NaN,NaN
18,322581,00IG,small_airport,Goltl Airport,39.724028,-101.395994,3359.0,NaN,US,US-KS,McDonald,no,00IG,NaN,00IG,NaN,NaN,NaN
20,6539,00IL,small_airport,Hammer Airport,41.978401,-89.560402,840.0,NaN,US,US-IL,Polo,no,00IL,NaN,00IL,NaN,NaN,NaN
22,6541,00IS,small_airport,Hayenga's Cant Find Farms Airport,40.025600,-89.122902,820.0,NaN,US,US-IL,Kings,no,00IS,NaN,00IS,NaN,NaN,NaN
23,6542,00KS,small_airport,Hayden Farm Airport,38.727798,-94.930496,1100.0,NaN,US,US-KS,Gardner,no,00KS,NaN,00KS,NaN,NaN,NaN
24,6543,00KY,small_airport,Robbins Roost Airport,37.409401,-84.619698,1265.0,NaN,US,US-KY,Stanford,no,00KY,NaN,00KY,NaN,NaN,NaN
27,6545,00LS,small_airport,Lejeune Airport,30.136299,-92.429398,12.0,NaN,US,US-LA,Esterwood,no,00LS,NaN,00LS,NaN,NaN,NaN
28,6546,00MD,small_airport,Slater Field,38.757099,-75.753799,45.0,NaN,US,US-MD,Federalsburg,no,00MD,NaN,00MD,NaN,NaN,NaN
30,6548,00MN,small_airport,Battle Lake Municipal Airport,46.299999,-95.700302,1365.0,NaN,US,US-MN,Battle Lake,no,00MN,NaN,00MN,NaN,NaN,NaN
31,6549,00MO,small_airport,Cooper Flying Service Airport,37.202801,-94.412399,970.0,NaN,US,US-MO,Alba,no,00MO,NaN,00MO,NaN,NaN,5K8
32,6550,00MT,closed,Sands Ranch Airport,48.537210,-109.705492,2600.0,NaN,US,US-MT,Havre,no,NaN,NaN,NaN,NaN,NaN,00MT
33,6551,00N,small_airport,Bucks Airport,39.473202,-75.185204,105.0,NaN,US,US-NJ,Bridgeton,no,00N,NaN,00N,NaN,NaN,NaN
34,6552,00NC,small_airport,North Raleigh Airport,36.085201,-78.371399,348.0,NaN,US,US-NC,Louisburg,no,00NC,NaN,00NC,NaN,NaN,NaN
36,321919,00NK,seaplane_base,Cliche Cove Seaplane Base,44.811861,-73.369806,96.0,NaN,US,US-NY,Beekmantown,no,00NK,NaN,00NK,NaN,NaN,NaN
37,6554,00NY,small_airport,Weiss Airfield,42.900101,-77.499702,1000.0,NaN,US,US-NY,West Bloomfield,no,00NY,NaN,00NY,NaN,NaN,NaN
38,6555,00OH,closed,Exit 3 Airport,41.590476,-84.141583,785.0,NaN,US,US-OH,Wauseon,no,NaN,NaN,NaN,NaN,NaN,"64D, 00OH"
40,328503,00OK,small_airport,Gull Bay Landing Airport,36.198598,-96.217693,960.0,NaN,US,US-OK,Sandsprings,no,00OK,NaN,00OK,NaN,NaN,NaN
43,45773,00PN,small_airport,Ferrell Field,41.299500,-80.211111,1301.0,NaN,US,US-PA,Mercer,no,00PN,NaN,00PN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
56029,32725,ZWYN,small_airport,Yining Airport,43.955799,81.330299,NaN,AS,CN,CN-65,Yining,yes,ZWYN,YIN,NaN,NaN,https://en.wikipedia.org/wiki/Yining_Airport,NaN
56030,30646,ZYAS,medium_airport,Anshan Air Base,41.105301,122.853996,NaN,AS,CN,CN-21,Anshan,yes,ZYAS,AOG,NaN,NaN,https://en.wikipedia.org/wiki/Anshan_Teng%27ao...,NaN
56031,27237,ZYCC,medium_airport,Longjia Airport,43.996201,125.684998,706.0,AS,CN,CN-22,Changchun,yes,ZYCC,CGQ,NaN,NaN,https://en.wikipedia.org/wiki/Changchun_Longji...,NaN
56032,300858,ZYCH,medium_airport,Changhai Airport,39.266667,122.666944,80.0,AS,CN,CN-21,Changhai,no,ZYCH,CNI,NaN,NaN,https://en.wikipedia.org/wiki/Changhai_Airport,NaN
56033,30827,ZYCY,medium_airport,Chaoyang Airport,41.538101,120.434998,568.0,AS,CN,CN-21,Chaoyang,yes,ZYCY,CHG,NaN,NaN,https://en.wikipedia.org/wiki/Chaoyang_Airport,NaN
56034,327349,ZYDU,medium_airport,Wudalianchi Dedu Airport,48.445000,126.133000,984.0,AS,CN,CN-23,Wudalianchi,yes,ZYDU,DTU,NaN,NaN,https://en.wikipedia.org/wiki/Wudalianchi_Dedu...,NaN
56035,324338,ZYFX,small_airport,Fuxin Airport,42.069014,121.718122,548.0,AS,CN,CN-21,Fuxin,no,ZYFX,NaN,NaN,NaN,NaN,NaN
56036,313994,ZYFY,medium_airport,Dongji Aiport,48.199494,134.366447,NaN,AS,CN,CN-23,Fuyuan,yes,ZYFY,FYJ,NaN,NaN,https://en.wikipedia.org/wiki/Fuyuan_Dongji_Ai...,NaN
56037,27238,ZYHB,large_airport,Taiping Airport,45.623402,126.250000,457.0,AS,CN,CN-23,Harbin,yes,ZYHB,HRB,NaN,NaN,https://en.wikipedia.org/wiki/Harbin_Taiping_I...,NaN
56038,31576,ZYHE,medium_airport,Heihe Airport,50.171621,127.308884,8530.0,AS,CN,CN-23,Heihe,yes,ZYHE,HEK,NaN,NaN,https://en.wikipedia.org/wiki/Heihe_Airport,NaN
56039,31701,ZYJL,small_airport,Jilin Airport,44.002201,126.396004,NaN,AS,CN,CN-22,Jilin,no,ZYJL,JIL,NaN,NaN,https://en.wikipedia.org/wiki/Jilin_Ertaizi_Ai...,NaN
56040,27239,ZYJM,medium_airport,Jiamusi Airport,46.843399,130.464996,262.0,AS,CN,CN-23,Jiamusi,yes,ZYJM,JMU,NaN,NaN,https://en.wikipedia.org/wiki/Jiamusi_Airport,NaN
56041,327450,ZYJS,medium_airport,Jiansanjiang Airport,47.110000,132.660278,NaN,AS,CN,CN-23,Jiansanjiang,yes,ZYJS,JSJ,NaN,NaN,https://en.wikipedia.org/wiki/Jiansanjiang_Air...,NaN
56042,313337,ZYJX,medium_airport,Jixi Xingkaihu Airport,45.293000,131.193000,760.0,AS,CN,CN-23,Jixi,yes,ZYJX,JXA,NaN,NaN,https://en.wikipedia.org/wiki/Jixi_Xingkaihu_A...,NaN
56043,31706,ZYJZ,medium_airport,Jinzhou Airport,41.101398,121.061996,NaN,AS,CN,CN-21,Jinzhou,yes,ZYJZ,JNZ,NaN,NaN,https://en.wikipedia.org/wiki/Jinzhou_Airport,Xiaolingzi Air Base
56044,307012,ZYLD,medium_airport,Lindu Airport,47.752056,129.019125,791.0,AS,CN,CN-23,Yichun,yes,ZYLD,LDS,NaN,NaN,https://en.wikipedia.org/wiki/Yichun_Lindu_Air...,Yichun Shi Airport
56045,300516,ZYLS,medium_airport,Yushu Batang Airport,32.836389,97.036389,12816.0,AS,CN,CN-63,Yushu,no,ZYLS,YUS,NaN,NaN,https://en.wikipedia.org/wiki/Yushu_Batang_Air...,NaN
56046,27240,ZYMD,medium_airport,Mudanjiang Hailang International Airport,44.524101,129.569000,883.0,AS,CN,CN-23,Mudanjiang,yes,ZYMD,MDG,NaN,NaN,https://en.wikipedia.org/wiki/Mudanjiang_Airport,Mudanjiang
56047,301193,ZYMH,medium_airport,Gu-Lian Airport,52.912778,122.430000,1836.0,AS,CN,CN-23,Mohe,yes,ZYMH,OHE,NaN,NaN,https://en.wikipedia.org/wiki/Mohe_Gulian_Airport,NaN
56048,27241,ZYQQ,medium_airport,Qiqihar Sanjiazi Airport,47.239601,123.917999,477.0,AS,CN,CN-23,Qiqihar,yes,ZYQQ,NDG,NaN,NaN,https://en.wikipedia.org/wiki/Qiqihar_Airport,NaN
56049,327451,ZYSQ,medium_airport,Songyuan Chaganhu Airport,44.938114,124.550178,459.0,AS,CN,CN-22,Qian Gorlos Mongol Autonomous County,yes,ZYSQ,YSQ,NaN,NaN,https://en.wikipedia.org/wiki/Songyuan_Chaganh...,NaN
56050,307017,ZYTH,small_airport,Tahe Airport,52.224444,124.720222,1240.0,AS,CN,CN-23,Tahe,no,ZYTH,NaN,NaN,NaN,NaN,NaN
56051,27242,ZYTL,large_airport,Zhoushuizi Airport,38.965698,121.539001,107.0,AS,CN,CN-21,Dalian,yes,ZYTL,DLC,NaN,NaN,https://en.wikipedia.org/wiki/Dalian_Zhoushuiz...,Dalian Air Base
56052,307013,ZYTN,medium_airport,Tonghua Sanyuanpu Airport,42.253889,125.703333,1200.0,AS,CN,CN-22,Tonghua,yes,ZYTN,TNH,NaN,NaN,https://en.wikipedia.org/wiki/Tonghua_Sanyuanp...,Tonghua Liuhe Airport
56053,27243,ZYTX,large_airport,Taoxian Airport,41.639801,123.483002,198.0,AS,CN,CN-21,Shenyang,yes,ZYTX,SHE,NaN,NaN,https://en.wikipedia.org/wiki/Shenyang_Taoxian...,NaN
56054,27244,ZYYJ,medium_airport,Yanji Chaoyangchuan Airport,42.882801,129.451004,624.0,AS,CN,CN-22,Yanji,yes,ZYYJ,YNJ,NaN,NaN,https://en.wikipedia.org/wiki/Yanji_Chaoyangch...,NaN
56055,317861,ZYYK,medium_airport,Yingkou Lanqi Airport,40.542524,122.358600,0.0,AS,CN,CN-21,Yingkou,yes,ZYYK,YKH,NaN,NaN,https://en.wikipedia.org/wiki/Yingkou_Lanqi_Ai...,NaN
56056,32753,ZYYY,medium_airport,Shenyang Dongta Airport,41.784401,123.496002,NaN,AS,CN,CN-21,Shenyang,no,ZYYY,NaN,NaN,NaN,NaN,NaN
56058,307326,ZZ-0002,small_airport,Glorioso Islands Airstrip,-11.584278,47.296389,11.0,AF,TF,TF-U-A,Grande Glorieuse,no,NaN,NaN,NaN,NaN,NaN,NaN
56059,313629,ZZZZ,small_airport,Satsuma Iōjima Airport,30.784722,130.270556,338.0,AS,JP,JP-46,Mishima-Mura,no,RJX7,NaN,NaN,NaN,http://wikimapia.org/6705190/Satsuma-Iwo-jima-...,"SATSUMA,IWOJIMA,RJX7"

In [19]:
# select count(*) from airports group by iso_country, type order by count(*)
airports.groupby(['iso_country', 'type']).size().sort_values(ascending = False)

iso_country  type
US           small_airport     13570
             heliport           6241
BR           small_airport      3205
US           closed             1684
AU           small_airport      1542
KR           heliport           1257
BR           heliport           1075
CA           small_airport      1005
MX           small_airport       926
DE           small_airport       746
GB           small_airport       732
US           medium_airport      687
CA           closed              655
AR           small_airport       625
CO           small_airport       592
US           seaplane_base       570
IT           small_airport       547
PG           small_airport       507
RU           small_airport       504
VE           small_airport       456
CA           heliport            416
ZA           small_airport       414
ID           small_airport       399
FR           small_airport       398
CA           seaplane_base       380
KE           small_airport       351
CL           small_airport       338
CA           medium_airport      327
MX           heliport            306
ES           small_airport       304
                               ...
MT           heliport              1
MS           medium_airport        1
MK           large_airport         1
DK           seaplane_base         1
MD           closed                1
ME           large_airport         1
             medium_airport        1
MF           medium_airport        1
DJ           medium_airport        1
MF           seaplane_base         1
DE           seaplane_base         1
MG           large_airport         1
MH           closed                1
MK           closed                1
DE           balloonport           1
MK           medium_airport        1
MS           closed                1
CZ           large_airport         1
ML           large_airport         1
MM           closed                1
MN           large_airport         1
MO           heliport              1
             large_airport         1
CX           medium_airport        1
CW           medium_airport        1
MP           small_airport         1
MQ           medium_airport        1
CV           large_airport         1
MR           large_airport         1
PA           large_airport         1
Length: 846, dtype: int64

In [24]:
# select count(*) from airports where iso_country = 'US' group by type having count(*) > 1000 order by count(*) desc
# we can use filter for having surrounded by groupby 
airports[airports['iso_country'] == 'US'].groupby('type')./
filter(lambda x: len(x) > 1000).groupby('type').size().sort_values(ascending=False)

type
small_airport    13570
heliport          6241
closed            1684
dtype: int64

In [29]:
# select * from airport_freq order by frequency_mhz desc limit 10
# nlargest 
# opposite is nsmallest
airport_freq.nlargest(10,columns='frequency_mhz')

,id,airport_ref,airport_ident,type,description,frequency_mhz
4412,57161,2877,FHAW,ACC,ATLANTICO FIR,1795.5
19803,71811,4976,NSFA,APP,APP,1790.4
19806,71814,4976,NSFA,INFO,RDO,1790.4
19809,71817,4976,NSFA,TWR,TWR,1790.4
22746,51506,6104,SKBO,OPS,MILGP RDO OPS,1395.0
24453,53626,26782,WAPK,RDO,RDO,1340.0
4632,51120,3043,FZAI,A/G,A/G VOICE RDO,1330.4
21904,55004,5656,RKSS,A/G,SEOUL RDO,1330.3
19649,51624,4839,MUHA,A/G,BOYEROS RDO INTL,1329.7
4916,51919,2383,HE44,RDO,UN ISMAILIYAH OPS,1325.7

In [30]:
# select * from airport_freq order by frequency_mhz desc limit 10 offset 10 
# return next 10 
airport_freq.nlargest(20,columns='frequency_mhz').tail(10)

,id,airport_ref,airport_ident,type,description,frequency_mhz
4421,53981,2880,FJDG,A/G,A/G VOICE,1325.4
19771,54876,4972,NGTA,CTAF,TARAWA RDO,1133.9
19863,55696,5011,NVVV,AFIS,FLT SVC,1133.9
19866,55699,5011,NVVV,TWR,TWR,1133.9
20991,68693,5388,PANC,MISC,SAN FRANCISCO ARINC,1133.0
19632,51653,4834,MUCM,A/G,CAMAGUEY RDO,1132.1
19636,51639,4835,MUCU,A/G,SANTIAGO RDO,1132.1
19648,51626,4839,MUHA,A/G,BOYEROS RDO NATL,1132.1
19656,51668,4840,MUHG,A/G,HOLGUIN RDO,1132.1
19675,51659,4859,MUVR,A/G,VARADERO RDO,1132.1

In [35]:
# select max(length_ft), min(length_ft), avg(length_ft), median(length_ft) from runways
runways['length_ft'].aggregate([max,min,mean,median])

max       120000.00000
min            0.00000
mean        3262.31036
median      2745.00000
Name: length_ft, dtype: float64

In [45]:
# join 
# select airport_ident, type, description, name from airport_freq join airports 
# on airport_freq.airport_ref = airports.id where airports.ident = 'KLAX'
airport_freq.rename(columns={'type':'freq_type'},inplace=True)
airport_freq.merge(airports[airports['ident'] == 'KLAX'], 
                   left_on='airport_ref', right_on='id')[['airport_ident', 'type', 'description', 'name']]

   airport_ident           type description                               name
0           KLAX  large_airport   SOCAL APP  Los Angeles International Airport
1           KLAX  large_airport   SOCAL APP  Los Angeles International Airport
2           KLAX  large_airport        ATIS  Los Angeles International Airport
3           KLAX  large_airport    CLNC DEL  Los Angeles International Airport
4           KLAX  large_airport   SOCAL DEP  Los Angeles International Airport
5           KLAX  large_airport         GND  Los Angeles International Airport
6           KLAX  large_airport          CG  Los Angeles International Airport
7           KLAX  large_airport          CG  Los Angeles International Airport
8           KLAX  large_airport          AF  Los Angeles International Airport
9           KLAX  large_airport         TWR  Los Angeles International Airport
10          KLAX  large_airport      UNICOM  Los Angeles International Airport

In [48]:
# select name, municipality from airports where ident = 'KLAX' union all select name, municipality 
# from airports where ident = 'KLGB'
pd.concat([airports[airports['ident'] == 'KLAX'][['name', 'municipality']],
           airports[airports['ident'] == 'KLGB'][['name', 'municipality']]]).reset_index(drop = True)

                                   name municipality
0     Los Angeles International Airport  Los Angeles
1  Long Beach /Daugherty Field/ Airport   Long Beach

In [63]:
# intersection
data1 = {'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'], 
        'Age':[27, 24, 22, 32], 
        'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj'], 
        'Qualification':['Msc', 'MA', 'MCA', 'Phd'],
        'Mobile No': [97, 91, 58, 76]} 
# Define a dictionary containing employee data 
data2 = {'Name':['Gaurav', 'Anuj', 'Dhiraj', 'Hitesh'], 
        'Age':[22, 32, 12, 52], 
        'Address':['Allahabad', 'Kannuaj', 'Allahabad', 'Kannuaj'], 
        'Qualification':['MCA', 'Phd', 'Bcom', 'B.hons'],
        'Salary':[1000, 2000, 3000, 4000]} 
# Convert the dictionary into DataFrame  
df = pd.DataFrame(data1,index=[0, 1, 2, 3])
# Convert the dictionary into DataFrame  
df1 = pd.DataFrame(data2, index=[2, 3, 6, 7]) 
res2 = pd.concat([df, df1], axis=1, join='inner')
print(res2)

     Name  Age    Address Qualification  Mobile No    Name  Age    Address  \
2  Gaurav   22  Allahabad           MCA         58  Gaurav   22  Allahabad
3    Anuj   32    Kannuaj           Phd         76    Anuj   32    Kannuaj

  Qualification  Salary
2           MCA    1000
3           Phd    2000

In [50]:
# update airports set home_link = 'http://www.lawa.org/welcomelax.aspx' where ident == 'KLAX'
# we can update using loc 
airports.loc[airports['ident'] == 'KLAX','home_link'] = 'http://www.lawa.org/welcomelax.aspx'
airports[airports['ident'] == 'KLAX']['home_link']

28336    http://www.lawa.org/welcomelax.aspx
Name: home_link, dtype: object

In [64]:
# delete from airports where ident = 'KLAX'
airports.drop(airports[airports['ident'] == 'KLAX'].index,inplace=True)

In [86]:
# min and max 
# idxmin - index of min & idxmax - index of max  
print('min frequency_mhz:',airport_freq.loc[airport_freq['frequency_mhz'].idxmin()]['description'])
print('max frequency_mhz:',airport_freq.loc[airport_freq['frequency_mhz'].idxmax()]['description'])

min frequency_mhz: ESCRAVOS TOWER
max frequency_mhz: ATLANTICO FIR

In [38]:
# pivot table 
# average survival rate for both males and females? In all 3 passenger classes
df = pd.read_csv('data/titanic.csv')
print(df.columns,'\n')
df.pivot_table(index = 'Sex', columns = 'Pclass', values = 'Survived', aggfunc = 'mean')

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

Pclass    1    2    3
Sex
female 0.97 0.92 0.50
male   0.37 0.16 0.14

In [106]:
# frequency table
p = array(["s1","s1","s1","s1","b1","b1","b1","b1","s1","s1","s1"], dtype=object)
q = array(["one","one","one","two","one","one","one","two","two","two","one"], dtype=object)
r = array(["x","x","y","x","x","y","y","x","y","y","y"], dtype=object)
print(pd.crosstab(p,q))
print('\n',pd.crosstab(p, [q, r], rownames=['p'], colnames=['q', 'r']))

col_0  one  two
row_0
b1       3    1
s1       4    3

 q  one    two
r    x  y   x  y
p
b1   1  2   1  0
s1   2  2   1  2

# web scraping

In [ ]:
# there are two libraies that we use for scraping 
# bs4(library) & scrapy(framework)
# bs4 for smaller tasks and scrapy for complex projects
# bs4 uses dom parsing style and uses selectors 
# where as scrapy follows event driven and uses xpath

In [1]:
import warnings
warnings.filterwarnings("ignore")

In [2]:
import requests 
from bs4 import BeautifulSoup
from datetime import datetime

In [3]:
import re

In [5]:
# local html parsing 
def parse_html(html):
    soup = BeautifulSoup(html, 'html.parser')
    print(soup.prettify())
    print(soup.title.string) # similarly you can get head 
    print(f"bootstrap cdn:{soup.find_all('script')[2].attrs['src']}")
    # <h4>Date: <i class="date">2019-11-11</i></h4>
    i = soup('i', {'class': 'date'})
    if not i:
        raise ValueError('cannot find date')
    if(soup.find('i', {'class': 'date'}).parent.name == 'h4'): # check if the parent tag is a h4 tag 
        date = datetime.strptime(i[0].text, '%Y-%m-%d')
        rowclass = soup.find('i', {'class': 'date'}).find_parent('div',class_="col-sm").\
                    parent.attrs['class']
        

    rates = {}
    for tr in soup('tr'):
        # <tr>
        # <td><i class="fas fa-pound-sign" data-toggle="tooltip"
        #   title="GBP"></i></td>
        # <td>0.83</td>
        # </tr>
        symbol_td, rate_td = tr('td')
        symbol = symbol_td('i')[0]['title']
        rate = float(rate_td.text)
        rates[symbol] = rate

    return date, rates, rowclass

with open('data/rates.html') as fp:
    html = fp.read()
    date, rates, rowclass = parse_html(html)
    print(f'date: {date}')
    row = 0
    for symbol, rate in rates.items():
        print(f'{rowclass[0]}_{row}:USD/{symbol} = {rate:f}')
        row += 1

<!DOCTYPE html>
<html>
 <head>
  <title>
   FX Rates
  </title>
  <link crossorigin="anonymous" href="https://stackpath.bootstrapcdn.com/bootstrap/4.3.1/css/bootstrap.min.css" integrity="sha384-ggOyR0iXCbMQv3Xipma34MD+dH/1fQ784/j6cY/iJTQUOhcWr7x9JvoRxT2MZw1T" rel="stylesheet"/>
  <link crossorigin="anonymous" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/5.9.0/css/all.min.css" rel="stylesheet"/>
  <meta charset="utf-8"/>
  <meta content="width=device-width, initial-scale=1, shrink-to-fit=no" name="viewport"/>
  <style>
   .date {
	color: blue;
}
  </style>
  <script crossorigin="anonymous" integrity="sha384-q8i/X+965DzO0rT7abK41JStQIAqVgRVzpbzo5smXKp4YfRvH+8abtTE1Pi6jizo" src="https://code.jquery.com/jquery-3.3.1.slim.min.js">
  </script>
  <script crossorigin="anonymous" integrity="sha384-UO2eT0CpHqdSJQ6hJty5KVphtPhzWj9WO1clHTMGa3JDZwrnQq4sF86dIHNDz0W1" src="https://cdnjs.cloudflare.com/ajax/libs/popper.js/1.14.7/umd/popper.min.js">
  </script>
  <script crossorigin="anonymous" integrity="sha384-JjSmVgyd0p3pXB1rRibZUAYoIIy6OrQ6VrjIEaFf/nJGzIxFDsf4x0xIM+B07jRM" src="https://stackpath.bootstrapcdn.com/bootstrap/4.3.1/js/bootstrap.min.js">
  </script>
 </head>
 <body>
  <div class="container">
   <div class="row">
    <div class="col-sm">
     <h1 class="text-center">
      FX Rates
     </h1>
     <h4>
      Base:
      <i class="fas fa-dollar-sign" data-toggle="tooltip" title="USD">
      </i>
     </h4>
    </div>
   </div>
   <div class="row">
    <div class="col">
     <table class="table table-stripped">
      <thead>
       <thead>
        <th>
         Currency
        </th>
        <th>
         Rate
        </th>
       </thead>
       <tbody>
        <tr>
         <td>
          <i class="fas fa-pound-sign" data-toggle="tooltip" title="GBP">
          </i>
         </td>
         <td>
          0.83
         </td>
        </tr>
        <tr>
         <td>
          <i class="fas fa-euro-sign" data-toggle="tooltip" title="EUR">
          </i>
         </td>
         <td>
          0.89
         </td>
        </tr>
        <tr>
         <td>
          <i class="fas fa-yen-sign" data-toggle="tooltip" title="JPY">
          </i>
         </td>
         <td>
          105.3
         </td>
        </tr>
        <tr>
         <td>
          <i class="fab fa-btc" data-toggle="tooltip" title="BTC">
          </i>
         </td>
         <td>
          0.000088
         </td>
        </tr>
        <tr>
         <td>
          <i class="fas fa-shekel-sign" data-toggle="tooltip" title="ILS">
          </i>
         </td>
         <td>
          3.48
         </td>
        </tr>
       </tbody>
      </thead>
     </table>
    </div>
   </div>
   <div class="row">
    <div class="col-sm">
     <h4>
      Date:
      <i class="date">
       2019-11-11
      </i>
     </h4>
    </div>
   </div>
  </div>
  <script>
   $(document).ready(function(){
  $('[data-toggle="tooltip"]').tooltip();
});
  </script>
 </body>
</html>

FX Rates
bootstrap cdn:https://stackpath.bootstrapcdn.com/bootstrap/4.3.1/js/bootstrap.min.js
date: 2019-11-11 00:00:00
row_0:USD/GBP = 0.830000
row_1:USD/EUR = 0.890000
row_2:USD/JPY = 105.300000
row_3:USD/BTC = 0.000088
row_4:USD/ILS = 3.480000

In [12]:
# getting content using classes and id's
base_url = 'http://books.toscrape.com/catalogue/page-{}.html'
res = requests.get(base_url.format('1'))
soup = BeautifulSoup(res.text,"lxml")
for el in soup.select(".product_pod")[0].children:
    print(el)

<div class="image_container">
<a href="a-light-in-the-attic_1000/index.html"><img alt="A Light in the Attic" class="thumbnail" src="../media/cache/2c/da/2cdad67c44b002e7ead0cc35693c0e8b.jpg"/></a>
</div>


<p class="star-rating Three">
<i class="icon-star"></i>
<i class="icon-star"></i>
<i class="icon-star"></i>
<i class="icon-star"></i>
<i class="icon-star"></i>
</p>


<h3><a href="a-light-in-the-attic_1000/index.html" title="A Light in the Attic">A Light in the ...</a></h3>


<div class="product_price">
<p class="price_color">Â£51.77</p>
<p class="instock availability">
<i class="icon-ok"></i>

        In stock

</p>
<form>
<button class="btn btn-primary btn-block" data-loading-text="Adding..." type="submit">Add to basket</button>
</form>
</div>

In [46]:
# navigating a html doc using beautiful soup
def parse_html(html):
    soup = BeautifulSoup(html, 'html.parser')
    # assigning head tag of BeautifulSoup variable
    hTag = soup.head
    # retrieving contents of BeautifulSoup variable
    print('content:-')
    print(hTag.contents)
    # iterating through child in descendants of htag variable
    print('descendants:-')
    for child in hTag.descendants:
        print(child)
    # iterating through all string in docs using stripped_strings 
    print('strings:-')
    for string in soup.stripped_strings :
        print(repr(string))
    print('children:-')
    print(soup.find_all('p')[1].next_element)
    print('sibling:-')
    print(soup.li.next_sibling.string)
with open('data/test_navigate.html') as fp:
    html = fp.read()
    parse_html(html)

content:-
[<title>Geeks For Geeks</title>]
descendants:-
<title>Geeks For Geeks</title>
Geeks For Geeks
strings:-
'Geeks For Geeks'
'most viewed courses in GFG,its all free'
'Top 5 Popular Programming Languages'
'Java'
'c/c++'
'Python'
'Javascript'
'Ruby'
'Geeks For Geeks'
"The Biggest Online Tutorials Library, It's all Free"
'according to an online survey.'
'Programming Languages'
children:-
Top 5 Popular Programming Languages
sibling:-
The Biggest Online Tutorials Library, It's all Free

In [63]:
# parsing section of a document using soup strainer 
from bs4 import BeautifulSoup, SoupStrainer
def parse_html(html):
    parse_only = SoupStrainer("body")
    soup = BeautifulSoup(html, 'html.parser',parse_only=parse_only)
    print(soup.prettify())
with open('data/rates.html') as fp:
    html = fp.read()
    parse_html(html)

<body>
 <div class="container">
  <div class="row">
   <div class="col-sm">
    <h1 class="text-center">
     FX Rates
    </h1>
    <h4>
     Base:
     <i class="fas fa-dollar-sign" data-toggle="tooltip" title="USD">
     </i>
    </h4>
   </div>
  </div>
  <div class="row">
   <div class="col">
    <table class="table table-stripped">
     <thead>
      <thead>
       <th>
        Currency
       </th>
       <th>
        Rate
       </th>
      </thead>
      <tbody>
       <tr>
        <td>
         <i class="fas fa-pound-sign" data-toggle="tooltip" title="GBP">
         </i>
        </td>
        <td>
         0.83
        </td>
       </tr>
       <tr>
        <td>
         <i class="fas fa-euro-sign" data-toggle="tooltip" title="EUR">
         </i>
        </td>
        <td>
         0.89
        </td>
       </tr>
       <tr>
        <td>
         <i class="fas fa-yen-sign" data-toggle="tooltip" title="JPY">
         </i>
        </td>
        <td>
         105.3
        </td>
       </tr>
       <tr>
        <td>
         <i class="fab fa-btc" data-toggle="tooltip" title="BTC">
         </i>
        </td>
        <td>
         0.000088
        </td>
       </tr>
       <tr>
        <td>
         <i class="fas fa-shekel-sign" data-toggle="tooltip" title="ILS">
         </i>
        </td>
        <td>
         3.48
        </td>
       </tr>
      </tbody>
     </thead>
    </table>
   </div>
  </div>
  <div class="row">
   <div class="col-sm">
    <h4>
     Date:
     <i class="date">
      2019-11-11
     </i>
    </h4>
   </div>
  </div>
 </div>
 <script>
  $(document).ready(function(){
  $('[data-toggle="tooltip"]').tooltip();
});
 </script>
</body>

In [61]:
# modifying html using bs4
markup = """<p class="para">gfg</p>
"""
# parsering string to HTML
soup = BeautifulSoup(markup, 'html.parser')
# extracting a tag
tag = soup.p
# modifying tag name
tag.name = "div" 
print("After modifying the tag name: ")
print(tag)
# modifying its class attribute
tag['class'] = "div_class"
# adding new attribute
tag['id'] = "div_id"
print("After modifying and adding attributes: ")
print(tag) 
# to delete any attributes
del tag["class"]
print("After deleting class attribute: ")
print(tag) 
# modifying the tags content
tag.string = "Geeks"
print("After modifying tag string: ")
print(tag)
# inserting content
tag = soup.div
tag.insert(1, " for Geeks")
print("After inserting: ")
print(tag)
# adding tags
tag = soup.new_tag("p")
tag.string = "Geeks for Geeks"
# insert after
print('insert before:')
soup.div.insert_after(tag)
print(soup.p)
# wrapping around the string
print('wrapping string')
soup.p.string.wrap(soup.new_tag("i"))
print(soup)

After modifying the tag name:
<div class="para">gfg</div>
After modifying and adding attributes:
<div class="div_class" id="div_id">gfg</div>
After deleting class attribute:
<div id="div_id">gfg</div>
After modifying tag string:
<div id="div_id">Geeks</div>
After inserting:
<div id="div_id">Geeks for Geeks</div>
insert before:
<p>Geeks for Geeks</p>
wrapping string
<div id="div_id">Geeks for Geeks</div><p><i>Geeks for Geeks</i></p>

In [ ]:
#wikipedia

In [65]:
website_url = requests.get('https://en.wikipedia.org/wiki/List_of_Asian_countries_by_area').text

In [66]:
soup = BeautifulSoup(website_url,'lxml')

In [68]:
print(soup.title.string)
countries = []
# find 1st matching vs all matching(complete tag including child tags)  
my_table = soup.find('table',{'class':'wikitable sortable'})
links = my_table.findAll('a',href=True)
for link in links:
    if link.has_attr("title"):
        # get the value of the attribute 
        countries.append(link.get('title'))
print(countries)

List of Asian countries by area - Wikipedia
['Russia', 'European Russia', 'China', 'Taiwan', 'Hong Kong', 'Macao', 'India', 'Kazakhstan', 'Saudi Arabia', 'Iran', 'Mongolia', 'Indonesia', 'Western New Guinea', 'Oceania', 'Pakistan', 'Turkey', 'East Thrace', 'Myanmar', 'Afghanistan', 'Yemen', 'Thailand', 'Turkmenistan', 'Uzbekistan', 'Iraq', 'Japan', 'Vietnam', 'Malaysia', 'Oman', 'Philippines', 'Laos', 'Kyrgyzstan', 'Syria', 'Golan Heights', 'Cambodia', 'Bangladesh', 'Nepal', 'Tajikistan', 'North Korea', 'South Korea', 'Jordan', 'United Arab Emirates', 'Azerbaijan', 'Caucasus', 'Europe', 'Asia', 'Georgia (country)', 'Caucasus', 'Europe', 'Asia', 'Sri Lanka', 'Egypt', 'Bhutan', 'Taiwan', 'Armenia', 'Armenian highlands', 'Caucasus', 'Europe', 'Asia', 'Israel', 'West Bank', 'Gaza Strip', 'Golan Heights', 'Kuwait', 'East Timor', 'Qatar', 'Lebanon', 'Cyprus', 'Northern Cyprus', 'State of Palestine', 'West Bank', 'Gaza Strip', 'Brunei', 'Bahrain', 'Singapore', 'Maldives']

In [ ]:
# monster.com

In [20]:
URL = 'https://www.monster.com/jobs/search/?q=Software-Developer&where=Australia'
page = requests.get(URL)
soup = BeautifulSoup(page.content, 'html.parser')

In [22]:
# find by id
results = soup.find(id='ResultsContainer')
# find by class and element 
job_elems = results.find_all('section', class_='card-content')

In [25]:
for job_elem in job_elems:
    title_elem = job_elem.find('h2', class_='title')
    company_elem = job_elem.find('div', class_='company')
    location_elem = job_elem.find('div', class_='location')
    if None in (title_elem, company_elem, location_elem):
        continue
    # get text from the element 
    print(title_elem.text.strip())
    print(company_elem.text.strip())
    print(location_elem.text.strip())
    print()

SQL BI (SSRS, SSIS) developer for Blackboard - NYC
LanceSoft Inc
New york, WA

Python Developer
LanceSoft Inc
Woodlands, WA

Junior QA Analyst - Melbourne, Victoria
Mediaocean
Melbourne, VIC

Test Analyst
Dialog Group
Canberra, ACT

Test Consultant
Dialog Group
Brisbane, QLD

Customer Experience Technical Analyst - Sydney, New South Wales
Mediaocean
Sydney, NSW

Senior Practice Manager - IES (WA)
Blue Ocean Ventures
New York, WA

Enterprise Account Executive
Zuora
Sydney, NSW

Senior Automation Tester
Dialog Group
Canberra, ACT

Software Developer (C# / ASP.NET) - Healthcare Software Company
CyberCoders
Chesterfield, MO

In [26]:
# get attribute 
# string here can be a list also
python_jobs = results.find_all('h2',
                        string=lambda text: "python" in text.lower())  

for p_job in python_jobs:
    link = p_job.find('a')['href']
    print(p_job.text.strip())
    print(f"Apply here: {link}\n")

Python Developer
Apply here: https://job-openings.monster.com/python-developer-woodlands-wa-us-lancesoft-inc/4755ec59-d0db-4ce9-8385-b4df7c1e9f7c

In [ ]:
# hacker news

In [7]:
response = requests.get("https://news.ycombinator.com/")
soup = BeautifulSoup(response.text, 'html.parser')

article_titles = []
article_links = []
for article_tag in soup.find_all(name="span", class_="titleline"):
    article_titles.append(article_tag.text)# gets text from each span 
    article_links.append(article_tag.find("a")["href"])

article_upvotes = []
for article in soup.find_all(name="td", class_="subtext"):
    if article.span.find(class_="score") is None:
        article_upvotes.append(0)
    else:
        article_upvotes.append(int(article.span.find(class_="score").text.split()[0]))

max_points_index = article_upvotes.index(max(article_upvotes))
print(
    f"{article_titles[max_points_index]}, "
    f"{article_upvotes[max_points_index]} points, "
    f"available at: {article_links[max_points_index]}."
)

Zed, a collaborative code editor, is now open source (zed.dev), 1260 points, available at: https://zed.dev/blog/zed-is-now-open-source.

In [ ]:
# empire online 100 movies to watch

In [8]:
URL = "https://web.archive.org/web/20200518073855/https://www.empireonline.com/movies/features/best-movies-2/"

# Write your code below this line 👇

response = requests.get(URL)
website_html = response.text

soup = BeautifulSoup(website_html, "html.parser")

all_movies = soup.find_all(name="h3", class_="title")

movie_titles = [movie.getText() for movie in all_movies]
movies = movie_titles[::-1]

with open("data/movies_100.txt", mode="w") as file:
    for movie in movies:
        file.write(f"{movie}\n")

In [ ]:
# epidomology of depression

In [33]:
URL = 'https://en.wikipedia.org/wiki/Epidemiology_of_depression'
page = requests.get(URL)
soup = BeautifulSoup(page.content, 'html.parser')

In [34]:
tables = soup.find_all('table')

In [35]:
def process_num(num):
    return float(re.sub(r'[^\w\s]','',num))

In [42]:
data = {
    'countries':[],
    'ranks':[],
    'rates':[]}

for table in tables:
    rows = table.find_all('tr')
    
    for row in rows:
        cells = row.find_all('td')
        
        
        if len(cells) > 1:
            rank = cells[0]
            data['ranks'].append(int(rank.text))
            
            country = cells[1]
            data['countries'].append(country.text.strip())
            
            rate = cells[2]
            data['rates'].append(process_num(rate.text.strip()))

In [44]:
df = pd.DataFrame(data)
df.head(20)

        countries  ranks     rates
0   United States      1  145474.0
1           Nepal      2  142448.0
2      East Timor      3  140410.0
3      Bangladesh      4  140153.0
4           India      5  140084.0
5        Pakistan      6  140042.0
6          Brazil      7  139610.0
7        Maldives      8  139161.0
8          Bhutan      9  138553.0
9     Afghanistan     10  138514.0
10        Finland     11  134413.0
11         Israel     12  127392.0
12       Slovenia     13  124847.0
13        Belgium     14  124446.0
14         France     15  123432.0
15          Chile     16  122123.0
16      Guatemala     17  117703.0
17          Haiti     18  117073.0
18        Bolivia     19  116156.0
19      Nicaragua     20  116125.0

In [ ]:
# amazon review scraping

In [1]:
import requests
from bs4 import BeautifulSoup
import pandas as pd

In [2]:
header={'user-agent': 'Mozilla/5.0 (Macintosh; Intel Mac OS X 10_14_1) /
        AppleWebKit/537.36 (KHTML, like Gecko) Chrome/81.0.4044.129 Safari/537.36'}

In [3]:
cookie = {'cookie': 'ubid-acbin=260-1909053-4047640; lc-acbin=en_IN; /
          x-wl-uid=1rkHSudA/viplXWOFpVAUqTmi37h0RslVkgv82Dto06D1k632NaPouL/Z96cPd/
          BQwqFG1iB7wYBFfDtswYGVlMLMQnjgEeiCp/lDN4Hf9+vsDZ0o/m1GRF0JsD+RE4p/LCQXZ9/uNT4=; 
          session-id=258-2370200-2213941; i18n-prefs=INR; p2dPopoverID_all_A3080OUTBC0143=1568050739.944; 
          p2dPopoverID_default_A3080OUTBC0143=1568050739.945; s_nr=1572545365305-New; 
          s_vnum=2004545365306%26vn%3D1; s_dslv=1572545365308; 
          x-acbin="TkGELE9fih23UyL0hFfqryLJmCFz?5sjtkyvUtoEHZWtpNvsclvFZ0jNE1@tnHJD"; 
          at-acbin=Atza|IwEBICkYRnHoNbSeL_OAlNQ5OmvMQabdnDHK3EUXxoSYs0NYFdCB9ri6HCNjQ09-rHfxymAVQ0UgV0yU4jZ0VOqxKy-
          pJJK3yzksl01F9sm6bemCKYBVS1JRt2xMb8y6m_LdCfYxQd2fFFHeNIciF8rJCBvXf1HLvZsQZASrph60NU5JdGSPn3UQ_
          kpN6tvDLt7VvEAZ483PjB5651HphmVDbw-dD56ye9PWek4zSwPjDeQr4_WSw5dROVUgqOX-Dmdk1-tOQOMm-
          mcZWqVZweZ5A1rCPytAC5B0zd-9n5Lm3rWqFLf4F2puOVGE868MCzXfDb2KiwP5ESdQRkX5vQ2aHYs5gS-
          5YzT3A6mdhPMbHcdxUxm3cYhi6YLmSpIXHZWxxBXQdRlfMvz21FW3IZZSdwNY; 
          sess-at-acbin="pB5POe1Bdxu71Vt54rwQ4K2UFhIeq29aeLjs+bWwxO8="; 
          sst-acbin=Sst1|PQGnXVXsh_wr3BCCuhtSnZTpCxq1BP0NNqHuWgjdy9zLlIohgpv--
          iUhHZKJX4jThrQjaPeyy4CbWidrKImxNcY_ZdDrCgvMEd3jmhTkpUeQxOghHNtfCJ9SIDOoG5x3kguR03UrSWKdQ_gM_
          wJ15CRFFtPV6Z39dfp5GxsoCXfTRARjM8eIU85uNq6-jm-CHpTdQGoioqBeNe2DFk0kHohgt9hiHxPfoCCVSU-
          a6HfCU3Bqu2m14qajk8oPaBIAYeBMWweSrhAzvsyLV5-I4XZCuKGf6rxs2qtqWk0rZydjNzdvZ6V4nXLf_
          CRXkJky6DcWxzJQio4JsCLwf9XfQ-JwaA; visitCount=3; session-token="Gsa+1UjEo45P9sMD6I9zqcA/nkAPsxx5mV+
          0bPps0Sf14MhKn7oWqEIDgOw9YLduIE04xXe6yaN3XmomI6X7tx14il0O2NFqUWh90msqn9LUceSxRjhgaNIY+
          zRdcLzAJCIvcyD7GduhsXoUhcG6tRNg+/h+phtrwzwxyNtBtJvE/9MJMYMPzNOnuY8r0EhHnAzsShyXH49wBJq0sEkGrD5K/
          wb3bbIzcipj1O5knCztGY2xo/GgopHQsnIa53sZdsMDBP4alTA="; session-id-time=2082758401l; 
          csm-hit=tb:0H2316FA44GP86DJ1QQY+s-KMSBTN6M3KGNH4ABSG0Z|1588756160911&t:1588756160912&adb:adblk_no'}

In [4]:
def Search(search_query):
    url="https://www.amazon.in/s?k="+search_query
    print(url)
    page=requests.get(url,headers=header,cookies=cookie)
    if page.status_code==200:
        return page,url
    else:
        return "Error"

In [5]:
product_Name=[]
Asin_no=[]
for i in range(1,4):
    response,url=Search("jbl+speakers&page="+str(i))
    soup=BeautifulSoup(response.content)
    for i in soup.findAll('span',attrs={'class':'a-size-base-plus a-color-base a-text-normal'}):
        product_Name.append(i.text)
    for i in soup.findAll('div',
                          attrs={'class':'sg-col-4-of-24 sg-col-4-of-12 sg-col-4-of-36 s-result-item /
                                 s-asin sg-col-4-of-28 sg-col-4-of-16 sg-col sg-col-4-of-20 sg-col-4-of-32'}):
        Asin_no.append(i['data-asin'])

https://www.amazon.in/s?k=jbl+speakers&page=1
https://www.amazon.in/s?k=jbl+speakers&page=2
https://www.amazon.in/s?k=jbl+speakers&page=3

In [6]:
len(Asin_no)

144

In [7]:
def url_link(query):
    url="https://www.amazon.in/dp/"+query
    page=requests.get(url,headers=header)
    if page.status_code==200:
        return page
    else:
        return "Error"

In [8]:
Link=[]
for i in range(len(Asin_no)):
    if Asin_no[i]!='':
        link_response=url_link(Asin_no[i])
        soup=BeautifulSoup(link_response.content)
        for i in soup.findAll('a',attrs={'data-hook':'see-all-reviews-link-foot'}):
            Link.append(i['href'])

In [9]:
def content(query):
    url="https://www.amazon.in/"+query
    print(url)
    page=requests.get(url,headers=header)
    if page.status_code==200:
        return page
    else:
        return "Error"

In [10]:
reviews=[]
ratings=[]
for k in range(len(Link)):
    for i in range(1,11):
        cont_response=content(Link[k]+'&pageNumber='+str(i))
        soup=BeautifulSoup(cont_response.content)
        for j in soup.findAll("span",attrs={'data-hook':'review-body'}):
            reviews.append(j.text)
        for star in soup.findAll("i",attrs={'data-hook':"review-star-rating"}):
            ratings.append(star.text)

https://www.amazon.in//%E0%A4%AA%E0%A5%8B%E0%A4%B0%E0%A5%8D%E0%A4%9F%E0%A5%87%E0%A4%AC%E0%A4%B2-%E0%A4%B5%E0%A4%BE%E0%A4%AF%E0%A4%B0%E0%A4%B2%E0%A5%87%E0%A4%B8-Bluetooth-%E0%A4%AE%E0%A4%BE%E0%A4%87%E0%A4%95-%E0%A4%B8%E0%A5%8D%E0%A4%AA%E0%A5%80%E0%A4%95%E0%A4%B0/product-reviews/B00TFGVULI?reviewerType=all_reviews&pageNumber=1
https://www.amazon.in//%E0%A4%AA%E0%A5%8B%E0%A4%B0%E0%A5%8D%E0%A4%9F%E0%A5%87%E0%A4%AC%E0%A4%B2-%E0%A4%B5%E0%A4%BE%E0%A4%AF%E0%A4%B0%E0%A4%B2%E0%A5%87%E0%A4%B8-Bluetooth-%E0%A4%AE%E0%A4%BE%E0%A4%87%E0%A4%95-%E0%A4%B8%E0%A5%8D%E0%A4%AA%E0%A5%80%E0%A4%95%E0%A4%B0/product-reviews/B00TFGVULI?reviewerType=all_reviews&pageNumber=2
https://www.amazon.in//%E0%A4%AA%E0%A5%8B%E0%A4%B0%E0%A5%8D%E0%A4%9F%E0%A5%87%E0%A4%AC%E0%A4%B2-%E0%A4%B5%E0%A4%BE%E0%A4%AF%E0%A4%B0%E0%A4%B2%E0%A5%87%E0%A4%B8-Bluetooth-%E0%A4%AE%E0%A4%BE%E0%A4%87%E0%A4%95-%E0%A4%B8%E0%A5%8D%E0%A4%AA%E0%A5%80%E0%A4%95%E0%A4%B0/product-reviews/B00TFGVULI?reviewerType=all_reviews&pageNumber=3
https://www.amazon.in//%E0%A4%AA%E0%A5%8B%E0%A4%B0%E0%A5%8D%E0%A4%9F%E0%A5%87%E0%A4%AC%E0%A4%B2-%E0%A4%B5%E0%A4%BE%E0%A4%AF%E0%A4%B0%E0%A4%B2%E0%A5%87%E0%A4%B8-Bluetooth-%E0%A4%AE%E0%A4%BE%E0%A4%87%E0%A4%95-%E0%A4%B8%E0%A5%8D%E0%A4%AA%E0%A5%80%E0%A4%95%E0%A4%B0/product-reviews/B00TFGVULI?reviewerType=all_reviews&pageNumber=4
https://www.amazon.in//%E0%A4%AA%E0%A5%8B%E0%A4%B0%E0%A5%8D%E0%A4%9F%E0%A5%87%E0%A4%AC%E0%A4%B2-%E0%A4%B5%E0%A4%BE%E0%A4%AF%E0%A4%B0%E0%A4%B2%E0%A5%87%E0%A4%B8-Bluetooth-%E0%A4%AE%E0%A4%BE%E0%A4%87%E0%A4%95-%E0%A4%B8%E0%A5%8D%E0%A4%AA%E0%A5%80%E0%A4%95%E0%A4%B0/product-reviews/B00TFGVULI?reviewerType=all_reviews&pageNumber=5
https://www.amazon.in//%E0%A4%AA%E0%A5%8B%E0%A4%B0%E0%A5%8D%E0%A4%9F%E0%A5%87%E0%A4%AC%E0%A4%B2-%E0%A4%B5%E0%A4%BE%E0%A4%AF%E0%A4%B0%E0%A4%B2%E0%A5%87%E0%A4%B8-Bluetooth-%E0%A4%AE%E0%A4%BE%E0%A4%87%E0%A4%95-%E0%A4%B8%E0%A5%8D%E0%A4%AA%E0%A5%80%E0%A4%95%E0%A4%B0/product-reviews/B00TFGVULI?reviewerType=all_reviews&pageNumber=6
https://www.amazon.in//%E0%A4%AA%E0%A5%8B%E0%A4%B0%E0%A5%8D%E0%A4%9F%E0%A5%87%E0%A4%AC%E0%A4%B2-%E0%A4%B5%E0%A4%BE%E0%A4%AF%E0%A4%B0%E0%A4%B2%E0%A5%87%E0%A4%B8-Bluetooth-%E0%A4%AE%E0%A4%BE%E0%A4%87%E0%A4%95-%E0%A4%B8%E0%A5%8D%E0%A4%AA%E0%A5%80%E0%A4%95%E0%A4%B0/product-reviews/B00TFGVULI?reviewerType=all_reviews&pageNumber=7
https://www.amazon.in//%E0%A4%AA%E0%A5%8B%E0%A4%B0%E0%A5%8D%E0%A4%9F%E0%A5%87%E0%A4%AC%E0%A4%B2-%E0%A4%B5%E0%A4%BE%E0%A4%AF%E0%A4%B0%E0%A4%B2%E0%A5%87%E0%A4%B8-Bluetooth-%E0%A4%AE%E0%A4%BE%E0%A4%87%E0%A4%95-%E0%A4%B8%E0%A5%8D%E0%A4%AA%E0%A5%80%E0%A4%95%E0%A4%B0/product-reviews/B00TFGVULI?reviewerType=all_reviews&pageNumber=8
https://www.amazon.in//%E0%A4%AA%E0%A5%8B%E0%A4%B0%E0%A5%8D%E0%A4%9F%E0%A5%87%E0%A4%AC%E0%A4%B2-%E0%A4%B5%E0%A4%BE%E0%A4%AF%E0%A4%B0%E0%A4%B2%E0%A5%87%E0%A4%B8-Bluetooth-%E0%A4%AE%E0%A4%BE%E0%A4%87%E0%A4%95-%E0%A4%B8%E0%A5%8D%E0%A4%AA%E0%A5%80%E0%A4%95%E0%A4%B0/product-reviews/B00TFGVULI?reviewerType=all_reviews&pageNumber=9
https://www.amazon.in//%E0%A4%AA%E0%A5%8B%E0%A4%B0%E0%A5%8D%E0%A4%9F%E0%A5%87%E0%A4%AC%E0%A4%B2-%E0%A4%B5%E0%A4%BE%E0%A4%AF%E0%A4%B0%E0%A4%B2%E0%A5%87%E0%A4%B8-Bluetooth-%E0%A4%AE%E0%A4%BE%E0%A4%87%E0%A4%95-%E0%A4%B8%E0%A5%8D%E0%A4%AA%E0%A5%80%E0%A4%95%E0%A4%B0/product-reviews/B00TFGVULI?reviewerType=all_reviews&pageNumber=10
https://www.amazon.in//%E0%A4%AA%E0%A5%8B%E0%A4%B0%E0%A5%8D%E0%A4%9F%E0%A5%87%E0%A4%AC%E0%A4%B2-%E0%A4%B5%E0%A4%BE%E0%A4%AF%E0%A4%B0%E0%A4%B2%E0%A5%87%E0%A4%B8-Bluetooth-%E0%A4%AE%E0%A4%BE%E0%A4%87%E0%A4%95-%E0%A4%B8%E0%A5%8D%E0%A4%AA%E0%A5%80%E0%A4%95%E0%A4%B0/product-reviews/B00TFGVULI?reviewerType=all_reviews&pageNumber=1
https://www.amazon.in//%E0%A4%AA%E0%A5%8B%E0%A4%B0%E0%A5%8D%E0%A4%9F%E0%A5%87%E0%A4%AC%E0%A4%B2-%E0%A4%B5%E0%A4%BE%E0%A4%AF%E0%A4%B0%E0%A4%B2%E0%A5%87%E0%A4%B8-Bluetooth-%E0%A4%AE%E0%A4%BE%E0%A4%87%E0%A4%95-%E0%A4%B8%E0%A5%8D%E0%A4%AA%E0%A5%80%E0%A4%95%E0%A4%B0/product-reviews/B00TFGVULI?reviewerType=all_reviews&pageNumber=2
https://www.amazon.in//%E0%A4%AA%E0%A5%8B%E0%A4%B0%E0%A5%8D%E0%A4%9F%E0%A5%87%E0%A4%AC%E0%A4%B2-%E0%A4%B5%E0%A4%BE%E0%A4%AF%E0%A4%B0%E0%A4%B2%E0%A5%87%E0%A4%B8-Bluetooth-%E0%A4%AE%E0%A4%BE%E0%A4%87%E0%A4%95-%E0%A4%B8%E0%A5%8D%E0%A4%AA%E0%A5%80%E0%A4%95%E0%A4%B0/product-reviews/B00TFGVULI?reviewerType=all_reviews&pageNumber=3
https://www.amazon.in//%E0%A4%AA%E0%A5%8B%E0%A4%B0%E0%A5%8D%E0%A4%9F%E0%A5%87%E0%A4%AC%E0%A4%B2-%E0%A4%B5%E0%A4%BE%E0%A4%AF%E0%A4%B0%E0%A4%B2%E0%A5%87%E0%A4%B8-Bluetooth-%E0%A4%AE%E0%A4%BE%E0%A4%87%E0%A4%95-%E0%A4%B8%E0%A5%8D%E0%A4%AA%E0%A5%80%E0%A4%95%E0%A4%B0/product-reviews/B00TFGVULI?reviewerType=all_reviews&pageNumber=4
https://www.amazon.in//%E0%A4%AA%E0%A5%8B%E0%A4%B0%E0%A5%8D%E0%A4%9F%E0%A5%87%E0%A4%AC%E0%A4%B2-%E0%A4%B5%E0%A4%BE%E0%A4%AF%E0%A4%B0%E0%A4%B2%E0%A5%87%E0%A4%B8-Bluetooth-%E0%A4%AE%E0%A4%BE%E0%A4%87%E0%A4%95-%E0%A4%B8%E0%A5%8D%E0%A4%AA%E0%A5%80%E0%A4%95%E0%A4%B0/product-reviews/B00TFGVULI?reviewerType=all_reviews&pageNumber=5
https://www.amazon.in//%E0%A4%AA%E0%A5%8B%E0%A4%B0%E0%A5%8D%E0%A4%9F%E0%A5%87%E0%A4%AC%E0%A4%B2-%E0%A4%B5%E0%A4%BE%E0%A4%AF%E0%A4%B0%E0%A4%B2%E0%A5%87%E0%A4%B8-Bluetooth-%E0%A4%AE%E0%A4%BE%E0%A4%87%E0%A4%95-%E0%A4%B8%E0%A5%8D%E0%A4%AA%E0%A5%80%E0%A4%95%E0%A4%B0/product-reviews/B00TFGVULI?reviewerType=all_reviews&pageNumber=6
https://www.amazon.in//%E0%A4%AA%E0%A5%8B%E0%A4%B0%E0%A5%8D%E0%A4%9F%E0%A5%87%E0%A4%AC%E0%A4%B2-%E0%A4%B5%E0%A4%BE%E0%A4%AF%E0%A4%B0%E0%A4%B2%E0%A5%87%E0%A4%B8-Bluetooth-%E0%A4%AE%E0%A4%BE%E0%A4%87%E0%A4%95-%E0%A4%B8%E0%A5%8D%E0%A4%AA%E0%A5%80%E0%A4%95%E0%A4%B0/product-reviews/B00TFGVULI?reviewerType=all_reviews&pageNumber=7
https://www.amazon.in//%E0%A4%AA%E0%A5%8B%E0%A4%B0%E0%A5%8D%E0%A4%9F%E0%A5%87%E0%A4%AC%E0%A4%B2-%E0%A4%B5%E0%A4%BE%E0%A4%AF%E0%A4%B0%E0%A4%B2%E0%A5%87%E0%A4%B8-Bluetooth-%E0%A4%AE%E0%A4%BE%E0%A4%87%E0%A4%95-%E0%A4%B8%E0%A5%8D%E0%A4%AA%E0%A5%80%E0%A4%95%E0%A4%B0/product-reviews/B00TFGVULI?reviewerType=all_reviews&pageNumber=8
https://www.amazon.in//%E0%A4%AA%E0%A5%8B%E0%A4%B0%E0%A5%8D%E0%A4%9F%E0%A5%87%E0%A4%AC%E0%A4%B2-%E0%A4%B5%E0%A4%BE%E0%A4%AF%E0%A4%B0%E0%A4%B2%E0%A5%87%E0%A4%B8-Bluetooth-%E0%A4%AE%E0%A4%BE%E0%A4%87%E0%A4%95-%E0%A4%B8%E0%A5%8D%E0%A4%AA%E0%A5%80%E0%A4%95%E0%A4%B0/product-reviews/B00TFGVULI?reviewerType=all_reviews&pageNumber=9
https://www.amazon.in//%E0%A4%AA%E0%A5%8B%E0%A4%B0%E0%A5%8D%E0%A4%9F%E0%A5%87%E0%A4%AC%E0%A4%B2-%E0%A4%B5%E0%A4%BE%E0%A4%AF%E0%A4%B0%E0%A4%B2%E0%A5%87%E0%A4%B8-Bluetooth-%E0%A4%AE%E0%A4%BE%E0%A4%87%E0%A4%95-%E0%A4%B8%E0%A5%8D%E0%A4%AA%E0%A5%80%E0%A4%95%E0%A4%B0/product-reviews/B00TFGVULI?reviewerType=all_reviews&pageNumber=10
https://www.amazon.in//JBL-Powerful-Waterproof-Bluetooth-Powerbank/product-reviews/B083ZS4BDZ?reviewerType=all_reviews&pageNumber=1
https://www.amazon.in//JBL-Powerful-Waterproof-Bluetooth-Powerbank/product-reviews/B083ZS4BDZ?reviewerType=all_reviews&pageNumber=2
https://www.amazon.in//JBL-Powerful-Waterproof-Bluetooth-Powerbank/product-reviews/B083ZS4BDZ?reviewerType=all_reviews&pageNumber=3
https://www.amazon.in//JBL-Powerful-Waterproof-Bluetooth-Powerbank/product-reviews/B083ZS4BDZ?reviewerType=all_reviews&pageNumber=4
https://www.amazon.in//JBL-Powerful-Waterproof-Bluetooth-Powerbank/product-reviews/B083ZS4BDZ?reviewerType=all_reviews&pageNumber=5
https://www.amazon.in//JBL-Powerful-Waterproof-Bluetooth-Powerbank/product-reviews/B083ZS4BDZ?reviewerType=all_reviews&pageNumber=6
https://www.amazon.in//JBL-Powerful-Waterproof-Bluetooth-Powerbank/product-reviews/B083ZS4BDZ?reviewerType=all_reviews&pageNumber=7
https://www.amazon.in//JBL-Powerful-Waterproof-Bluetooth-Powerbank/product-reviews/B083ZS4BDZ?reviewerType=all_reviews&pageNumber=8
https://www.amazon.in//JBL-Powerful-Waterproof-Bluetooth-Powerbank/product-reviews/B083ZS4BDZ?reviewerType=all_reviews&pageNumber=9
https://www.amazon.in//JBL-Powerful-Waterproof-Bluetooth-Powerbank/product-reviews/B083ZS4BDZ?reviewerType=all_reviews&pageNumber=10
https://www.amazon.in//JBL-Powerful-Waterproof-Bluetooth-Powerbank/product-reviews/B083ZS4BDZ?reviewerType=all_reviews&pageNumber=1
https://www.amazon.in//JBL-Powerful-Waterproof-Bluetooth-Powerbank/product-reviews/B083ZS4BDZ?reviewerType=all_reviews&pageNumber=2
https://www.amazon.in//JBL-Powerful-Waterproof-Bluetooth-Powerbank/product-reviews/B083ZS4BDZ?reviewerType=all_reviews&pageNumber=3

https://www.amazon.in//JBL-Powerful-Waterproof-Bluetooth-Powerbank/product-reviews/B083ZS4BDZ?reviewerType=all_reviews&pageNumber=4
https://www.amazon.in//JBL-Powerful-Waterproof-Bluetooth-Powerbank/product-reviews/B083ZS4BDZ?reviewerType=all_reviews&pageNumber=5
https://www.amazon.in//JBL-Powerful-Waterproof-Bluetooth-Powerbank/product-reviews/B083ZS4BDZ?reviewerType=all_reviews&pageNumber=6
https://www.amazon.in//JBL-Powerful-Waterproof-Bluetooth-Powerbank/product-reviews/B083ZS4BDZ?reviewerType=all_reviews&pageNumber=7
https://www.amazon.in//JBL-Powerful-Waterproof-Bluetooth-Powerbank/product-reviews/B083ZS4BDZ?reviewerType=all_reviews&pageNumber=8
https://www.amazon.in//JBL-Powerful-Waterproof-Bluetooth-Powerbank/product-reviews/B083ZS4BDZ?reviewerType=all_reviews&pageNumber=9
https://www.amazon.in//JBL-Powerful-Waterproof-Bluetooth-Powerbank/product-reviews/B083ZS4BDZ?reviewerType=all_reviews&pageNumber=10
https://www.amazon.in//JBL-Ultra-Portable-Wireless-Bluetooth-Speaker/product-reviews/B083ZRNJCQ?reviewerType=all_reviews&pageNumber=1
https://www.amazon.in//JBL-Ultra-Portable-Wireless-Bluetooth-Speaker/product-reviews/B083ZRNJCQ?reviewerType=all_reviews&pageNumber=2
https://www.amazon.in//JBL-Ultra-Portable-Wireless-Bluetooth-Speaker/product-reviews/B083ZRNJCQ?reviewerType=all_reviews&pageNumber=3
https://www.amazon.in//JBL-Ultra-Portable-Wireless-Bluetooth-Speaker/product-reviews/B083ZRNJCQ?reviewerType=all_reviews&pageNumber=4
https://www.amazon.in//JBL-Ultra-Portable-Wireless-Bluetooth-Speaker/product-reviews/B083ZRNJCQ?reviewerType=all_reviews&pageNumber=5
https://www.amazon.in//JBL-Ultra-Portable-Wireless-Bluetooth-Speaker/product-reviews/B083ZRNJCQ?reviewerType=all_reviews&pageNumber=6
https://www.amazon.in//JBL-Ultra-Portable-Wireless-Bluetooth-Speaker/product-reviews/B083ZRNJCQ?reviewerType=all_reviews&pageNumber=7
https://www.amazon.in//JBL-Ultra-Portable-Wireless-Bluetooth-Speaker/product-reviews/B083ZRNJCQ?reviewerType=all_reviews&pageNumber=8
https://www.amazon.in//JBL-Ultra-Portable-Wireless-Bluetooth-Speaker/product-reviews/B083ZRNJCQ?reviewerType=all_reviews&pageNumber=9
https://www.amazon.in//JBL-Ultra-Portable-Wireless-Bluetooth-Speaker/product-reviews/B083ZRNJCQ?reviewerType=all_reviews&pageNumber=10
https://www.amazon.in//JBL-Ultra-Portable-Wireless-Bluetooth-Speaker/product-reviews/B083ZRNJCQ?reviewerType=all_reviews&pageNumber=1
https://www.amazon.in//JBL-Ultra-Portable-Wireless-Bluetooth-Speaker/product-reviews/B083ZRNJCQ?reviewerType=all_reviews&pageNumber=2
https://www.amazon.in//JBL-Ultra-Portable-Wireless-Bluetooth-Speaker/product-reviews/B083ZRNJCQ?reviewerType=all_reviews&pageNumber=3
https://www.amazon.in//JBL-Ultra-Portable-Wireless-Bluetooth-Speaker/product-reviews/B083ZRNJCQ?reviewerType=all_reviews&pageNumber=4
https://www.amazon.in//JBL-Ultra-Portable-Wireless-Bluetooth-Speaker/product-reviews/B083ZRNJCQ?reviewerType=all_reviews&pageNumber=5
https://www.amazon.in//JBL-Ultra-Portable-Wireless-Bluetooth-Speaker/product-reviews/B083ZRNJCQ?reviewerType=all_reviews&pageNumber=6
https://www.amazon.in//JBL-Ultra-Portable-Wireless-Bluetooth-Speaker/product-reviews/B083ZRNJCQ?reviewerType=all_reviews&pageNumber=7
https://www.amazon.in//JBL-Ultra-Portable-Wireless-Bluetooth-Speaker/product-reviews/B083ZRNJCQ?reviewerType=all_reviews&pageNumber=8
https://www.amazon.in//JBL-Ultra-Portable-Wireless-Bluetooth-Speaker/product-reviews/B083ZRNJCQ?reviewerType=all_reviews&pageNumber=9
https://www.amazon.in//JBL-Ultra-Portable-Wireless-Bluetooth-Speaker/product-reviews/B083ZRNJCQ?reviewerType=all_reviews&pageNumber=10
https://www.amazon.in//JBL-Portable-Waterproof-Bluetooth-Speaker/product-reviews/B07B8T92W1?reviewerType=all_reviews&pageNumber=1
https://www.amazon.in//JBL-Portable-Waterproof-Bluetooth-Speaker/product-reviews/B07B8T92W1?reviewerType=all_reviews&pageNumber=2
https://www.amazon.in//JBL-Portable-Waterproof-Bluetooth-Speaker/product-reviews/B07B8T92W1?reviewerType=all_reviews&pageNumber=3
https://www.amazon.in//JBL-Portable-Waterproof-Bluetooth-Speaker/product-reviews/B07B8T92W1?reviewerType=all_reviews&pageNumber=4
https://www.amazon.in//JBL-Portable-Waterproof-Bluetooth-Speaker/product-reviews/B07B8T92W1?reviewerType=all_reviews&pageNumber=5
https://www.amazon.in//JBL-Portable-Waterproof-Bluetooth-Speaker/product-reviews/B07B8T92W1?reviewerType=all_reviews&pageNumber=6
https://www.amazon.in//JBL-Portable-Waterproof-Bluetooth-Speaker/product-reviews/B07B8T92W1?reviewerType=all_reviews&pageNumber=7
https://www.amazon.in//JBL-Portable-Waterproof-Bluetooth-Speaker/product-reviews/B07B8T92W1?reviewerType=all_reviews&pageNumber=8
https://www.amazon.in//JBL-Portable-Waterproof-Bluetooth-Speaker/product-reviews/B07B8T92W1?reviewerType=all_reviews&pageNumber=9
https://www.amazon.in//JBL-Portable-Waterproof-Bluetooth-Speaker/product-reviews/B07B8T92W1?reviewerType=all_reviews&pageNumber=10
https://www.amazon.in//JBL-Portable-Waterproof-Bluetooth-Speaker/product-reviews/B07B8T92W1?reviewerType=all_reviews&pageNumber=1
https://www.amazon.in//JBL-Portable-Waterproof-Bluetooth-Speaker/product-reviews/B07B8T92W1?reviewerType=all_reviews&pageNumber=2
https://www.amazon.in//JBL-Portable-Waterproof-Bluetooth-Speaker/product-reviews/B07B8T92W1?reviewerType=all_reviews&pageNumber=3
https://www.amazon.in//JBL-Portable-Waterproof-Bluetooth-Speaker/product-reviews/B07B8T92W1?reviewerType=all_reviews&pageNumber=4
https://www.amazon.in//JBL-Portable-Waterproof-Bluetooth-Speaker/product-reviews/B07B8T92W1?reviewerType=all_reviews&pageNumber=5
https://www.amazon.in//JBL-Portable-Waterproof-Bluetooth-Speaker/product-reviews/B07B8T92W1?reviewerType=all_reviews&pageNumber=6
https://www.amazon.in//JBL-Portable-Waterproof-Bluetooth-Speaker/product-reviews/B07B8T92W1?reviewerType=all_reviews&pageNumber=7
https://www.amazon.in//JBL-Portable-Waterproof-Bluetooth-Speaker/product-reviews/B07B8T92W1?reviewerType=all_reviews&pageNumber=8
https://www.amazon.in//JBL-Portable-Waterproof-Bluetooth-Speaker/product-reviews/B07B8T92W1?reviewerType=all_reviews&pageNumber=9
https://www.amazon.in//JBL-Portable-Waterproof-Bluetooth-Speaker/product-reviews/B07B8T92W1?reviewerType=all_reviews&pageNumber=10
https://www.amazon.in//JBL-SRX728-18-inch-Singel-Subwoofer/product-reviews/B000Y01I84/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=1
https://www.amazon.in//JBL-SRX728-18-inch-Singel-Subwoofer/product-reviews/B000Y01I84/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=2
https://www.amazon.in//JBL-SRX728-18-inch-Singel-Subwoofer/product-reviews/B000Y01I84/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=3
https://www.amazon.in//JBL-SRX728-18-inch-Singel-Subwoofer/product-reviews/B000Y01I84/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=4
https://www.amazon.in//JBL-SRX728-18-inch-Singel-Subwoofer/product-reviews/B000Y01I84/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=5
https://www.amazon.in//JBL-SRX728-18-inch-Singel-Subwoofer/product-reviews/B000Y01I84/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=6
https://www.amazon.in//JBL-SRX728-18-inch-Singel-Subwoofer/product-reviews/B000Y01I84/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=7
https://www.amazon.in//JBL-SRX728-18-inch-Singel-Subwoofer/product-reviews/B000Y01I84/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=8
https://www.amazon.in//JBL-SRX728-18-inch-Singel-Subwoofer/product-reviews/B000Y01I84/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=9
https://www.amazon.in//JBL-SRX728-18-inch-Singel-Subwoofer/product-reviews/B000Y01I84/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=10
https://www.amazon.in//JBL-Portable-Bluetooth-Waterproof-Speaker/product-reviews/B07B8THDLF/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=1
https://www.amazon.in//JBL-Portable-Bluetooth-Waterproof-Speaker/product-reviews/B07B8THDLF/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=2
https://www.amazon.in//JBL-Portable-Bluetooth-Waterproof-Speaker/product-reviews/B07B8THDLF/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=3

https://www.amazon.in//JBL-Portable-Bluetooth-Waterproof-Speaker/product-reviews/B07B8THDLF/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=4
https://www.amazon.in//JBL-Portable-Bluetooth-Waterproof-Speaker/product-reviews/B07B8THDLF/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=5
https://www.amazon.in//JBL-Portable-Bluetooth-Waterproof-Speaker/product-reviews/B07B8THDLF/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=6
https://www.amazon.in//JBL-Portable-Bluetooth-Waterproof-Speaker/product-reviews/B07B8THDLF/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=7
https://www.amazon.in//JBL-Portable-Bluetooth-Waterproof-Speaker/product-reviews/B07B8THDLF/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=8
https://www.amazon.in//JBL-Portable-Bluetooth-Waterproof-Speaker/product-reviews/B07B8THDLF/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=9
https://www.amazon.in//JBL-Portable-Bluetooth-Waterproof-Speaker/product-reviews/B07B8THDLF/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=10
https://www.amazon.in//JBL-Portable-Bluetooth-Waterproof-Speaker/product-reviews/B07B8THDLF/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=1
https://www.amazon.in//JBL-Portable-Bluetooth-Waterproof-Speaker/product-reviews/B07B8THDLF/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=2
https://www.amazon.in//JBL-Portable-Bluetooth-Waterproof-Speaker/product-reviews/B07B8THDLF/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=3
https://www.amazon.in//JBL-Portable-Bluetooth-Waterproof-Speaker/product-reviews/B07B8THDLF/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=4
https://www.amazon.in//JBL-Portable-Bluetooth-Waterproof-Speaker/product-reviews/B07B8THDLF/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=5
https://www.amazon.in//JBL-Portable-Bluetooth-Waterproof-Speaker/product-reviews/B07B8THDLF/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=6
https://www.amazon.in//JBL-Portable-Bluetooth-Waterproof-Speaker/product-reviews/B07B8THDLF/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=7
https://www.amazon.in//JBL-Portable-Bluetooth-Waterproof-Speaker/product-reviews/B07B8THDLF/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=8
https://www.amazon.in//JBL-Portable-Bluetooth-Waterproof-Speaker/product-reviews/B07B8THDLF/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=9
https://www.amazon.in//JBL-Portable-Bluetooth-Waterproof-Speaker/product-reviews/B07B8THDLF/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=10
https://www.amazon.in//JBL-FLIP3-Wireless-Bluetooth-Streaming/product-reviews/B0145L65S0/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=1
https://www.amazon.in//JBL-FLIP3-Wireless-Bluetooth-Streaming/product-reviews/B0145L65S0/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=2
https://www.amazon.in//JBL-FLIP3-Wireless-Bluetooth-Streaming/product-reviews/B0145L65S0/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=3
https://www.amazon.in//JBL-FLIP3-Wireless-Bluetooth-Streaming/product-reviews/B0145L65S0/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=4
https://www.amazon.in//JBL-FLIP3-Wireless-Bluetooth-Streaming/product-reviews/B0145L65S0/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=5
https://www.amazon.in//JBL-FLIP3-Wireless-Bluetooth-Streaming/product-reviews/B0145L65S0/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=6
https://www.amazon.in//JBL-FLIP3-Wireless-Bluetooth-Streaming/product-reviews/B0145L65S0/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=7
https://www.amazon.in//JBL-FLIP3-Wireless-Bluetooth-Streaming/product-reviews/B0145L65S0/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=8
https://www.amazon.in//JBL-FLIP3-Wireless-Bluetooth-Streaming/product-reviews/B0145L65S0/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=9
https://www.amazon.in//JBL-FLIP3-Wireless-Bluetooth-Streaming/product-reviews/B0145L65S0/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=10
https://www.amazon.in//JBL-FLIP3-Wireless-Bluetooth-Streaming/product-reviews/B0145L65S0/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=1
https://www.amazon.in//JBL-FLIP3-Wireless-Bluetooth-Streaming/product-reviews/B0145L65S0/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=2
https://www.amazon.in//JBL-FLIP3-Wireless-Bluetooth-Streaming/product-reviews/B0145L65S0/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=3
https://www.amazon.in//JBL-FLIP3-Wireless-Bluetooth-Streaming/product-reviews/B0145L65S0/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=4
https://www.amazon.in//JBL-FLIP3-Wireless-Bluetooth-Streaming/product-reviews/B0145L65S0/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=5
https://www.amazon.in//JBL-FLIP3-Wireless-Bluetooth-Streaming/product-reviews/B0145L65S0/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=6
https://www.amazon.in//JBL-FLIP3-Wireless-Bluetooth-Streaming/product-reviews/B0145L65S0/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=7
https://www.amazon.in//JBL-FLIP3-Wireless-Bluetooth-Streaming/product-reviews/B0145L65S0/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=8
https://www.amazon.in//JBL-FLIP3-Wireless-Bluetooth-Streaming/product-reviews/B0145L65S0/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=9
https://www.amazon.in//JBL-FLIP3-Wireless-Bluetooth-Streaming/product-reviews/B0145L65S0/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=10
https://www.amazon.in//JBL-Professional-EON-Compact-Professional-Grade/product-reviews/B07YBPHBTR?reviewerType=all_reviews&pageNumber=1
https://www.amazon.in//JBL-Professional-EON-Compact-Professional-Grade/product-reviews/B07YBPHBTR?reviewerType=all_reviews&pageNumber=2
https://www.amazon.in//JBL-Professional-EON-Compact-Professional-Grade/product-reviews/B07YBPHBTR?reviewerType=all_reviews&pageNumber=3
https://www.amazon.in//JBL-Professional-EON-Compact-Professional-Grade/product-reviews/B07YBPHBTR?reviewerType=all_reviews&pageNumber=4
https://www.amazon.in//JBL-Professional-EON-Compact-Professional-Grade/product-reviews/B07YBPHBTR?reviewerType=all_reviews&pageNumber=5
https://www.amazon.in//JBL-Professional-EON-Compact-Professional-Grade/product-reviews/B07YBPHBTR?reviewerType=all_reviews&pageNumber=6
https://www.amazon.in//JBL-Professional-EON-Compact-Professional-Grade/product-reviews/B07YBPHBTR?reviewerType=all_reviews&pageNumber=7
https://www.amazon.in//JBL-Professional-EON-Compact-Professional-Grade/product-reviews/B07YBPHBTR?reviewerType=all_reviews&pageNumber=8
https://www.amazon.in//JBL-Professional-EON-Compact-Professional-Grade/product-reviews/B07YBPHBTR?reviewerType=all_reviews&pageNumber=9
https://www.amazon.in//JBL-Professional-EON-Compact-Professional-Grade/product-reviews/B07YBPHBTR?reviewerType=all_reviews&pageNumber=10
https://www.amazon.in//JBL-Professional-EON-Compact-Professional-Grade/product-reviews/B07YBPHBTR?reviewerType=all_reviews&pageNumber=1
https://www.amazon.in//JBL-Professional-EON-Compact-Professional-Grade/product-reviews/B07YBPHBTR?reviewerType=all_reviews&pageNumber=2
https://www.amazon.in//JBL-Professional-EON-Compact-Professional-Grade/product-reviews/B07YBPHBTR?reviewerType=all_reviews&pageNumber=3
https://www.amazon.in//JBL-Professional-EON-Compact-Professional-Grade/product-reviews/B07YBPHBTR?reviewerType=all_reviews&pageNumber=4
https://www.amazon.in//JBL-Professional-EON-Compact-Professional-Grade/product-reviews/B07YBPHBTR?reviewerType=all_reviews&pageNumber=5
https://www.amazon.in//JBL-Professional-EON-Compact-Professional-Grade/product-reviews/B07YBPHBTR?reviewerType=all_reviews&pageNumber=6

https://www.amazon.in//JBL-Professional-EON-Compact-Professional-Grade/product-reviews/B07YBPHBTR?reviewerType=all_reviews&pageNumber=7
https://www.amazon.in//JBL-Professional-EON-Compact-Professional-Grade/product-reviews/B07YBPHBTR?reviewerType=all_reviews&pageNumber=8
https://www.amazon.in//JBL-Professional-EON-Compact-Professional-Grade/product-reviews/B07YBPHBTR?reviewerType=all_reviews&pageNumber=9
https://www.amazon.in//JBL-Professional-EON-Compact-Professional-Grade/product-reviews/B07YBPHBTR?reviewerType=all_reviews&pageNumber=10
https://www.amazon.in//JBL-Flip-Portable-Wireless-Powerful/product-reviews/B076CG24YJ?reviewerType=all_reviews&pageNumber=1
https://www.amazon.in//JBL-Flip-Portable-Wireless-Powerful/product-reviews/B076CG24YJ?reviewerType=all_reviews&pageNumber=2
https://www.amazon.in//JBL-Flip-Portable-Wireless-Powerful/product-reviews/B076CG24YJ?reviewerType=all_reviews&pageNumber=3
https://www.amazon.in//JBL-Flip-Portable-Wireless-Powerful/product-reviews/B076CG24YJ?reviewerType=all_reviews&pageNumber=4
https://www.amazon.in//JBL-Flip-Portable-Wireless-Powerful/product-reviews/B076CG24YJ?reviewerType=all_reviews&pageNumber=5
https://www.amazon.in//JBL-Flip-Portable-Wireless-Powerful/product-reviews/B076CG24YJ?reviewerType=all_reviews&pageNumber=6
https://www.amazon.in//JBL-Flip-Portable-Wireless-Powerful/product-reviews/B076CG24YJ?reviewerType=all_reviews&pageNumber=7
https://www.amazon.in//JBL-Flip-Portable-Wireless-Powerful/product-reviews/B076CG24YJ?reviewerType=all_reviews&pageNumber=8
https://www.amazon.in//JBL-Flip-Portable-Wireless-Powerful/product-reviews/B076CG24YJ?reviewerType=all_reviews&pageNumber=9
https://www.amazon.in//JBL-Flip-Portable-Wireless-Powerful/product-reviews/B076CG24YJ?reviewerType=all_reviews&pageNumber=10
https://www.amazon.in//JBL-Flip-Portable-Wireless-Powerful/product-reviews/B076CG24YJ?reviewerType=all_reviews&pageNumber=1
https://www.amazon.in//JBL-Flip-Portable-Wireless-Powerful/product-reviews/B076CG24YJ?reviewerType=all_reviews&pageNumber=2
https://www.amazon.in//JBL-Flip-Portable-Wireless-Powerful/product-reviews/B076CG24YJ?reviewerType=all_reviews&pageNumber=3
https://www.amazon.in//JBL-Flip-Portable-Wireless-Powerful/product-reviews/B076CG24YJ?reviewerType=all_reviews&pageNumber=4
https://www.amazon.in//JBL-Flip-Portable-Wireless-Powerful/product-reviews/B076CG24YJ?reviewerType=all_reviews&pageNumber=5
https://www.amazon.in//JBL-Flip-Portable-Wireless-Powerful/product-reviews/B076CG24YJ?reviewerType=all_reviews&pageNumber=6
https://www.amazon.in//JBL-Flip-Portable-Wireless-Powerful/product-reviews/B076CG24YJ?reviewerType=all_reviews&pageNumber=7
https://www.amazon.in//JBL-Flip-Portable-Wireless-Powerful/product-reviews/B076CG24YJ?reviewerType=all_reviews&pageNumber=8
https://www.amazon.in//JBL-Flip-Portable-Wireless-Powerful/product-reviews/B076CG24YJ?reviewerType=all_reviews&pageNumber=9
https://www.amazon.in//JBL-Flip-Portable-Wireless-Powerful/product-reviews/B076CG24YJ?reviewerType=all_reviews&pageNumber=10
https://www.amazon.in//GT-X1500THI-12-%E0%A4%87%E0%A4%82%E0%A4%9A-%E0%A4%B8%E0%A4%AC%E0%A4%B5%E0%A5%82%E0%A5%9E%E0%A4%B0-%E0%A4%AC%E0%A5%87%E0%A4%B8-%E0%A4%B0%E0%A4%BF%E0%A5%9E%E0%A5%8D%E0%A4%B2%E0%A5%87%E0%A4%95%E0%A5%8D%E0%A4%B8-%E0%A4%8F%E0%A4%A8%E0%A4%95%E0%A5%8D%E0%A4%B2%E0%A5%8B%E0%A5%9B%E0%A4%B0/product-reviews/B07NT2FQDC/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=1
https://www.amazon.in//GT-X1500THI-12-%E0%A4%87%E0%A4%82%E0%A4%9A-%E0%A4%B8%E0%A4%AC%E0%A4%B5%E0%A5%82%E0%A5%9E%E0%A4%B0-%E0%A4%AC%E0%A5%87%E0%A4%B8-%E0%A4%B0%E0%A4%BF%E0%A5%9E%E0%A5%8D%E0%A4%B2%E0%A5%87%E0%A4%95%E0%A5%8D%E0%A4%B8-%E0%A4%8F%E0%A4%A8%E0%A4%95%E0%A5%8D%E0%A4%B2%E0%A5%8B%E0%A5%9B%E0%A4%B0/product-reviews/B07NT2FQDC/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=2
https://www.amazon.in//GT-X1500THI-12-%E0%A4%87%E0%A4%82%E0%A4%9A-%E0%A4%B8%E0%A4%AC%E0%A4%B5%E0%A5%82%E0%A5%9E%E0%A4%B0-%E0%A4%AC%E0%A5%87%E0%A4%B8-%E0%A4%B0%E0%A4%BF%E0%A5%9E%E0%A5%8D%E0%A4%B2%E0%A5%87%E0%A4%95%E0%A5%8D%E0%A4%B8-%E0%A4%8F%E0%A4%A8%E0%A4%95%E0%A5%8D%E0%A4%B2%E0%A5%8B%E0%A5%9B%E0%A4%B0/product-reviews/B07NT2FQDC/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=3
https://www.amazon.in//GT-X1500THI-12-%E0%A4%87%E0%A4%82%E0%A4%9A-%E0%A4%B8%E0%A4%AC%E0%A4%B5%E0%A5%82%E0%A5%9E%E0%A4%B0-%E0%A4%AC%E0%A5%87%E0%A4%B8-%E0%A4%B0%E0%A4%BF%E0%A5%9E%E0%A5%8D%E0%A4%B2%E0%A5%87%E0%A4%95%E0%A5%8D%E0%A4%B8-%E0%A4%8F%E0%A4%A8%E0%A4%95%E0%A5%8D%E0%A4%B2%E0%A5%8B%E0%A5%9B%E0%A4%B0/product-reviews/B07NT2FQDC/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=4
https://www.amazon.in//GT-X1500THI-12-%E0%A4%87%E0%A4%82%E0%A4%9A-%E0%A4%B8%E0%A4%AC%E0%A4%B5%E0%A5%82%E0%A5%9E%E0%A4%B0-%E0%A4%AC%E0%A5%87%E0%A4%B8-%E0%A4%B0%E0%A4%BF%E0%A5%9E%E0%A5%8D%E0%A4%B2%E0%A5%87%E0%A4%95%E0%A5%8D%E0%A4%B8-%E0%A4%8F%E0%A4%A8%E0%A4%95%E0%A5%8D%E0%A4%B2%E0%A5%8B%E0%A5%9B%E0%A4%B0/product-reviews/B07NT2FQDC/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=5
https://www.amazon.in//GT-X1500THI-12-%E0%A4%87%E0%A4%82%E0%A4%9A-%E0%A4%B8%E0%A4%AC%E0%A4%B5%E0%A5%82%E0%A5%9E%E0%A4%B0-%E0%A4%AC%E0%A5%87%E0%A4%B8-%E0%A4%B0%E0%A4%BF%E0%A5%9E%E0%A5%8D%E0%A4%B2%E0%A5%87%E0%A4%95%E0%A5%8D%E0%A4%B8-%E0%A4%8F%E0%A4%A8%E0%A4%95%E0%A5%8D%E0%A4%B2%E0%A5%8B%E0%A5%9B%E0%A4%B0/product-reviews/B07NT2FQDC/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=6
https://www.amazon.in//GT-X1500THI-12-%E0%A4%87%E0%A4%82%E0%A4%9A-%E0%A4%B8%E0%A4%AC%E0%A4%B5%E0%A5%82%E0%A5%9E%E0%A4%B0-%E0%A4%AC%E0%A5%87%E0%A4%B8-%E0%A4%B0%E0%A4%BF%E0%A5%9E%E0%A5%8D%E0%A4%B2%E0%A5%87%E0%A4%95%E0%A5%8D%E0%A4%B8-%E0%A4%8F%E0%A4%A8%E0%A4%95%E0%A5%8D%E0%A4%B2%E0%A5%8B%E0%A5%9B%E0%A4%B0/product-reviews/B07NT2FQDC/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=7
https://www.amazon.in//GT-X1500THI-12-%E0%A4%87%E0%A4%82%E0%A4%9A-%E0%A4%B8%E0%A4%AC%E0%A4%B5%E0%A5%82%E0%A5%9E%E0%A4%B0-%E0%A4%AC%E0%A5%87%E0%A4%B8-%E0%A4%B0%E0%A4%BF%E0%A5%9E%E0%A5%8D%E0%A4%B2%E0%A5%87%E0%A4%95%E0%A5%8D%E0%A4%B8-%E0%A4%8F%E0%A4%A8%E0%A4%95%E0%A5%8D%E0%A4%B2%E0%A5%8B%E0%A5%9B%E0%A4%B0/product-reviews/B07NT2FQDC/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=8
https://www.amazon.in//GT-X1500THI-12-%E0%A4%87%E0%A4%82%E0%A4%9A-%E0%A4%B8%E0%A4%AC%E0%A4%B5%E0%A5%82%E0%A5%9E%E0%A4%B0-%E0%A4%AC%E0%A5%87%E0%A4%B8-%E0%A4%B0%E0%A4%BF%E0%A5%9E%E0%A5%8D%E0%A4%B2%E0%A5%87%E0%A4%95%E0%A5%8D%E0%A4%B8-%E0%A4%8F%E0%A4%A8%E0%A4%95%E0%A5%8D%E0%A4%B2%E0%A5%8B%E0%A5%9B%E0%A4%B0/product-reviews/B07NT2FQDC/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=9
https://www.amazon.in//GT-X1500THI-12-%E0%A4%87%E0%A4%82%E0%A4%9A-%E0%A4%B8%E0%A4%AC%E0%A4%B5%E0%A5%82%E0%A5%9E%E0%A4%B0-%E0%A4%AC%E0%A5%87%E0%A4%B8-%E0%A4%B0%E0%A4%BF%E0%A5%9E%E0%A5%8D%E0%A4%B2%E0%A5%87%E0%A4%95%E0%A5%8D%E0%A4%B8-%E0%A4%8F%E0%A4%A8%E0%A4%95%E0%A5%8D%E0%A4%B2%E0%A5%8B%E0%A5%9B%E0%A4%B0/product-reviews/B07NT2FQDC/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=10
https://www.amazon.in//JBL-EON206P-Portable-System-Black/product-reviews/B00TZW9BJK?reviewerType=all_reviews&pageNumber=1
https://www.amazon.in//JBL-EON206P-Portable-System-Black/product-reviews/B00TZW9BJK?reviewerType=all_reviews&pageNumber=2
https://www.amazon.in//JBL-EON206P-Portable-System-Black/product-reviews/B00TZW9BJK?reviewerType=all_reviews&pageNumber=3
https://www.amazon.in//JBL-EON206P-Portable-System-Black/product-reviews/B00TZW9BJK?reviewerType=all_reviews&pageNumber=4
https://www.amazon.in//JBL-EON206P-Portable-System-Black/product-reviews/B00TZW9BJK?reviewerType=all_reviews&pageNumber=5
https://www.amazon.in//JBL-EON206P-Portable-System-Black/product-reviews/B00TZW9BJK?reviewerType=all_reviews&pageNumber=6
https://www.amazon.in//JBL-EON206P-Portable-System-Black/product-reviews/B00TZW9BJK?reviewerType=all_reviews&pageNumber=7
https://www.amazon.in//JBL-EON206P-Portable-System-Black/product-reviews/B00TZW9BJK?reviewerType=all_reviews&pageNumber=8
https://www.amazon.in//JBL-EON206P-Portable-System-Black/product-reviews/B00TZW9BJK?reviewerType=all_reviews&pageNumber=9
https://www.amazon.in//JBL-EON206P-Portable-System-Black/product-reviews/B00TZW9BJK?reviewerType=all_reviews&pageNumber=10

https://www.amazon.in//JBL-EON206P-Portable-System-Black/product-reviews/B00TZW9BJK?reviewerType=all_reviews&pageNumber=1
https://www.amazon.in//JBL-EON206P-Portable-System-Black/product-reviews/B00TZW9BJK?reviewerType=all_reviews&pageNumber=2
https://www.amazon.in//JBL-EON206P-Portable-System-Black/product-reviews/B00TZW9BJK?reviewerType=all_reviews&pageNumber=3
https://www.amazon.in//JBL-EON206P-Portable-System-Black/product-reviews/B00TZW9BJK?reviewerType=all_reviews&pageNumber=4
https://www.amazon.in//JBL-EON206P-Portable-System-Black/product-reviews/B00TZW9BJK?reviewerType=all_reviews&pageNumber=5
https://www.amazon.in//JBL-EON206P-Portable-System-Black/product-reviews/B00TZW9BJK?reviewerType=all_reviews&pageNumber=6
https://www.amazon.in//JBL-EON206P-Portable-System-Black/product-reviews/B00TZW9BJK?reviewerType=all_reviews&pageNumber=7
https://www.amazon.in//JBL-EON206P-Portable-System-Black/product-reviews/B00TZW9BJK?reviewerType=all_reviews&pageNumber=8
https://www.amazon.in//JBL-EON206P-Portable-System-Black/product-reviews/B00TZW9BJK?reviewerType=all_reviews&pageNumber=9
https://www.amazon.in//JBL-EON206P-Portable-System-Black/product-reviews/B00TZW9BJK?reviewerType=all_reviews&pageNumber=10
https://www.amazon.in//JBL-JRX215-Sound-Passive-Speakers/product-reviews/B00CYNTFES/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=1
https://www.amazon.in//JBL-JRX215-Sound-Passive-Speakers/product-reviews/B00CYNTFES/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=2
https://www.amazon.in//JBL-JRX215-Sound-Passive-Speakers/product-reviews/B00CYNTFES/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=3
https://www.amazon.in//JBL-JRX215-Sound-Passive-Speakers/product-reviews/B00CYNTFES/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=4
https://www.amazon.in//JBL-JRX215-Sound-Passive-Speakers/product-reviews/B00CYNTFES/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=5
https://www.amazon.in//JBL-JRX215-Sound-Passive-Speakers/product-reviews/B00CYNTFES/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=6
https://www.amazon.in//JBL-JRX215-Sound-Passive-Speakers/product-reviews/B00CYNTFES/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=7
https://www.amazon.in//JBL-JRX215-Sound-Passive-Speakers/product-reviews/B00CYNTFES/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=8
https://www.amazon.in//JBL-JRX215-Sound-Passive-Speakers/product-reviews/B00CYNTFES/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=9
https://www.amazon.in//JBL-JRX215-Sound-Passive-Speakers/product-reviews/B00CYNTFES/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=10
https://www.amazon.in//JBL-JRX215-Sound-Passive-Speakers/product-reviews/B00CYNTFES/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=1
https://www.amazon.in//JBL-JRX215-Sound-Passive-Speakers/product-reviews/B00CYNTFES/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=2
https://www.amazon.in//JBL-JRX215-Sound-Passive-Speakers/product-reviews/B00CYNTFES/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=3
https://www.amazon.in//JBL-JRX215-Sound-Passive-Speakers/product-reviews/B00CYNTFES/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=4
https://www.amazon.in//JBL-JRX215-Sound-Passive-Speakers/product-reviews/B00CYNTFES/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=5
https://www.amazon.in//JBL-JRX215-Sound-Passive-Speakers/product-reviews/B00CYNTFES/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=6
https://www.amazon.in//JBL-JRX215-Sound-Passive-Speakers/product-reviews/B00CYNTFES/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=7
https://www.amazon.in//JBL-JRX215-Sound-Passive-Speakers/product-reviews/B00CYNTFES/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=8
https://www.amazon.in//JBL-JRX215-Sound-Passive-Speakers/product-reviews/B00CYNTFES/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=9
https://www.amazon.in//JBL-JRX215-Sound-Passive-Speakers/product-reviews/B00CYNTFES/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=10
https://www.amazon.in//Renewed-JBL-Portable-Waterproof-Bluetooth/product-reviews/B07R4DVRCW/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=1
https://www.amazon.in//Renewed-JBL-Portable-Waterproof-Bluetooth/product-reviews/B07R4DVRCW/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=2
https://www.amazon.in//Renewed-JBL-Portable-Waterproof-Bluetooth/product-reviews/B07R4DVRCW/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=3
https://www.amazon.in//Renewed-JBL-Portable-Waterproof-Bluetooth/product-reviews/B07R4DVRCW/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=4
https://www.amazon.in//Renewed-JBL-Portable-Waterproof-Bluetooth/product-reviews/B07R4DVRCW/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=5
https://www.amazon.in//Renewed-JBL-Portable-Waterproof-Bluetooth/product-reviews/B07R4DVRCW/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=6
https://www.amazon.in//Renewed-JBL-Portable-Waterproof-Bluetooth/product-reviews/B07R4DVRCW/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=7
https://www.amazon.in//Renewed-JBL-Portable-Waterproof-Bluetooth/product-reviews/B07R4DVRCW/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=8
https://www.amazon.in//Renewed-JBL-Portable-Waterproof-Bluetooth/product-reviews/B07R4DVRCW/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=9
https://www.amazon.in//Renewed-JBL-Portable-Waterproof-Bluetooth/product-reviews/B07R4DVRCW/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=10
https://www.amazon.in//Renewed-JBL-Portable-Waterproof-Bluetooth/product-reviews/B07R4DVRCW/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=1
https://www.amazon.in//Renewed-JBL-Portable-Waterproof-Bluetooth/product-reviews/B07R4DVRCW/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=2
https://www.amazon.in//Renewed-JBL-Portable-Waterproof-Bluetooth/product-reviews/B07R4DVRCW/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=3
https://www.amazon.in//Renewed-JBL-Portable-Waterproof-Bluetooth/product-reviews/B07R4DVRCW/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=4
https://www.amazon.in//Renewed-JBL-Portable-Waterproof-Bluetooth/product-reviews/B07R4DVRCW/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=5
https://www.amazon.in//Renewed-JBL-Portable-Waterproof-Bluetooth/product-reviews/B07R4DVRCW/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=6
https://www.amazon.in//Renewed-JBL-Portable-Waterproof-Bluetooth/product-reviews/B07R4DVRCW/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=7
https://www.amazon.in//Renewed-JBL-Portable-Waterproof-Bluetooth/product-reviews/B07R4DVRCW/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=8
https://www.amazon.in//Renewed-JBL-Portable-Waterproof-Bluetooth/product-reviews/B07R4DVRCW/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=9
https://www.amazon.in//Renewed-JBL-Portable-Waterproof-Bluetooth/product-reviews/B07R4DVRCW/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=10
https://www.amazon.in//JBL-Waterproof-Bluetooth-Speaker-PartyBoost/product-reviews/B07SVHCL7H/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=1
https://www.amazon.in//JBL-Waterproof-Bluetooth-Speaker-PartyBoost/product-reviews/B07SVHCL7H/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=2
https://www.amazon.in//JBL-Waterproof-Bluetooth-Speaker-PartyBoost/product-reviews/B07SVHCL7H/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=3

https://www.amazon.in//JBL-Waterproof-Bluetooth-Speaker-PartyBoost/product-reviews/B07SVHCL7H/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=4
https://www.amazon.in//JBL-Waterproof-Bluetooth-Speaker-PartyBoost/product-reviews/B07SVHCL7H/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=5
https://www.amazon.in//JBL-Waterproof-Bluetooth-Speaker-PartyBoost/product-reviews/B07SVHCL7H/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=6
https://www.amazon.in//JBL-Waterproof-Bluetooth-Speaker-PartyBoost/product-reviews/B07SVHCL7H/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=7
https://www.amazon.in//JBL-Waterproof-Bluetooth-Speaker-PartyBoost/product-reviews/B07SVHCL7H/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=8
https://www.amazon.in//JBL-Waterproof-Bluetooth-Speaker-PartyBoost/product-reviews/B07SVHCL7H/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=9
https://www.amazon.in//JBL-Waterproof-Bluetooth-Speaker-PartyBoost/product-reviews/B07SVHCL7H/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=10
https://www.amazon.in//JBL-Waterproof-Bluetooth-Speaker-PartyBoost/product-reviews/B07SVHCL7H/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=1
https://www.amazon.in//JBL-Waterproof-Bluetooth-Speaker-PartyBoost/product-reviews/B07SVHCL7H/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=2
https://www.amazon.in//JBL-Waterproof-Bluetooth-Speaker-PartyBoost/product-reviews/B07SVHCL7H/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=3
https://www.amazon.in//JBL-Waterproof-Bluetooth-Speaker-PartyBoost/product-reviews/B07SVHCL7H/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=4
https://www.amazon.in//JBL-Waterproof-Bluetooth-Speaker-PartyBoost/product-reviews/B07SVHCL7H/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=5
https://www.amazon.in//JBL-Waterproof-Bluetooth-Speaker-PartyBoost/product-reviews/B07SVHCL7H/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=6
https://www.amazon.in//JBL-Waterproof-Bluetooth-Speaker-PartyBoost/product-reviews/B07SVHCL7H/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=7
https://www.amazon.in//JBL-Waterproof-Bluetooth-Speaker-PartyBoost/product-reviews/B07SVHCL7H/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=8
https://www.amazon.in//JBL-Waterproof-Bluetooth-Speaker-PartyBoost/product-reviews/B07SVHCL7H/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=9
https://www.amazon.in//JBL-Waterproof-Bluetooth-Speaker-PartyBoost/product-reviews/B07SVHCL7H/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=10
https://www.amazon.in//JBL-Libra-500-Mixer-Amplifiers/product-reviews/B073W9ZLD1/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=1
https://www.amazon.in//JBL-Libra-500-Mixer-Amplifiers/product-reviews/B073W9ZLD1/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=2
https://www.amazon.in//JBL-Libra-500-Mixer-Amplifiers/product-reviews/B073W9ZLD1/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=3
https://www.amazon.in//JBL-Libra-500-Mixer-Amplifiers/product-reviews/B073W9ZLD1/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=4
https://www.amazon.in//JBL-Libra-500-Mixer-Amplifiers/product-reviews/B073W9ZLD1/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=5
https://www.amazon.in//JBL-Libra-500-Mixer-Amplifiers/product-reviews/B073W9ZLD1/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=6
https://www.amazon.in//JBL-Libra-500-Mixer-Amplifiers/product-reviews/B073W9ZLD1/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=7
https://www.amazon.in//JBL-Libra-500-Mixer-Amplifiers/product-reviews/B073W9ZLD1/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=8
https://www.amazon.in//JBL-Libra-500-Mixer-Amplifiers/product-reviews/B073W9ZLD1/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=9
https://www.amazon.in//JBL-Libra-500-Mixer-Amplifiers/product-reviews/B073W9ZLD1/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=10
https://www.amazon.in//JBL-Boombox-Portable-Bluetooth-Waterproof/product-reviews/B07PY95KRZ/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=1
https://www.amazon.in//JBL-Boombox-Portable-Bluetooth-Waterproof/product-reviews/B07PY95KRZ/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=2
https://www.amazon.in//JBL-Boombox-Portable-Bluetooth-Waterproof/product-reviews/B07PY95KRZ/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=3
https://www.amazon.in//JBL-Boombox-Portable-Bluetooth-Waterproof/product-reviews/B07PY95KRZ/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=4
https://www.amazon.in//JBL-Boombox-Portable-Bluetooth-Waterproof/product-reviews/B07PY95KRZ/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=5
https://www.amazon.in//JBL-Boombox-Portable-Bluetooth-Waterproof/product-reviews/B07PY95KRZ/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=6
https://www.amazon.in//JBL-Boombox-Portable-Bluetooth-Waterproof/product-reviews/B07PY95KRZ/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=7
https://www.amazon.in//JBL-Boombox-Portable-Bluetooth-Waterproof/product-reviews/B07PY95KRZ/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=8
https://www.amazon.in//JBL-Boombox-Portable-Bluetooth-Waterproof/product-reviews/B07PY95KRZ/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=9
https://www.amazon.in//JBL-Boombox-Portable-Bluetooth-Waterproof/product-reviews/B07PY95KRZ/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=10
https://www.amazon.in//CERTIFIED-REFURBISHED-JBL-Splashproof-Bluetooth/product-reviews/B00J0EGEHU/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=1
https://www.amazon.in//CERTIFIED-REFURBISHED-JBL-Splashproof-Bluetooth/product-reviews/B00J0EGEHU/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=2
https://www.amazon.in//CERTIFIED-REFURBISHED-JBL-Splashproof-Bluetooth/product-reviews/B00J0EGEHU/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=3
https://www.amazon.in//CERTIFIED-REFURBISHED-JBL-Splashproof-Bluetooth/product-reviews/B00J0EGEHU/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=4
https://www.amazon.in//CERTIFIED-REFURBISHED-JBL-Splashproof-Bluetooth/product-reviews/B00J0EGEHU/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=5
https://www.amazon.in//CERTIFIED-REFURBISHED-JBL-Splashproof-Bluetooth/product-reviews/B00J0EGEHU/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=6
https://www.amazon.in//CERTIFIED-REFURBISHED-JBL-Splashproof-Bluetooth/product-reviews/B00J0EGEHU/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=7
https://www.amazon.in//CERTIFIED-REFURBISHED-JBL-Splashproof-Bluetooth/product-reviews/B00J0EGEHU/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=8
https://www.amazon.in//CERTIFIED-REFURBISHED-JBL-Splashproof-Bluetooth/product-reviews/B00J0EGEHU/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=9
https://www.amazon.in//CERTIFIED-REFURBISHED-JBL-Splashproof-Bluetooth/product-reviews/B00J0EGEHU/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=10
https://www.amazon.in//JBL-Portable-Wireless-Speaker-Powerful/product-reviews/B0764HJG8V/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=1
https://www.amazon.in//JBL-Portable-Wireless-Speaker-Powerful/product-reviews/B0764HJG8V/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=2
https://www.amazon.in//JBL-Portable-Wireless-Speaker-Powerful/product-reviews/B0764HJG8V/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=3

https://www.amazon.in//JBL-Portable-Wireless-Speaker-Powerful/product-reviews/B0764HJG8V/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=4
https://www.amazon.in//JBL-Portable-Wireless-Speaker-Powerful/product-reviews/B0764HJG8V/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=5
https://www.amazon.in//JBL-Portable-Wireless-Speaker-Powerful/product-reviews/B0764HJG8V/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=6
https://www.amazon.in//JBL-Portable-Wireless-Speaker-Powerful/product-reviews/B0764HJG8V/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=7
https://www.amazon.in//JBL-Portable-Wireless-Speaker-Powerful/product-reviews/B0764HJG8V/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=8
https://www.amazon.in//JBL-Portable-Wireless-Speaker-Powerful/product-reviews/B0764HJG8V/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=9
https://www.amazon.in//JBL-Portable-Wireless-Speaker-Powerful/product-reviews/B0764HJG8V/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=10
https://www.amazon.in//JBL-Portable-Wireless-Speaker-Powerful/product-reviews/B0764HJG8V/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=1
https://www.amazon.in//JBL-Portable-Wireless-Speaker-Powerful/product-reviews/B0764HJG8V/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=2
https://www.amazon.in//JBL-Portable-Wireless-Speaker-Powerful/product-reviews/B0764HJG8V/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=3
https://www.amazon.in//JBL-Portable-Wireless-Speaker-Powerful/product-reviews/B0764HJG8V/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=4
https://www.amazon.in//JBL-Portable-Wireless-Speaker-Powerful/product-reviews/B0764HJG8V/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=5
https://www.amazon.in//JBL-Portable-Wireless-Speaker-Powerful/product-reviews/B0764HJG8V/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=6
https://www.amazon.in//JBL-Portable-Wireless-Speaker-Powerful/product-reviews/B0764HJG8V/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=7
https://www.amazon.in//JBL-Portable-Wireless-Speaker-Powerful/product-reviews/B0764HJG8V/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=8
https://www.amazon.in//JBL-Portable-Wireless-Speaker-Powerful/product-reviews/B0764HJG8V/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=9
https://www.amazon.in//JBL-Portable-Wireless-Speaker-Powerful/product-reviews/B0764HJG8V/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=10
https://www.amazon.in//JBL-Waterproof-Bluetooth-Speaker-PartyBoost/product-reviews/B07SWLWPXW/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=1
https://www.amazon.in//JBL-Waterproof-Bluetooth-Speaker-PartyBoost/product-reviews/B07SWLWPXW/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=2
https://www.amazon.in//JBL-Waterproof-Bluetooth-Speaker-PartyBoost/product-reviews/B07SWLWPXW/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=3
https://www.amazon.in//JBL-Waterproof-Bluetooth-Speaker-PartyBoost/product-reviews/B07SWLWPXW/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=4
https://www.amazon.in//JBL-Waterproof-Bluetooth-Speaker-PartyBoost/product-reviews/B07SWLWPXW/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=5
https://www.amazon.in//JBL-Waterproof-Bluetooth-Speaker-PartyBoost/product-reviews/B07SWLWPXW/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=6
https://www.amazon.in//JBL-Waterproof-Bluetooth-Speaker-PartyBoost/product-reviews/B07SWLWPXW/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=7
https://www.amazon.in//JBL-Waterproof-Bluetooth-Speaker-PartyBoost/product-reviews/B07SWLWPXW/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=8
https://www.amazon.in//JBL-Waterproof-Bluetooth-Speaker-PartyBoost/product-reviews/B07SWLWPXW/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=9
https://www.amazon.in//JBL-Waterproof-Bluetooth-Speaker-PartyBoost/product-reviews/B07SWLWPXW/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=10
https://www.amazon.in//JBL-Waterproof-Bluetooth-Speaker-PartyBoost/product-reviews/B07SWLWPXW/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=1
https://www.amazon.in//JBL-Waterproof-Bluetooth-Speaker-PartyBoost/product-reviews/B07SWLWPXW/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=2
https://www.amazon.in//JBL-Waterproof-Bluetooth-Speaker-PartyBoost/product-reviews/B07SWLWPXW/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=3
https://www.amazon.in//JBL-Waterproof-Bluetooth-Speaker-PartyBoost/product-reviews/B07SWLWPXW/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=4
https://www.amazon.in//JBL-Waterproof-Bluetooth-Speaker-PartyBoost/product-reviews/B07SWLWPXW/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=5
https://www.amazon.in//JBL-Waterproof-Bluetooth-Speaker-PartyBoost/product-reviews/B07SWLWPXW/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=6
https://www.amazon.in//JBL-Waterproof-Bluetooth-Speaker-PartyBoost/product-reviews/B07SWLWPXW/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=7
https://www.amazon.in//JBL-Waterproof-Bluetooth-Speaker-PartyBoost/product-reviews/B07SWLWPXW/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=8
https://www.amazon.in//JBL-Waterproof-Bluetooth-Speaker-PartyBoost/product-reviews/B07SWLWPXW/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=9
https://www.amazon.in//JBL-Waterproof-Bluetooth-Speaker-PartyBoost/product-reviews/B07SWLWPXW/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=10
https://www.amazon.in//JBL-T460BT-Extra-Wireless-Headphones/product-reviews/B07MKRJY53/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=1
https://www.amazon.in//JBL-T460BT-Extra-Wireless-Headphones/product-reviews/B07MKRJY53/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=2
https://www.amazon.in//JBL-T460BT-Extra-Wireless-Headphones/product-reviews/B07MKRJY53/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=3
https://www.amazon.in//JBL-T460BT-Extra-Wireless-Headphones/product-reviews/B07MKRJY53/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=4
https://www.amazon.in//JBL-T460BT-Extra-Wireless-Headphones/product-reviews/B07MKRJY53/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=5
https://www.amazon.in//JBL-T460BT-Extra-Wireless-Headphones/product-reviews/B07MKRJY53/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=6
https://www.amazon.in//JBL-T460BT-Extra-Wireless-Headphones/product-reviews/B07MKRJY53/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=7
https://www.amazon.in//JBL-T460BT-Extra-Wireless-Headphones/product-reviews/B07MKRJY53/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=8
https://www.amazon.in//JBL-T460BT-Extra-Wireless-Headphones/product-reviews/B07MKRJY53/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=9
https://www.amazon.in//JBL-T460BT-Extra-Wireless-Headphones/product-reviews/B07MKRJY53/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=10
https://www.amazon.in//JBL-T460BT-Extra-Wireless-Headphones/product-reviews/B07MKRJY53/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=1
https://www.amazon.in//JBL-T460BT-Extra-Wireless-Headphones/product-reviews/B07MKRJY53/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=2
https://www.amazon.in//JBL-T460BT-Extra-Wireless-Headphones/product-reviews/B07MKRJY53/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=3

https://www.amazon.in//JBL-T460BT-Extra-Wireless-Headphones/product-reviews/B07MKRJY53/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=4
https://www.amazon.in//JBL-T460BT-Extra-Wireless-Headphones/product-reviews/B07MKRJY53/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=5
https://www.amazon.in//JBL-T460BT-Extra-Wireless-Headphones/product-reviews/B07MKRJY53/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=6
https://www.amazon.in//JBL-T460BT-Extra-Wireless-Headphones/product-reviews/B07MKRJY53/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=7
https://www.amazon.in//JBL-T460BT-Extra-Wireless-Headphones/product-reviews/B07MKRJY53/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=8
https://www.amazon.in//JBL-T460BT-Extra-Wireless-Headphones/product-reviews/B07MKRJY53/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=9
https://www.amazon.in//JBL-T460BT-Extra-Wireless-Headphones/product-reviews/B07MKRJY53/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=10
https://www.amazon.in//JBL-Portable-Speaker-Waterproof-Hardshell/product-reviews/B085TR2SSR/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=1
https://www.amazon.in//JBL-Portable-Speaker-Waterproof-Hardshell/product-reviews/B085TR2SSR/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=2
https://www.amazon.in//JBL-Portable-Speaker-Waterproof-Hardshell/product-reviews/B085TR2SSR/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=3
https://www.amazon.in//JBL-Portable-Speaker-Waterproof-Hardshell/product-reviews/B085TR2SSR/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=4
https://www.amazon.in//JBL-Portable-Speaker-Waterproof-Hardshell/product-reviews/B085TR2SSR/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=5
https://www.amazon.in//JBL-Portable-Speaker-Waterproof-Hardshell/product-reviews/B085TR2SSR/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=6
https://www.amazon.in//JBL-Portable-Speaker-Waterproof-Hardshell/product-reviews/B085TR2SSR/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=7
https://www.amazon.in//JBL-Portable-Speaker-Waterproof-Hardshell/product-reviews/B085TR2SSR/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=8
https://www.amazon.in//JBL-Portable-Speaker-Waterproof-Hardshell/product-reviews/B085TR2SSR/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=9
https://www.amazon.in//JBL-Portable-Speaker-Waterproof-Hardshell/product-reviews/B085TR2SSR/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=10
https://www.amazon.in//JBL-T205BT-Wireless-Earbud-Headphones/product-reviews/B07B9G75Z9/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=1
https://www.amazon.in//JBL-T205BT-Wireless-Earbud-Headphones/product-reviews/B07B9G75Z9/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=2
https://www.amazon.in//JBL-T205BT-Wireless-Earbud-Headphones/product-reviews/B07B9G75Z9/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=3
https://www.amazon.in//JBL-T205BT-Wireless-Earbud-Headphones/product-reviews/B07B9G75Z9/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=4
https://www.amazon.in//JBL-T205BT-Wireless-Earbud-Headphones/product-reviews/B07B9G75Z9/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=5
https://www.amazon.in//JBL-T205BT-Wireless-Earbud-Headphones/product-reviews/B07B9G75Z9/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=6
https://www.amazon.in//JBL-T205BT-Wireless-Earbud-Headphones/product-reviews/B07B9G75Z9/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=7
https://www.amazon.in//JBL-T205BT-Wireless-Earbud-Headphones/product-reviews/B07B9G75Z9/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=8
https://www.amazon.in//JBL-T205BT-Wireless-Earbud-Headphones/product-reviews/B07B9G75Z9/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=9
https://www.amazon.in//JBL-T205BT-Wireless-Earbud-Headphones/product-reviews/B07B9G75Z9/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=10
https://www.amazon.in//JBL-T205BT-Wireless-Earbud-Headphones/product-reviews/B07B9G75Z9/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=1
https://www.amazon.in//JBL-T205BT-Wireless-Earbud-Headphones/product-reviews/B07B9G75Z9/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=2
https://www.amazon.in//JBL-T205BT-Wireless-Earbud-Headphones/product-reviews/B07B9G75Z9/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=3
https://www.amazon.in//JBL-T205BT-Wireless-Earbud-Headphones/product-reviews/B07B9G75Z9/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=4
https://www.amazon.in//JBL-T205BT-Wireless-Earbud-Headphones/product-reviews/B07B9G75Z9/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=5
https://www.amazon.in//JBL-T205BT-Wireless-Earbud-Headphones/product-reviews/B07B9G75Z9/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=6
https://www.amazon.in//JBL-T205BT-Wireless-Earbud-Headphones/product-reviews/B07B9G75Z9/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=7
https://www.amazon.in//JBL-T205BT-Wireless-Earbud-Headphones/product-reviews/B07B9G75Z9/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=8
https://www.amazon.in//JBL-T205BT-Wireless-Earbud-Headphones/product-reviews/B07B9G75Z9/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=9
https://www.amazon.in//JBL-T205BT-Wireless-Earbud-Headphones/product-reviews/B07B9G75Z9/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=10
https://www.amazon.in//JBL-GX-600C-%E0%A4%95%E0%A5%89%E0%A4%AE%E0%A5%8D%E0%A4%AA%E0%A5%8B%E0%A4%A8%E0%A5%87%E0%A4%A8%E0%A5%8D%E0%A4%9F-%E0%A4%B8%E0%A5%80%E0%A4%95%E0%A4%B0-%E0%A4%B8%E0%A4%BF%E0%A4%B8%E0%A5%8D%E0%A4%9F%E0%A4%AE/product-reviews/B00MUKN7I0/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=1
https://www.amazon.in//JBL-GX-600C-%E0%A4%95%E0%A5%89%E0%A4%AE%E0%A5%8D%E0%A4%AA%E0%A5%8B%E0%A4%A8%E0%A5%87%E0%A4%A8%E0%A5%8D%E0%A4%9F-%E0%A4%B8%E0%A5%80%E0%A4%95%E0%A4%B0-%E0%A4%B8%E0%A4%BF%E0%A4%B8%E0%A5%8D%E0%A4%9F%E0%A4%AE/product-reviews/B00MUKN7I0/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=2
https://www.amazon.in//JBL-GX-600C-%E0%A4%95%E0%A5%89%E0%A4%AE%E0%A5%8D%E0%A4%AA%E0%A5%8B%E0%A4%A8%E0%A5%87%E0%A4%A8%E0%A5%8D%E0%A4%9F-%E0%A4%B8%E0%A5%80%E0%A4%95%E0%A4%B0-%E0%A4%B8%E0%A4%BF%E0%A4%B8%E0%A5%8D%E0%A4%9F%E0%A4%AE/product-reviews/B00MUKN7I0/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=3
https://www.amazon.in//JBL-GX-600C-%E0%A4%95%E0%A5%89%E0%A4%AE%E0%A5%8D%E0%A4%AA%E0%A5%8B%E0%A4%A8%E0%A5%87%E0%A4%A8%E0%A5%8D%E0%A4%9F-%E0%A4%B8%E0%A5%80%E0%A4%95%E0%A4%B0-%E0%A4%B8%E0%A4%BF%E0%A4%B8%E0%A5%8D%E0%A4%9F%E0%A4%AE/product-reviews/B00MUKN7I0/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=4
https://www.amazon.in//JBL-GX-600C-%E0%A4%95%E0%A5%89%E0%A4%AE%E0%A5%8D%E0%A4%AA%E0%A5%8B%E0%A4%A8%E0%A5%87%E0%A4%A8%E0%A5%8D%E0%A4%9F-%E0%A4%B8%E0%A5%80%E0%A4%95%E0%A4%B0-%E0%A4%B8%E0%A4%BF%E0%A4%B8%E0%A5%8D%E0%A4%9F%E0%A4%AE/product-reviews/B00MUKN7I0/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=5
https://www.amazon.in//JBL-GX-600C-%E0%A4%95%E0%A5%89%E0%A4%AE%E0%A5%8D%E0%A4%AA%E0%A5%8B%E0%A4%A8%E0%A5%87%E0%A4%A8%E0%A5%8D%E0%A4%9F-%E0%A4%B8%E0%A5%80%E0%A4%95%E0%A4%B0-%E0%A4%B8%E0%A4%BF%E0%A4%B8%E0%A5%8D%E0%A4%9F%E0%A4%AE/product-reviews/B00MUKN7I0/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=6
https://www.amazon.in//JBL-GX-600C-%E0%A4%95%E0%A5%89%E0%A4%AE%E0%A5%8D%E0%A4%AA%E0%A5%8B%E0%A4%A8%E0%A5%87%E0%A4%A8%E0%A5%8D%E0%A4%9F-%E0%A4%B8%E0%A5%80%E0%A4%95%E0%A4%B0-%E0%A4%B8%E0%A4%BF%E0%A4%B8%E0%A5%8D%E0%A4%9F%E0%A4%AE/product-reviews/B00MUKN7I0/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=7

https://www.amazon.in//JBL-GX-600C-%E0%A4%95%E0%A5%89%E0%A4%AE%E0%A5%8D%E0%A4%AA%E0%A5%8B%E0%A4%A8%E0%A5%87%E0%A4%A8%E0%A5%8D%E0%A4%9F-%E0%A4%B8%E0%A5%80%E0%A4%95%E0%A4%B0-%E0%A4%B8%E0%A4%BF%E0%A4%B8%E0%A5%8D%E0%A4%9F%E0%A4%AE/product-reviews/B00MUKN7I0/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=8
https://www.amazon.in//JBL-GX-600C-%E0%A4%95%E0%A5%89%E0%A4%AE%E0%A5%8D%E0%A4%AA%E0%A5%8B%E0%A4%A8%E0%A5%87%E0%A4%A8%E0%A5%8D%E0%A4%9F-%E0%A4%B8%E0%A5%80%E0%A4%95%E0%A4%B0-%E0%A4%B8%E0%A4%BF%E0%A4%B8%E0%A5%8D%E0%A4%9F%E0%A4%AE/product-reviews/B00MUKN7I0/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=9
https://www.amazon.in//JBL-GX-600C-%E0%A4%95%E0%A5%89%E0%A4%AE%E0%A5%8D%E0%A4%AA%E0%A5%8B%E0%A4%A8%E0%A5%87%E0%A4%A8%E0%A5%8D%E0%A4%9F-%E0%A4%B8%E0%A5%80%E0%A4%95%E0%A4%B0-%E0%A4%B8%E0%A4%BF%E0%A4%B8%E0%A5%8D%E0%A4%9F%E0%A4%AE/product-reviews/B00MUKN7I0/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=10
https://www.amazon.in//JBL-GX-600C-%E0%A4%95%E0%A5%89%E0%A4%AE%E0%A5%8D%E0%A4%AA%E0%A5%8B%E0%A4%A8%E0%A5%87%E0%A4%A8%E0%A5%8D%E0%A4%9F-%E0%A4%B8%E0%A5%80%E0%A4%95%E0%A4%B0-%E0%A4%B8%E0%A4%BF%E0%A4%B8%E0%A5%8D%E0%A4%9F%E0%A4%AE/product-reviews/B00MUKN7I0/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=1
https://www.amazon.in//JBL-GX-600C-%E0%A4%95%E0%A5%89%E0%A4%AE%E0%A5%8D%E0%A4%AA%E0%A5%8B%E0%A4%A8%E0%A5%87%E0%A4%A8%E0%A5%8D%E0%A4%9F-%E0%A4%B8%E0%A5%80%E0%A4%95%E0%A4%B0-%E0%A4%B8%E0%A4%BF%E0%A4%B8%E0%A5%8D%E0%A4%9F%E0%A4%AE/product-reviews/B00MUKN7I0/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=2
https://www.amazon.in//JBL-GX-600C-%E0%A4%95%E0%A5%89%E0%A4%AE%E0%A5%8D%E0%A4%AA%E0%A5%8B%E0%A4%A8%E0%A5%87%E0%A4%A8%E0%A5%8D%E0%A4%9F-%E0%A4%B8%E0%A5%80%E0%A4%95%E0%A4%B0-%E0%A4%B8%E0%A4%BF%E0%A4%B8%E0%A5%8D%E0%A4%9F%E0%A4%AE/product-reviews/B00MUKN7I0/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=3
https://www.amazon.in//JBL-GX-600C-%E0%A4%95%E0%A5%89%E0%A4%AE%E0%A5%8D%E0%A4%AA%E0%A5%8B%E0%A4%A8%E0%A5%87%E0%A4%A8%E0%A5%8D%E0%A4%9F-%E0%A4%B8%E0%A5%80%E0%A4%95%E0%A4%B0-%E0%A4%B8%E0%A4%BF%E0%A4%B8%E0%A5%8D%E0%A4%9F%E0%A4%AE/product-reviews/B00MUKN7I0/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=4
https://www.amazon.in//JBL-GX-600C-%E0%A4%95%E0%A5%89%E0%A4%AE%E0%A5%8D%E0%A4%AA%E0%A5%8B%E0%A4%A8%E0%A5%87%E0%A4%A8%E0%A5%8D%E0%A4%9F-%E0%A4%B8%E0%A5%80%E0%A4%95%E0%A4%B0-%E0%A4%B8%E0%A4%BF%E0%A4%B8%E0%A5%8D%E0%A4%9F%E0%A4%AE/product-reviews/B00MUKN7I0/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=5
https://www.amazon.in//JBL-GX-600C-%E0%A4%95%E0%A5%89%E0%A4%AE%E0%A5%8D%E0%A4%AA%E0%A5%8B%E0%A4%A8%E0%A5%87%E0%A4%A8%E0%A5%8D%E0%A4%9F-%E0%A4%B8%E0%A5%80%E0%A4%95%E0%A4%B0-%E0%A4%B8%E0%A4%BF%E0%A4%B8%E0%A5%8D%E0%A4%9F%E0%A4%AE/product-reviews/B00MUKN7I0/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=6
https://www.amazon.in//JBL-GX-600C-%E0%A4%95%E0%A5%89%E0%A4%AE%E0%A5%8D%E0%A4%AA%E0%A5%8B%E0%A4%A8%E0%A5%87%E0%A4%A8%E0%A5%8D%E0%A4%9F-%E0%A4%B8%E0%A5%80%E0%A4%95%E0%A4%B0-%E0%A4%B8%E0%A4%BF%E0%A4%B8%E0%A5%8D%E0%A4%9F%E0%A4%AE/product-reviews/B00MUKN7I0/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=7
https://www.amazon.in//JBL-GX-600C-%E0%A4%95%E0%A5%89%E0%A4%AE%E0%A5%8D%E0%A4%AA%E0%A5%8B%E0%A4%A8%E0%A5%87%E0%A4%A8%E0%A5%8D%E0%A4%9F-%E0%A4%B8%E0%A5%80%E0%A4%95%E0%A4%B0-%E0%A4%B8%E0%A4%BF%E0%A4%B8%E0%A5%8D%E0%A4%9F%E0%A4%AE/product-reviews/B00MUKN7I0/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=8
https://www.amazon.in//JBL-GX-600C-%E0%A4%95%E0%A5%89%E0%A4%AE%E0%A5%8D%E0%A4%AA%E0%A5%8B%E0%A4%A8%E0%A5%87%E0%A4%A8%E0%A5%8D%E0%A4%9F-%E0%A4%B8%E0%A5%80%E0%A4%95%E0%A4%B0-%E0%A4%B8%E0%A4%BF%E0%A4%B8%E0%A5%8D%E0%A4%9F%E0%A4%AE/product-reviews/B00MUKN7I0/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=9
https://www.amazon.in//JBL-GX-600C-%E0%A4%95%E0%A5%89%E0%A4%AE%E0%A5%8D%E0%A4%AA%E0%A5%8B%E0%A4%A8%E0%A5%87%E0%A4%A8%E0%A5%8D%E0%A4%9F-%E0%A4%B8%E0%A5%80%E0%A4%95%E0%A4%B0-%E0%A4%B8%E0%A4%BF%E0%A4%B8%E0%A5%8D%E0%A4%9F%E0%A4%AE/product-reviews/B00MUKN7I0/ref=cm_cr_dp_d_show_all_btm?ie=UTF8&reviewerType=all_reviews&pageNumber=10

In [11]:
df=pd.DataFrame()
df['reviews']=reviews
df['rating']=ratings
df.to_csv('sample_review.csv',index=False)
df

                                                reviews              rating
0     \nI bought this after reading many reviews on ...  3.0 out of 5 stars
1     \nAverage speaker, i bought it for watching mo...  3.0 out of 5 stars
2     \nExcellent product from JBL, I really loved i...  5.0 out of 5 stars
3     \nExcellent product from JBL, I really loved i...  5.0 out of 5 stars
4     \nSuperb voice. With good copy of songs, you g...  5.0 out of 5 stars
5     \nTruth be told I'm not much of a techie perso...  5.0 out of 5 stars
6     \n1. Portable: The JBL Go Portable Speakers is...  4.0 out of 5 stars
7     \nIt's been 1.5 years since the time I purchas...  5.0 out of 5 stars
8     \nReceived the product today, am in love with ...  5.0 out of 5 stars
9     \nI got it for 1399 rs during sale, and for th...  5.0 out of 5 stars
10    \nIt STOPED functioning very next day. I purch...  1.0 out of 5 stars
11    \nThis speaker sucks, I have used JBL flip 4 a...  2.0 out of 5 stars
12    \nIt is one of the best. The only problem is t...  5.0 out of 5 stars
13    \nSuperb. Sound quality minimizes a little whe...  5.0 out of 5 stars
14    \nIt is unbelievable unless you see it and use...  5.0 out of 5 stars
15    \nJBL..... This name is everything for me bcoz...  5.0 out of 5 stars
16    \nJBL Go, Just Amazed Me. I knew It would be g...  5.0 out of 5 stars
17    \nVery clearly, the day I got I really expecte...  3.0 out of 5 stars
18    \nOverhyped product. Worst sound quality. Only...  1.0 out of 5 stars
19    \nMy only concern while buying a pocket speake...  5.0 out of 5 stars
20    \ngood one better sound quality and very handy...  4.0 out of 5 stars
21    \nReally liked the reviews about the product s...  1.0 out of 5 stars
22    \nExtremely disappointed with Amazon. A defect...  1.0 out of 5 stars
23    \nIt got broken the very next day! Faulty prod...  1.0 out of 5 stars
24    \nFirst let's talk about it's build quality :-...  5.0 out of 5 stars
25    \nGood speaker for 1400₹.Pros1. Low & Mid are ...  4.0 out of 5 stars
26    \nI bought this jbl speaker for my laptop sinc...  4.0 out of 5 stars
27    \nSorry to say but I was delivered a faulty pr...  1.0 out of 5 stars
28    \nThis is one of the finest devices for travel...  4.0 out of 5 stars
29    \nDon't go for the brand guys. The speaker is ...  1.0 out of 5 stars
...                                                 ...                 ...
1966  \nAfter using 20 days am writing the review .I...  5.0 out of 5 stars
1967  \nIt's an awesome pair of earphones with very ...  4.0 out of 5 stars
1968  \nVery disappointed, with the product, The rig...  1.0 out of 5 stars
1969  \nAs most reviews say it, the ear piece is eas...  5.0 out of 5 stars
1970  \nThis earphone or earpod so to say has superb...  5.0 out of 5 stars
1971  \nThese pair of Headphones were supplied by Ap...  1.0 out of 5 stars
1972  \nOne of those good bluetooth earphones in the...  5.0 out of 5 stars
1973  \nReceived an hour back from Amazon agent and ...  1.0 out of 5 stars
1974  \nBest of the active wireless headphones i hav...  5.0 out of 5 stars
1975  \nUntil it was working, the product was great....  1.0 out of 5 stars
1976  \nWithin 10 days of buying these headphones, t...  1.0 out of 5 stars
1977  \nBluetooth Connectivity :- GoodNoise Cancella...  3.0 out of 5 stars
1978  \nActually dare to listenit is a JBL earpod......  5.0 out of 5 stars
1979  \nTHE PRODUCT WAS GOOD UNTILL IT STOPPED WORKI...  1.0 out of 5 stars
1980  \nAt the price I paid I think this was the bes...  4.0 out of 5 stars
1981  \nI was confused with mix reviews. But once I ...  5.0 out of 5 stars
1982  \nIdk why people are complaining about this pr...  5.0 out of 5 stars
1983  \nYou will not feel them in your ears, if you ...  5.0 out of 5 stars
1984  \nFrom the image of product it looks like the ...  3.0 out of 5 stars
1985  \nPros: Very good sound quality (for the price...  4.0 out of 5 stars
1986  \nFor a product thats made for mobility, this ...  1.0 out of 5 stars
1987  \nYES THERE IS GOOD BASS AND CLARITYBUT DUE TO...  3.0 out of 5 stars
1988  \nMusic quality is excellent. Have to try whil...  4.0 out of 5 stars
1989  \nI am not a very technical guy, but I love mu...  3.0 out of 5 stars
1990  \nBuild quality of speakers is too good. It ha...  5.0 out of 5 stars
1991     \nas name says JBL...nice product..nice deal\n  5.0 out of 5 stars
1992  \nDont fall for wrong info this is the best sp...  5.0 out of 5 stars
1993  \nBuild quality of speakers is too good. It ha...  5.0 out of 5 stars
1994     \nas name says JBL...nice product..nice deal\n  5.0 out of 5 stars
1995  \nDont fall for wrong info this is the best sp...  5.0 out of 5 stars

[1996 rows x 2 columns]

# !Hurray We completed data analysis on Pandas and numpy